ASTSreq = {
    "36": {
        "Equities": {
            "ALL_TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Процентный доход, выраженный в валюте расчетов"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки инициирующей заключение сделки - \"купля/продажа\""
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "FACEAMOUNT",
                        "Объем по номиналу",
                        "FIXED",
                        "16.2",
                        "Объем сделки по номиналу, выраженный в валюте номинала"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была заключена сделка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ]
                ],
                "title": "Все сделки (обновляемая)",
                "desc": "Таблица содержит общую информацию (без указания сторон по сделке) по всем сделкам купли/продажи финансовых инструментов, совершенным в Торговой Системе с начала торговой сессии"
            },
            "AUCTSTATS": {
                "output": [
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDTIME",
                        "Запланированное время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона (из расписания торгов)"
                    ],
                    [
                        "STARTTIME",
                        "Время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона"
                    ],
                    [
                        "ENDTIME",
                        "Время окончания аукциона",
                        "TIME",
                        "6",
                        "Время окончания аукциона"
                    ],
                    [
                        "AUCTPRICE",
                        "Цена аукциона",
                        "PRICE",
                        "9",
                        "Цена аукциона. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона."
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем совершенных сделок аукциона, выраженный в валюте расчетов. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "VOLUME",
                        "Количество",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, в единицах ценных бумаг. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "NUMTRADES",
                        "Сделок",
                        "INTEGER",
                        "9",
                        "Количество заключенных сделок"
                    ],
                    [
                        "IMBALANCE",
                        "Дисбаланс",
                        "INTEGER",
                        "16",
                        "Суммарный объем заявок, которые остались бы неисполненными при завершении аукциона по ожидаемой цене"
                    ],
                    [
                        "MARKETVOLB",
                        "Рыночных на покупку",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на покупку по ожидаемой цене, в единицах ценных бумаг"
                    ],
                    [
                        "MARKETVOLS",
                        "Рыночных на продажу",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на продажу, в единицах ценных бумаг"
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявок на покупку (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку  на аукционе КП"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявок на продажу (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу  на аукционе КП"
                    ],
                    [
                        "DPORDERINDICATOR",
                        "Наличие спроса/предложения",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку или продажу на аукционе крупными лотами до данному финасовому инструменту"
                    ],
                    [
                        "MATDATE",
                        "Дата погашения",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "STATUS",
                        "Статус аукциона",
                        "TAuctStatus",
                        "1",
                        "Статус аукциона"
                    ]
                ],
                "title": "Результаты аукционов (обновляемая)",
                "desc": "Результаты аукционов"
            },
            "BANK": {
                "output": [
                    [
                        "URGENCY",
                        "Важность",
                        "TUrgency",
                        "1",
                        "Срочность или важность сообщения"
                    ],
                    [
                        "FROMUSER",
                        "От кого",
                        "CHAR",
                        "12",
                        "Идентификатор пользователя, отправившего сообщение"
                    ],
                    [
                        "MSGTIME",
                        "Время",
                        "CHAR",
                        "8",
                        "Время, когда было отправлено сообщение"
                    ],
                    [
                        "MSGTEXT",
                        "Текст",
                        "CHAR",
                        "256",
                        "Текст сообщения"
                    ]
                ],
                "title": "Расчетные организации (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKID</td> <td>Расчетная организация</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SHORTNAME</td> <td>Наименование</td> <td>CHAR</td> <td align=right>12</td> <td>Краткое наименование расчетной организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKNAME</td> <td>Полное наименование</td> <td>CHAR</td> <td align=right>120</td> <td>Полное наименование расчетной организации</td> </tr> </table> </ul> <a name=\"t0_3\"></a> <h4>BANKACC - Расчетные коды (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEFAULTER</td> <td>Принудительное закрытие</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TStatus</td> <td align=right>1</td> <td>Индикатор \"торговые/клиринговые операции разрешены/запрещены\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td> <td>Клиринговая фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы - Участника Клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGBANKACCID</td> <td>Клиринговый расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор клирингового расчетного счета в НКЦ</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DETAILS</td> <td>Реквизит 1</td> <td>CHAR</td> <td align=right>20</td> <td>Данные о клиенте (ИНН, номер паспорта или другой документ)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SUBDETAILS</td> <td>Реквизит 2</td> <td>CHAR</td> <td align=right>20</td> <td>Данные о клиенте клиента (ИНН, номер паспорта или другой документ)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCTYPE</td> <td>Тип</td> <td> TBankAccType</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GCPOOLID</td> <td>Идентификатор пула</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">UNIFIEDPOOL</td> <td>Единый пул</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLETIME</td> <td>Время ранних расчетов</td> <td>TIME</td> <td align=right>6</td> <td>Время ранних расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADINGCLOSEDTIME</td> <td>Время прекращения торгов</td> <td>TIME</td> <td align=right>6</td> <td>Время прекращения торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMBANKACCID</td> <td>Расчетный код для списания оборотной комиссии</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации для списания оборотной комиссии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CALC_PERCENT</td> <td>Учитывать процентный риск</td> <td> TYesNo</td> <td align=right>1</td> <td>Учитывать процентный риск</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGMODE</td> <td>Юридическая клиринговая модель</td> <td> TClearingMode</td> <td align=right>1</td> <td>Юридическая клиринговая модель</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CM_CONTROL_LEVEL3</td> <td>УК управляет 3-м ур.</td> <td> TYesNo</td> <td align=right>1</td> <td>Участник клиринга управляет третьим уровнем</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CM_DISCLOSE_CLIENTS</td> <td>Информация о клиентах УК</td> <td> TYesNo</td> <td align=right>1</td> <td>Раскрытие информации о клиентах Участнику клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PROTECTEDCLIENT</td> <td>Защита денежных средств</td> <td> TYesNo</td> <td align=right>1</td> <td>Защита денежных средств обособленного клиента</td> </tr> </table> </ul> <a name=\"t0_4\"></a> <h4>BCMESSAGES - Сообщения (обновляемая)</h4> <ul> Таблица содержит информацию о сообщениях, полученных от других участников торгов с момента начала торговой сессии"
            },
            "BENCHMARKS": {
                "output": [
                    [
                        "BOARDID",
                        "Код режима",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "BOARDNAME",
                        "Режим",
                        "CHAR",
                        "30",
                        "Наименование режима"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "CURRCODE",
                        "Валюта",
                        "CHAR",
                        "4",
                        "Код валюты"
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка, к которому относится данный режим"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование режима торгов на английском языке"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "Идентификатор бэнчмарка"
                    ]
                ],
                "title": "Бэнчмарки (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BENCHMARK</td> <td>Бенчмарк</td> <td>CHAR</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Название бенчмарка</td> <td>CHAR</td> <td align=right>128</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALUE</td> <td>Значение бенчмарка, %</td> <td>FLOAT</td> <td align=right>10</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_6\"></a> <h4>BOARDS - Режимы торгов (обновляемая)</h4> <ul> Таблица содержит информацию о режимах торгов. Под режимом понимается набор правил проведения торгов, определяющих допустимые типы заявок, регламент торгов, виды расчетов и пр. Каждый режим представлен в таблице одной строкой."
            },
            "CLIENTCODES": {
                "output": [
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "CLIENTTYPE",
                        "Тип",
                        "CHAR",
                        "2",
                        "Форма идентификации клиента"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "QINVESTOR",
                        "Квалифицированный инвестор",
                        "TYesNo",
                        "1",
                        "Квалифицированный инвестор"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние кода клиента"
                    ],
                    [
                        "CROSSTRADING",
                        "Кросс-сделки",
                        "TCrossTrading",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "BLOCKCLIENTTE",
                        "Блокировка торгов",
                        "TYesNo",
                        "1",
                        "Флаг блокировки доступа к торгам"
                    ]
                ],
                "title": "Клиенты брокера (обновляемая)",
                "desc": "Таблица \"Клиенты брокера\" содержит информацию о кодах клиентов, зарегистрированных в торговой системе ММВБ для данного брокера"
            },
            "CURRENCY": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDTIME",
                        "Запланированное время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона (из расписания торгов)"
                    ],
                    [
                        "STARTTIME",
                        "Время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона"
                    ],
                    [
                        "ENDTIME",
                        "Время окончания аукциона",
                        "TIME",
                        "6",
                        "Время окончания аукциона"
                    ],
                    [
                        "LCURRENTPRICE",
                        "Официальная текущая цена",
                        "PRICE",
                        "9",
                        "Официальная текущая цена, рассчитываемая как средневзвешенная цена сделок заключенных за последние 10 минут, зафиксированная на момент начала ценового окна"
                    ],
                    [
                        "PRICEBOUNDUP",
                        "Максимальная допустимая цена аукциона",
                        "PRICE",
                        "9",
                        "Максимальная допустимая цена аукциона  при выборе цены как одной из средних цен ценового окна"
                    ],
                    [
                        "PRICEBOUNDDOWN",
                        "Минимальная допустимая цена аукциона",
                        "PRICE",
                        "9",
                        "Минимальная допустимая цена аукциона при выборе цены как одной из средних цен ценового окна"
                    ],
                    [
                        "AUCTPRICE",
                        "Цена аукциона",
                        "PRICE",
                        "9",
                        "Цена аукциона"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем совершенных сделок аукциона, выраженный в валюте расчетов"
                    ],
                    [
                        "VOLUME",
                        "Количество",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "NUMTRADES",
                        "Сделок",
                        "INTEGER",
                        "9",
                        "Количество заключенных сделок"
                    ]
                ],
                "title": "Справочник валют (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRCODE</td> <td>Валюта</td> <td>CHAR</td> <td align=right>4</td> <td>Код валюты</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRENCYNAME</td> <td>Наименование</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CROSSRATE</td> <td>Курс</td> <td>FLOAT</td> <td align=right>17</td> <td>Курс в руб. за единицу валюты с плавающей точкой</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ASSET</td> <td>Актив</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_9\"></a> <h4>DPAUCTIONS - Аукционы крупных пакетов (DarkPool) (обновляемая)</h4> <ul> Результаты аукционов крупных пакетов (DarkPool)"
            },
            "EXT_MMSTATS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "MMID",
                        "ID записи",
                        "CHAR",
                        "12",
                        "Идентификатор записи маркет-мейкинга в ТС"
                    ],
                    [
                        "PARENTMMID",
                        "ID родительской записи",
                        "CHAR",
                        "12",
                        "Идентификатор родительской записи маркет-мейкинга в ТС"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "SCHEMANAME",
                        "Схема",
                        "CHAR",
                        "20",
                        "Наименование схемы маркет-мейкинга"
                    ],
                    [
                        "AGREEMENT",
                        "№ договора",
                        "CHAR",
                        "12",
                        "Идентификатор (номер) договора с маркет-мейкером"
                    ],
                    [
                        "AGREEMENTDATE",
                        "Дата договора",
                        "DATE",
                        "8",
                        "Дата подписания договора с маркет-мейкером"
                    ],
                    [
                        "MINSPREADVOLUMEBUY",
                        "МДО-Купля",
                        "INTEGER",
                        "16",
                        "Минимальный допустимый объем в лотах на покупку для маркет-мейкера"
                    ],
                    [
                        "MINSPREADVALUEBUY",
                        "МДО-Купля, руб.",
                        "FIXED",
                        "16.2",
                        "Минимальный допустимый объем в руб. на покупку для маркет-мейкера"
                    ],
                    [
                        "MINSPREADVOLUMESELL",
                        "МДО-Продажа",
                        "INTEGER",
                        "16",
                        "Минимальный допустимый объем в лотах на продажу для маркет-мейкера"
                    ],
                    [
                        "MINSPREADVALUESELL",
                        "МДО-Продажа, руб.",
                        "FIXED",
                        "16.2",
                        "Минимальный допустимый объем в руб. на продажу для маркет-мейкера"
                    ],
                    [
                        "MAXTRADESVOLUME",
                        "ДО",
                        "INTEGER",
                        "16",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на одностороннее или на освобождение от котирования, в лотах"
                    ],
                    [
                        "MAXTRADESVALUE",
                        "ДО, руб.",
                        "FIXED",
                        "16.2",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на одностороннее или на освобождение от котирования, руб."
                    ],
                    [
                        "MINPASSIVETRADESVALUE",
                        "Мин. пассив. объем, руб.",
                        "FIXED",
                        "16.2",
                        "Минимальный объем пассивных сделок, выраженный в руб."
                    ],
                    [
                        "MAXSPREADPERC",
                        "Макс. спрэд, %",
                        "FLOAT",
                        "8",
                        "Допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPERC1",
                        "Макс. спрэд-Купля, %",
                        "FLOAT",
                        "8",
                        "Предельное отклонение цены заявки на покупку от расчетной цены"
                    ],
                    [
                        "MAXSPREADPERC2",
                        "Макс. спрэд-Продажа, %",
                        "FLOAT",
                        "8",
                        "Предельное отклонение цены заявки на продажу от расчетной цены"
                    ],
                    [
                        "MAXSPREADPRICE",
                        "Макс. спрэд",
                        "PRICE",
                        "9",
                        "Допустимый коридор колебания цены в руб."
                    ],
                    [
                        "MINKEEPTIME",
                        "Мин. время поддерж.",
                        "TIME",
                        "6",
                        "Минимальное время поддержания"
                    ],
                    [
                        "MINKEEPPERCENT",
                        "Мин. % исполнения",
                        "FIXED",
                        "9.2",
                        "Минимальный процент исполнения"
                    ],
                    [
                        "CURRENTSPREADPERC",
                        "Спрэд, %",
                        "FLOAT",
                        "8",
                        "Величина текущего спрэда маркет-мейкера в процентах"
                    ],
                    [
                        "CURRENTSPREADPERC1",
                        "Спрэд-Купля, %",
                        "FLOAT",
                        "8",
                        "Отклонение цены заявки на покупку от текущей цены"
                    ],
                    [
                        "CURRENTSPREADPERC2",
                        "Спрэд-Продажа, %",
                        "FLOAT",
                        "8",
                        "Отклонение цены заявки на продажу от текущей цены"
                    ],
                    [
                        "CURRENTSPREADPRICE",
                        "Спрэд",
                        "PRICE",
                        "9",
                        "Величина текущего спрэда маркет-мейкера в руб."
                    ],
                    [
                        "CURRENTMINBUYPRICE",
                        "Лучшая цена покупки",
                        "PRICE",
                        "9",
                        "Лучшая цена активной лимитированной заявки на покупку"
                    ],
                    [
                        "CURRENTMAXSELLPRICE",
                        "Лучшая цена продажи",
                        "PRICE",
                        "9",
                        "Лучшая цена активной лимитированной заявки на продажу"
                    ],
                    [
                        "TOTALBUYVOLUME",
                        "Купля",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на покупку, выраженный в лотах"
                    ],
                    [
                        "TOTALSELLVOLUME",
                        "Продажа",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на продажу, выраженный в лотах"
                    ],
                    [
                        "PUBLICPRICE",
                        "Текущая цена",
                        "PRICE",
                        "9",
                        "Текущая расчетная цена"
                    ],
                    [
                        "TOTALBREACHTIME",
                        "Время перерыва",
                        "TIME",
                        "6",
                        "Общее время нарушения маркет-мейкером своих обязательств по поддержке котировок"
                    ],
                    [
                        "TOTALKEEPTIME",
                        "Время поддерж.",
                        "TIME",
                        "6",
                        "Общее время выполнения обязательств по МДО и спрэду"
                    ],
                    [
                        "TOTALKEEPTIME1",
                        "Время поддерж.-Купля",
                        "TIME",
                        "6",
                        "Фактическое время поддержания заявок на покупку"
                    ],
                    [
                        "TOTALKEEPTIME2",
                        "Время поддерж.-Продажа",
                        "TIME",
                        "6",
                        "Фактическое время поддержания заявок на продажу"
                    ],
                    [
                        "FACTTRADESVOLUME",
                        "Объем",
                        "INTEGER",
                        "16",
                        "Текущий объем заключенных сделок, в лотах"
                    ],
                    [
                        "FACTTRADESVALUE",
                        "Объем, руб.",
                        "FIXED",
                        "16.2",
                        "Текущий объем заключенных сделок, в руб."
                    ],
                    [
                        "FACTPASSIVETRADESVOLUME",
                        "Пассивное количество",
                        "INTEGER",
                        "16",
                        "Текущий объем заключенных пассивных сделок, в лотах"
                    ],
                    [
                        "FACTPASSIVETRADESVALUE",
                        "Пассивный объем, руб.",
                        "FIXED",
                        "16.2",
                        "Текущий объем заключенных пассивных сделок, в руб."
                    ],
                    [
                        "QUOTETYPE",
                        "Котирование",
                        "TMMQuoteType",
                        "1",
                        "Тип котирования в текущий момент (двухстороннее, одностороннее или не требуется)"
                    ],
                    [
                        "FACTKEEPPERCENT",
                        "% исполнения",
                        "FIXED",
                        "9.2",
                        "&nbsp;"
                    ],
                    [
                        "FACTKEEPPERCENT1",
                        "% исп.-Купля",
                        "FIXED",
                        "9.2",
                        "Процент исполнения на покупку"
                    ],
                    [
                        "FACTKEEPPERCENT2",
                        "% исп.-Продажа",
                        "FIXED",
                        "9.2",
                        "Процент исполнения на продажу"
                    ],
                    [
                        "LEFTKEEPTIME",
                        "Оставшееся время до исполнения",
                        "TIME",
                        "6",
                        "Оставшееся время до исполнения обязательств"
                    ],
                    [
                        "UPDATETIME",
                        "Время обновления",
                        "TIME",
                        "6",
                        "Время обновления"
                    ],
                    [
                        "PROCESSED",
                        "Обязат. исполн.",
                        "TYesNo",
                        "1",
                        "Обязательства исполнены"
                    ],
                    [
                        "INDICATOR1",
                        "Фикс. ставка РЕПО ЦБ ON, %",
                        "FLOAT",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "INDICATOR2",
                        "Ставка RuRepo ON, %",
                        "FLOAT",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "INDICATOR3",
                        "Ставка MosPrime ON, %",
                        "FLOAT",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "MINSHAREISSUES",
                        "Мин. обяз. кол-во выпусков",
                        "INTEGER",
                        "4",
                        "Минимальное обязательство по количеству выпусков ценных бумаг"
                    ],
                    [
                        "COMPLETESHAREISSUES",
                        "Выполн. по кол-ву выпусков",
                        "INTEGER",
                        "4",
                        "Выполнено по количеству выпусков ценных бумаг"
                    ]
                ],
                "title": "Обязательства маркет-мейкера (обновляемая)",
                "desc": "В таблице представлена информация по выполнению маркет-мейкером его обязательств"
            },
            "EXT_ORDERBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена котировки"
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки. Используется только в отдельных видах аукционов. В остальных случаях заполняется пробелами."
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность по цене котировки"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Суммарный объем котировок РЕПО по данной ставке, выраженный в валюте расчетов. Для инструментов обычных режимов значение не вычисляется."
                    ]
                ],
                "title": "Котировки по инструменту (обновляемая, очищать при обновлении)",
                "desc": "Расширенный вариант таблицы котировок. Таблица содержит информацию о заявках с лучшими ценами и временем активации (отдельно на покупку и на продажу) по финансовому инструменту. Каждая строка таблицы соответствует уникальной паре значений времени активации и цены для финансового инструмента и отражает суммарное количество лотов, выставленных на покупку или продажу по этой цене с данным временем активации.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "DEPTH",
                        "Глубина котировок",
                        "INTEGER",
                        "2",
                        "Запрашиваемое количество лучших котировок на покупку/продажу по инструменту. Для получения всех котировок значение не указывается."
                    ]
                ]
            },
            "FIRMS": {
                "output": [
                    [
                        "FIRMID",
                        "Код фирмы",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "FIRMNAME",
                        "Фирма",
                        "CHAR",
                        "30",
                        "Краткое наименование фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "EXCHANGE",
                        "Биржа",
                        "CHAR",
                        "4",
                        "Идентификатор региональной биржи"
                    ],
                    [
                        "INN",
                        "ИНН",
                        "CHAR",
                        "12",
                        "Индивидуальный номер налогоплательщика"
                    ],
                    [
                        "INLIQUIDATION",
                        "Ликвидационный неттинг",
                        "TYesNo",
                        "1",
                        "В отношении фирмы инициирован ликвидационный неттинг"
                    ],
                    [
                        "CLEARINGACCESS",
                        "Доступ к клирингу",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "TRADINGACCESS",
                        "Доступ к торгам",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "EVENINGSESSION",
                        "Доступность в дополнительной сессии",
                        "TYesNo",
                        "1",
                        "Флаг допуска фирмы для торгов в дополнительной сессии"
                    ]
                ],
                "title": "Фирмы (обновляемая)",
                "desc": "Данная таблица содержит информацию о фирмах-участниках торгов. Каждая фирма представлена одной строкой таблицы."
            },
            "INDEXES": {
                "output": [
                    [
                        "INDEXBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для ценных бумаг, участвующих в расчете индекса"
                    ],
                    [
                        "INDEXCODE",
                        "Код индекса",
                        "CHAR",
                        "12",
                        "Идентификатор биржевого индекса"
                    ],
                    [
                        "NAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса"
                    ],
                    [
                        "SHORTNAME",
                        "Индекс",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "CURRENTVALUE",
                        "Текущий",
                        "PRICE",
                        "9",
                        "Текущее значение индекса"
                    ],
                    [
                        "LASTVALUE",
                        "Закрытие",
                        "PRICE",
                        "9",
                        "Последнее значение индекса предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части числа. Используется для форматирования значений полей с типом PRICE."
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса на английском языке"
                    ],
                    [
                        "TIME",
                        "Время вычисления",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "OPENVALUE",
                        "Открытие",
                        "PRICE",
                        "9",
                        "Значение индекса на открытие текущего торгового дня"
                    ],
                    [
                        "VALTODAY",
                        "Объем торгов",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок по бумагам, входящим в индекс, выраженный в руб."
                    ],
                    [
                        "MIN",
                        "Минимум",
                        "PRICE",
                        "9",
                        "Минимальное значение индекса"
                    ],
                    [
                        "MAX",
                        "Максимум",
                        "PRICE",
                        "9",
                        "Максимальное значение индекса"
                    ],
                    [
                        "INDEXCROSSRATE",
                        "Курс",
                        "FIXED",
                        "9.4",
                        "Курс валюты индекса"
                    ]
                ],
                "title": "Индексы (обновляемая)",
                "desc": "Каждая строка таблицы представляет один из индексов ММВБ, расчитываемых для этого рынка"
            },
            "INSTRUMENTS": {
                "output": [
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "INSTRNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование группы инструментов"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "INSTRTYPE",
                        "Тип инструмента",
                        "TInstrType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "QUOTEBASIS",
                        "Тип цены",
                        "TQuoteBasis",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Группы ценных бумаг (обновляемая)",
                "desc": "Таблица содержит информацию о группах однотипных ценных бумаг (например: Акции (1 уровень), Акции (2 уровень), Внесписочные акции и т.д.) Каждая группа ценных бумаг представлена в таблице одной строкой."
            },
            "MARKETS": {
                "output": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "MARKETNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка на английском языке"
                    ]
                ],
                "title": "Рынки (обновляемая)",
                "desc": "Таблица содержит информацию о рынках. Под рынком понимается группа режимов торгов, объединенных по административным признакам (ГЦБ, НГЦБ, РПС)."
            },
            "NEGDEALBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена котировки"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ],
                "title": "Котировки адресных заявок *Всем (обновляемая, очищать при обновлении)",
                "desc": "Таблица содержит информацию об адресных заявках с лучшими ценами (отдельно на покупку и на продажу) по финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ]
                ]
            },
            "NEGDEALS": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию адресной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных адресных заявок"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность по цене заявки"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Процентный доход, выраженный в валюте расчетов"
                    ],
                    [
                        "QUOTENO",
                        "Встречная заявка",
                        "INTEGER",
                        "12",
                        "Номер встречной безадресной заявки, 0 - если заявки нет"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "REFUNDRATE",
                        "Возмещение, %",
                        "FIXED",
                        "9.2",
                        "Ставка фиксированного возмещения, выплачиваемого в случае неисполнения второй части РЕПО, в процентах"
                    ],
                    [
                        "REPOENTRY",
                        "Тип ввода заявки РЕПО",
                        "TRepoEntry",
                        "1",
                        "Тип ввода заявки РЕПО"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "PRICE",
                        "9",
                        "Начальный дисконт, в процентах"
                    ],
                    [
                        "LOWERDISCOUNT",
                        "Нижний предел дисконта, %",
                        "PRICE",
                        "9",
                        "Нижнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "UPPERDISCOUNT",
                        "Верхний предел дисконта, %",
                        "PRICE",
                        "9",
                        "Верхнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "BLOCKSECURITIES",
                        "Блокировать обеспечение",
                        "TYesNo",
                        "1",
                        "Признак блокировки финансового инструмента на специальном счете на время операции РЕПО"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "ORIGINREPOVALUE",
                        "Сумма РЕПО, указанная пользователем",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, значение Суммы РЕПО. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINQUANTITY",
                        "Кол-во лотов, указанное пользователем",
                        "INTEGER",
                        "16",
                        "Первоначальное, указанное при регистрации, количество бумаг (в стандартных лотах). Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINDISCOUNT",
                        "Дисконт, указанный пользователем",
                        "PRICE",
                        "9",
                        "Первоначальное, указанное при регистрации, значение дисконта. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ENTRYDATE",
                        "Дата регистрации",
                        "DATE",
                        "8",
                        "Дата регистрации заявки"
                    ],
                    [
                        "ACTIVATIONDATE",
                        "Дата активации",
                        "DATE",
                        "8",
                        "Дата активации заявки - дата, при наступлении которой возможно заключение сделки(ок) на основании данной заявки. До наступления даты активации поданные по инструменту заявки накапливаются в торговой системе и имеют статус T."
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "ORIGINVALUE",
                        "Сумма денежных средств",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, количество денежных средств (только при вводе адресной заявки без указания количества лотов)."
                    ],
                    [
                        "NEGDEALENTRY",
                        "Тип ввода адресной заявки",
                        "TNegdealEntry",
                        "1",
                        "Тип ввода адресной заявки: с указанием количество лотов или суммы денежных средств"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ]
                ],
                "title": "Адресные заявки (обновляемая)",
                "desc": "Таблица содержит информацию об адресных заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала торговой сессии, для регистрации адресных сделок. Каждая адресная заявка представлена в таблице одной строкой."
            },
            "ONENEGDEAL": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию адресной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных адресных заявок"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность по цене заявки"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Процентный доход, выраженный в валюте расчетов"
                    ],
                    [
                        "QUOTENO",
                        "Встречная заявка",
                        "INTEGER",
                        "12",
                        "Номер встречной безадресной заявки, 0 - если заявки нет"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "REFUNDRATE",
                        "Возмещение, %",
                        "FIXED",
                        "9.2",
                        "Ставка фиксированного возмещения, выплачиваемого в случае неисполнения второй части РЕПО, в процентах"
                    ],
                    [
                        "REPOENTRY",
                        "Тип ввода заявки РЕПО",
                        "TRepoEntry",
                        "1",
                        "Тип ввода заявки РЕПО"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "PRICE",
                        "9",
                        "Начальный дисконт, в процентах"
                    ],
                    [
                        "LOWERDISCOUNT",
                        "Нижний предел дисконта, %",
                        "PRICE",
                        "9",
                        "Нижнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "UPPERDISCOUNT",
                        "Верхний предел дисконта, %",
                        "PRICE",
                        "9",
                        "Верхнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "BLOCKSECURITIES",
                        "Блокировать обеспечение",
                        "TYesNo",
                        "1",
                        "Признак блокировки финансового инструмента на специальном счете на время операции РЕПО"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "ORIGINREPOVALUE",
                        "Сумма РЕПО, указанная пользователем",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, значение Суммы РЕПО. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINQUANTITY",
                        "Кол-во лотов, указанное пользователем",
                        "INTEGER",
                        "16",
                        "Первоначальное, указанное при регистрации, количество бумаг (в стандартных лотах). Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINDISCOUNT",
                        "Дисконт, указанный пользователем",
                        "PRICE",
                        "9",
                        "Первоначальное, указанное при регистрации, значение дисконта. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ENTRYDATE",
                        "Дата регистрации",
                        "DATE",
                        "8",
                        "Дата регистрации заявки"
                    ],
                    [
                        "ACTIVATIONDATE",
                        "Дата активации",
                        "DATE",
                        "8",
                        "Дата активации заявки - дата, при наступлении которой возможно заключение сделки(ок) на основании данной заявки. До наступления даты активации поданные по инструменту заявки накапливаются в торговой системе и имеют статус T."
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "ORIGINVALUE",
                        "Сумма денежных средств",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, количество денежных средств (только при вводе адресной заявки без указания количества лотов)."
                    ],
                    [
                        "NEGDEALENTRY",
                        "Тип ввода адресной заявки",
                        "TNegdealEntry",
                        "1",
                        "Тип ввода адресной заявки: с указанием количество лотов или суммы денежных средств"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ]
                ],
                "title": "Информация по адресной заявке (обновляемая)",
                "desc": "Таблица состоит из одной строки и содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ONEORDER": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по цене",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным ценам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, подавшего заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Накопленный купонный доход, рассчитанный для указанного в заявке количества ценных бумаг, выраженный в валюте расчетов"
                    ],
                    [
                        "ENTRYTYPE",
                        "Введено по",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения цены заявки - \"по цене/по доходности/по средневзвешенной цене\""
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене заявки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "MARKETMAKER",
                        "Маркет-мейкер",
                        "TYesNo",
                        "1",
                        "Заявка маркет-мейкера"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "REPOFLAG",
                        "Заявка РЕПО",
                        "TRepoFlag",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VALUEENTRYTYPE",
                        "Тип по объему",
                        "TValueEntryType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "ACTIVATIONTYPE",
                        "Тип события активации заявки",
                        "TOrderActivationType",
                        "1",
                        "Указывается при посылке заявки с активацией по наступлению специфицированного события. Доступный тип значения на данный момент \"C\" - заявка в Аукцион закрытия."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "STABORDER",
                        "Поддержание цены",
                        "TYesNo",
                        "1",
                        "Заявка, поданная в целях поддержания цен/Стабилизационная заявка"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "PRICE",
                        "9",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "VISIBILITYFACTOR",
                        "Видимая часть",
                        "FIXED",
                        "5.2",
                        "Видимая часть в общей сумме заявки в %"
                    ],
                    [
                        "REPO2VALUE",
                        "Стоимость выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Объем сделки выкупа РЕПО, выраженный в валюте расчетов"
                    ],
                    [
                        "VISIBLEREPOVALUE",
                        "Сумма РЕПО видимой части",
                        "FIXED",
                        "16.2",
                        "Видимый остаток суммы РЕПО"
                    ]
                ],
                "title": "Информация по заявке (обновляемая)",
                "desc": "Таблица содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ORDERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по цене",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным ценам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, подавшего заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Накопленный купонный доход, рассчитанный для указанного в заявке количества ценных бумаг, выраженный в валюте расчетов"
                    ],
                    [
                        "ENTRYTYPE",
                        "Введено по",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения цены заявки - \"по цене/по доходности/по средневзвешенной цене\""
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене заявки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "MARKETMAKER",
                        "Маркет-мейкер",
                        "TYesNo",
                        "1",
                        "Заявка маркет-мейкера"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "REPOFLAG",
                        "Заявка РЕПО",
                        "TRepoFlag",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VALUEENTRYTYPE",
                        "Тип по объему",
                        "TValueEntryType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "ACTIVATIONTYPE",
                        "Тип события активации заявки",
                        "TOrderActivationType",
                        "1",
                        "Указывается при посылке заявки с активацией по наступлению специфицированного события. Доступный тип значения на данный момент \"C\" - заявка в Аукцион закрытия."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "STABORDER",
                        "Поддержание цены",
                        "TYesNo",
                        "1",
                        "Заявка, поданная в целях поддержания цен/Стабилизационная заявка"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "PRICE",
                        "9",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "VISIBILITYFACTOR",
                        "Видимая часть, %",
                        "FIXED",
                        "5.2",
                        "Видимая часть в общей сумме заявки в %"
                    ],
                    [
                        "REPO2VALUE",
                        "Стоимость выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Объем сделки выкупа РЕПО, выраженный в валюте расчетов"
                    ],
                    [
                        "VISIBLEREPOVALUE",
                        "Сумма  РЕПО видимой части",
                        "FIXED",
                        "16.2",
                        "Видимый остаток суммы РЕПО"
                    ]
                ],
                "title": "Заявки (обновляемая)",
                "desc": "Таблица содержит информацию о заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "PRICEMOVELIMIT": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Ценовые границы (не обновляемая)",
                "desc": "<table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Входное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DISCOUNT</td> <td>Дисконт</td> <td>PRICE</td> <td align=right>9</td> <td>Дисконт в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTERM</td> <td>Срок РЕПО</td> <td>INTEGER</td> <td align=right>4</td> <td>Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно.</td> </tr> </table>",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "UPPERLIMIT",
                        "Верхняя граница",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "LOWERLIMIT",
                        "Нижняя граница",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ]
                ]
            },
            "QUOTES": {
                "output": [
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ]
                ],
                "title": "Безадресные заявки для РПС (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUOTENO</td> <td>Заявка №</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер заявки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUOTETIME</td> <td>Время</td> <td>TIME</td> <td align=right>6</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TOrderStatus</td> <td align=right>1</td> <td>Статус заявки на регистрацию безадресной сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BUYSELL</td> <td>К/П</td> <td> TBuySell</td> <td align=right>1</td> <td>Направленность заявки - \"купля/продажа\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">USERID</td> <td>Участник</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE</td> <td>Цена</td> <td>PRICE</td> <td align=right>9</td> <td>Цена за одну ценную бумагу</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUANTITY</td> <td>Лоты</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORATE</td> <td>Ставка РЕПО, %</td> <td>PRICE</td> <td align=right>9</td> <td>Ставка РЕПО, в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE2</td> <td>Цена выкупа</td> <td>PRICE</td> <td align=right>9</td> <td>Цена выкупа второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTREF</td> <td>Код внешнего пользователя</td> <td>CHAR</td> <td align=right>12</td> <td>Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PERIOD</td> <td>Период</td> <td> TPeriod</td> <td align=right>1</td> <td>Период торговой сессии, когда была подана заявка</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOVALUE</td> <td>Сумма РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTERM</td> <td>Срок РЕПО</td> <td>INTEGER</td> <td align=right>4</td> <td>Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPO2VALUEBALANCE</td> <td>Остаток стоимости выкупа РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DISCOUNT</td> <td>Начальный дисконт, %</td> <td>PRICE</td> <td align=right>9</td> <td>Дисконт при заключении сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOENTRY</td> <td>Тип ввода заявки РЕПО</td> <td> TRepoEntry</td> <td align=right>1</td> <td>Тип ввода заявки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORIGINREPOVALUE</td> <td>Сумма РЕПО, указанная пользователем</td> <td>FIXED</td> <td align=right>16.2</td> <td>Первоначальное, указанное при регистрации, значение Суммы РЕПО. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORIGINQUANTITY</td> <td>Кол-во лотов, указанное пользователем</td> <td>INTEGER</td> <td align=right>16</td> <td>Первоначальное, указанное при регистрации, количество бумаг (в стандартных лотах). Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORIGINDISCOUNT</td> <td>Дисконт, указанный пользователем</td> <td>PRICE</td> <td align=right>9</td> <td>Первоначальное, указанное при регистрации, значение дисконта. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто.</td> </tr> </table> </ul> <a name=\"t0_24\"></a> <h4>REPORTS - Отчеты на исполнение (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTNO</td> <td>Отчет №</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTDATE</td> <td>Дата</td> <td>DATE</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTTIME</td> <td>Время</td> <td>TIME</td> <td align=right>6</td> <td>Время регистрации отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">USERID</td> <td>Участник</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы-отправителя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета фирмы-отправителя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPFIRMID</td> <td>Партнер</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы-получателя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPTRDACCID</td> <td>Торговый счет партнера</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета фирмы-получателя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUANTITY</td> <td>Лоты</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALUE</td> <td>Сумма</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем сделки, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TReportStatus</td> <td align=right>1</td> <td>Состояние отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMISSION</td> <td>Комиссия</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем комиссии по сделке, руб.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">WITHDRAWTIME</td> <td>Время снятия</td> <td>TIME</td> <td align=right>6</td> <td>Время снятия отчета в торговой системе</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTTYPE</td> <td>Тип отчета</td> <td> TReportType</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTKIND</td> <td>Вид отчета</td> <td> TReportKind</td> <td align=right>1</td> <td>Вид отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NUMTRADES</td> <td>Количество сделок</td> <td>INTEGER</td> <td align=right>4</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMPVAL</td> <td>Сумма отступного</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма отступного, в валюте сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMPBS</td> <td>Отступной</td> <td> TCompensation</td> <td align=right>1</td> <td>Направленность отступного</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ACCURATE</td> <td>Точная проверка</td> <td> TYesNo</td> <td align=right>1</td> <td>Режим точной проверки</td> </tr> </table> </ul> <a name=\"t0_25\"></a> <h4>REPO_NEGDEALBOOK - Котировки адресных заявок РЕПО *Всем (обновляемая, очищать при обновлении)</h4> <ul> Таблица содержит информацию о заявках с лучшими ставками РЕПО (отдельно на покупку и на продажу) по данному финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ]
                ]
            },
            "REPO_QUOTEBOOK": {
                "output": [
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "QUOTENO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Номер безадресной заявки"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена котировки"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "DISCOUNT",
                        "Дисконт",
                        "PRICE",
                        "9",
                        "Дисконт в процентах"
                    ]
                ],
                "title": "Котировки безадресных заявок РЕПО (обновляемая, очищать при обновлении)",
                "desc": "Таблица содержит информацию о заявках с лучшими ставками РЕПО (отдельно на покупку и на продажу) по данному финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "MINREPOTERM",
                        "Минимальный срок РЕПО",
                        "INTEGER",
                        "4",
                        "Минимальный срок РЕПО в календарных днях или пусто"
                    ],
                    [
                        "MAXREPOTERM",
                        "Максимальный срок РЕПО",
                        "INTEGER",
                        "4",
                        "Максимальный срок РЕПО в календарных днях или пусто"
                    ],
                    [
                        "MINREPORATE",
                        "Минимальная ставка РЕПО",
                        "FIXED",
                        "9.2",
                        "Минимальная ставка РЕПО, в процентах, или пусто"
                    ],
                    [
                        "MAXREPORATE",
                        "Максимальная ставка РЕПО",
                        "FIXED",
                        "9.2",
                        "Максимальная ставка РЕПО, в процентах, или пусто"
                    ]
                ]
            },
            "RM_PRICERANGE": {
                "output": [
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "NUM",
                        "Диапазон",
                        "INTEGER",
                        "1",
                        "Номер диапазона"
                    ],
                    [
                        "LIMITBEGIN",
                        "Начало диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND",
                        "Конец диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "RTL_RUB",
                        "Нижняя граница, руб.",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "RTH_RUB",
                        "Верхняя граница, руб.",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "LIMITBEGIN_RUB",
                        "Начало диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND_RUB",
                        "Конец диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_L",
                        "Ставка риска падения цены, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_H",
                        "Ставка риска роста цены, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "RCRUB",
                        "Расчетная цена, руб.",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "CHANGETIME",
                        "Время изменения ставок риска",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ]
                ],
                "title": "Параметры рыночных рисков (обновляемая)",
                "desc": "Общие параметры рыночных рисков"
            },
            "SECACCINT": {
                "output": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "CURRCODE",
                        "Валюта",
                        "CHAR",
                        "4",
                        "Код валюты"
                    ],
                    [
                        "STARTDATE",
                        "Начальная дата",
                        "DATE",
                        "8",
                        "Начальная дата интервала"
                    ],
                    [
                        "DAYNO",
                        "Кол-во дней",
                        "INTEGER",
                        "3",
                        "Смещение относительно даты начала интервала, в днях"
                    ],
                    [
                        "ACCINT",
                        "Объем НКД",
                        "FLOAT",
                        "17",
                        "Процентный доход"
                    ],
                    [
                        "FACEVALUE",
                        "Номинал",
                        "FLOAT",
                        "17",
                        "Номинальная стоимость одной ценной бумаги, в валюте инструмента"
                    ]
                ],
                "title": "Процентный доход (не обновляемая)",
                "desc": "По данному запросу Торговая система предоставляет информацию о значениях НКД за запрошенный интервал времени для заданного финансового инструмента. Максимально допустимое количество значений НКД, получаемых по запросу для одного финансового инструмента равно 180 дням, т.е. нельзя получить за один запрос больше чем 180 значений НКД для одной ценной бумаги. Если значение конечной даты интервала (ENDDATE) выходит за эти границы или значение не указано, то будет присылаться максимально допустимое количество значений НКД.",
                "input": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента, если не указан, то запрашивается информация по всем финансовым инструментам"
                    ],
                    [
                        "CURRCODE",
                        "Валюта",
                        "CHAR",
                        "4",
                        "Код валюты"
                    ],
                    [
                        "STARTDATE",
                        "Начальная дата",
                        "DATE",
                        "8",
                        "Начальная дата интервала, если значение не указано, то в качестве начальной даты используется текущая дата торгов"
                    ],
                    [
                        "ENDDATE",
                        "Конечная дата",
                        "DATE",
                        "8",
                        "Конечная дата интервала"
                    ],
                    [
                        "FACEUNITFLAG",
                        "НКД в валюте номинала",
                        "TYesNo",
                        "1",
                        "Процентный доход в валюте номинала"
                    ]
                ]
            },
            "SECTRANSFERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки на перевод в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки на перевод в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки на перевод"
                    ],
                    [
                        "BUYSELL",
                        "З/С",
                        "TSecTransferBuySell",
                        "1",
                        "Направленность перевода: \"покупка\" - зачисление на счет,  \"продажа\" - списание со счета."
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, подавшего заявку на перевод"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой подана заявка на перевод"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, которой адресована заявка на перевод"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных переводов"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем перевода, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "WITHDRAWTIME",
                        "Время снятия",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ]
                ],
                "title": "Заявки на перевод (обновляемая)",
                "desc": "Таблица содержит текущую информацию о заявках на перевод ценных бумаг или денег, поданных Членом Секции в Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "SECTYPE": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Код инструмента",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SECNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента"
                    ],
                    [
                        "REMARKS",
                        "Примечание",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "SHORTNAME",
                        "Инструмент",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TSecStatus",
                        "1",
                        "Индикатор \"торговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADINGSTATUS",
                        "Состояние",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту"
                    ],
                    [
                        "MARKETCODE",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка на котором торгуется финансовый инструмент"
                    ],
                    [
                        "INSTRID",
                        "Группа инструментов",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "LOTSIZE",
                        "Размер лота",
                        "INTEGER",
                        "8",
                        "Количество ценных бумаг в одном стандартном лоте"
                    ],
                    [
                        "MINSTEP",
                        "Мин. шаг цены заявки",
                        "PRICE",
                        "9",
                        "Минимально возможная разница между ценами, указанными в заявках на покупку/продажу ценных бумаг"
                    ],
                    [
                        "FACEVALUE",
                        "Номинал",
                        "FLOAT",
                        "17",
                        "Номинальная стоимость одной ценной бумаги на текущую дату, в валюте инструмента"
                    ],
                    [
                        "FACEUNIT",
                        "Валюта номинала",
                        "CHAR",
                        "4",
                        "Код валюты, в которой выражен номинал ценной бумаги"
                    ],
                    [
                        "PREVDATE",
                        "Дата последних торгов",
                        "DATE",
                        "8",
                        "Дата предыдущего торгового дня"
                    ],
                    [
                        "PREVPRICE",
                        "Последняя предыдущего дня",
                        "PRICE",
                        "9",
                        "Цена последней сделки предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части числа. Используется для форматирования значений полей с типом PRICE."
                    ],
                    [
                        "YIELD",
                        "Доходность по последней",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "ACCRUEDINT",
                        "НКД",
                        "FLOAT",
                        "17",
                        "Накопленный купонный доход на дату расчетов в расчете на одну бумагу, выраженный в валюте расчетов"
                    ],
                    [
                        "PRIMARYDIST",
                        "Размещение",
                        "TYesNo",
                        "1",
                        "Индикатор информирующий, что по данному инструменту проводится аукцион"
                    ],
                    [
                        "MATDATE",
                        "Дата погашения",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "COUPONVALUE",
                        "Величина купона",
                        "FIXED",
                        "13.2",
                        "Величина купона, выраженная в валюте расчетов"
                    ],
                    [
                        "COUPONPERIOD",
                        "Длительность купона",
                        "INTEGER",
                        "4",
                        "Длительность купона, выраженная в днях"
                    ],
                    [
                        "NEXTCOUPON",
                        "Дата окончания купона",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "ISSUESIZE",
                        "Объем выпуска",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг в выпуске"
                    ],
                    [
                        "PREVWAPRICE",
                        "Оценка пред. дня",
                        "PRICE",
                        "9",
                        "Значение оценки предыдущего торгового дня"
                    ],
                    [
                        "YIELDATPREVWAPRICE",
                        "Доходность по оценке пред. дня",
                        "FIXED",
                        "9.2",
                        "Доходность по оценке предыдущего торгового дня"
                    ],
                    [
                        "REPO2PRICE",
                        "Цена второй части РЕПО",
                        "PRICE",
                        "9",
                        "Поле не используется. Устаревшее."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BUYBACKPRICE",
                        "Цена базовая для расчета доходности",
                        "PRICE",
                        "9",
                        "Если указана, то расчет доходности производится по этой цене. При заполнении BUYBACKPRICE обязательно заполняется поле BUYBACKDATE"
                    ],
                    [
                        "BUYBACKDATE",
                        "Дата, к которой рассчитывается доходность",
                        "DATE",
                        "8",
                        "Если указана, то расчет доходности производится с использованием этой даты"
                    ],
                    [
                        "AGENTID",
                        "Агент по размещению",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы-агента по размещению"
                    ],
                    [
                        "QUOTEBASIS",
                        "Тип цены",
                        "TQuoteBasis",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "ISIN",
                        "ISIN",
                        "CHAR",
                        "12",
                        "Международный идентификационный код ценной бумаги"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента на английском языке"
                    ],
                    [
                        "REGNUMBER",
                        "Регистрационный номер",
                        "CHAR",
                        "30",
                        "Номер государственной регистрации"
                    ],
                    [
                        "PREVLEGALCLOSEPRICE",
                        "Цена закрытия предыдущего дня",
                        "PRICE",
                        "9",
                        "Официальная цена закрытия предыдущего дня, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия"
                    ],
                    [
                        "PREVADMITTEDQUOTE",
                        "Признаваемая котировка предыдущего дня",
                        "PRICE",
                        "9",
                        "Признаваемая котировка предыдущего дня, цена за одну ценную бумагу"
                    ],
                    [
                        "SECTYPE",
                        "Тип ценной бумаги",
                        "CHAR",
                        "1",
                        "Тип ценной бумаги"
                    ],
                    [
                        "ACTIVATIONDATE",
                        "Дата активации",
                        "DATE",
                        "8",
                        "Дата активации заявки - дата, при наступлении которой возможно заключение сделки(ок) на основании данной заявки. До наступления даты активации поданные по инструменту заявки накапливаются в торговой системе и имеют статус T."
                    ],
                    [
                        "PREVLOTSIZE",
                        "Предыдущий размер лота",
                        "INTEGER",
                        "8",
                        "Предыдущее значение размера лота"
                    ],
                    [
                        "LOTSIZECHANGEDATE",
                        "Дата последнего изменения размера лота",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "ORIGINTRADINGSTATUS",
                        "Состояние сессии",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту. Во время перерыва показывает действительное состояние торговой сесии (никогда не принимает значение \"Перерыв\")."
                    ],
                    [
                        "ISSUESIZEPLACED",
                        "Объем в обращении",
                        "INTEGER",
                        "16",
                        "Количество размещенных ценных бумаг, находящихся в обращении"
                    ],
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "LISTLEVEL",
                        "Уровень листинга",
                        "INTEGER",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "COMMENTS",
                        "Комментарии",
                        "CHAR",
                        "128",
                        "&nbsp;"
                    ],
                    [
                        "DIVIDENDVALUE",
                        "Величина дивидендов",
                        "FIXED",
                        "16.2",
                        "Величина дивидендов, выраженная в валюте расчетов"
                    ],
                    [
                        "DIVIDENDDATE",
                        "Дата закрытия реестра",
                        "DATE",
                        "8",
                        "Дата фиксации списка лиц, имеющих право на получение дивидендов"
                    ],
                    [
                        "SUBORDBOND",
                        "Субординированность",
                        "TYesNo",
                        "1",
                        "Признак субординированности (обязательства удовлетворяются после удовлетворения требований всех иных кредиторов)"
                    ],
                    [
                        "LOTDIVIDER",
                        "Коэффициент дробления",
                        "INTEGER",
                        "8",
                        "Коэффициент дробления ценной бумаги в одном стандартном лоте"
                    ],
                    [
                        "GCPOOLID",
                        "Идентификатор пула",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "HIGHRISK",
                        "Повышенный инвестиционный риск",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "QINVESTOR",
                        "Бумага для квал. инвесторов",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "PRICE",
                        "9",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "PRICE",
                        "9",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ],
                    [
                        "OPEN",
                        "Первая",
                        "PRICE",
                        "9",
                        "Цена первой сделки"
                    ],
                    [
                        "HIGH",
                        "Максимум",
                        "PRICE",
                        "9",
                        "Максимальная цена сделки"
                    ],
                    [
                        "LOW",
                        "Минимум",
                        "PRICE",
                        "9",
                        "Минимальная цена сделки"
                    ],
                    [
                        "LAST",
                        "Последняя",
                        "PRICE",
                        "9",
                        "Цена последней сделки"
                    ],
                    [
                        "CHANGE",
                        "К последней пред. дня",
                        "PRICE",
                        "9",
                        "Изменение цены последней сделки по отношению к цене последней сделки предыдущего торгового"
                    ],
                    [
                        "QTY",
                        "Лотов в последней",
                        "INTEGER",
                        "16",
                        "Объем последней сделки, в лотах"
                    ],
                    [
                        "TIME",
                        "Время последней",
                        "TIME",
                        "6",
                        "Время заключения последней сделки"
                    ],
                    [
                        "VOLTODAY",
                        "Количество за сегодня",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "VALTODAY",
                        "Объем за сегодня",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в валюте расчетов"
                    ],
                    [
                        "VALUE",
                        "Объем в последней",
                        "FIXED",
                        "16.2",
                        "Объем последней сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "WAPRICE",
                        "Оценка",
                        "PRICE",
                        "9",
                        "Средневзвешенная цена"
                    ],
                    [
                        "HIGHBID",
                        "Лучший спрос",
                        "PRICE",
                        "9",
                        "Наибольшая цена спроса в течение торговой сессии"
                    ],
                    [
                        "LOWOFFER",
                        "Лучшее предложение",
                        "PRICE",
                        "9",
                        "Наименьшая цена предложения в течение торговой сессии"
                    ],
                    [
                        "NUMTRADES",
                        "Сделок за сегодня",
                        "INTEGER",
                        "9",
                        "Количество сделок за торговый день"
                    ],
                    [
                        "YIELDATWAPRICE",
                        "Доходность по оценке",
                        "FIXED",
                        "9.2",
                        "Доходность по средневзвешенной цене"
                    ],
                    [
                        "PRICEMINUSPREVWAPRICE",
                        "К оценке пред. дня",
                        "PRICE",
                        "10",
                        "Цена последней сделки к оценке предыдущего дня"
                    ],
                    [
                        "CLOSEPRICE",
                        "Цена послеторгового периода",
                        "PRICE",
                        "9",
                        "Цена послеторгового периода"
                    ],
                    [
                        "CLOSEYIELD",
                        "Доходность по цене послеторгового периода",
                        "FIXED",
                        "9.2",
                        "Доходность по цене послеторгового периода"
                    ],
                    [
                        "LASTBID",
                        "Спрос сессии",
                        "PRICE",
                        "9",
                        "Лучшая котировка на покупку на момент завершения нормального периода торгов"
                    ],
                    [
                        "LASTOFFER",
                        "Предложение сессии",
                        "PRICE",
                        "9",
                        "Лучшая котировка на продажу на момент завершения нормального периода торгов"
                    ],
                    [
                        "LASTSETTLECODE",
                        "Код расчетов в последней",
                        "CHAR",
                        "12",
                        "Код расчетов по последней сделке"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "MARKETPRICE",
                        "Рыночная цена предыдущего дня",
                        "PRICE",
                        "9",
                        "Рыночная цена ценной бумаги по результатам торгов предыдущего дня, за одну ценную бумагу. Для режимов РЕПО - расчетная цена РЕПО предыдущего дня."
                    ],
                    [
                        "MARKETPRICETODAY",
                        "Рыночная цена",
                        "PRICE",
                        "9",
                        "Рыночная цена по результатам торгов сегодняшнего дня, за одну ценную бумагу"
                    ],
                    [
                        "DURATION",
                        "Дюрация",
                        "FIXED",
                        "7.2",
                        "&nbsp;"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по умолчанию для данного инструмента"
                    ],
                    [
                        "LOPENPRICE",
                        "Цена открытия",
                        "PRICE",
                        "9",
                        "Не используется"
                    ],
                    [
                        "LCURRENTPRICE",
                        "Текущая цена",
                        "PRICE",
                        "9",
                        "Официальная текущая цена, рассчитываемая как средневзвешенная цена сделок заключенных за последние 10 минут"
                    ],
                    [
                        "LCLOSEPRICE",
                        "Цена закрытия",
                        "PRICE",
                        "9",
                        "Официальная цена закрытия, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия"
                    ],
                    [
                        "MARKETPRICE2",
                        "Рыночная цена 2",
                        "PRICE",
                        "9",
                        "Рыночная цена 2, рассчитываемая в соответствии с методикой ФСФР"
                    ],
                    [
                        "ADMITTEDQUOTE",
                        "Признаваемая котировка",
                        "PRICE",
                        "9",
                        "Признаваемая котировка, рассчитываемая в соответствии с методикой ФСФР"
                    ],
                    [
                        "OPENPERIODPRICE",
                        "Цена предторгового периода",
                        "PRICE",
                        "9",
                        "Цена предторгового периода или аукциона открытия"
                    ],
                    [
                        "COUNTERPRICE",
                        "Цена контрагента",
                        "PRICE",
                        "9",
                        "Цена контрагента за одну ценную бумагу. Если для бумаги указана цена контрагента, то заявки с признаком \"по цене конрагента\" удовлетворяются по этой цене"
                    ],
                    [
                        "MIN_CURR_LAST",
                        "Минимальная текущая цена",
                        "PRICE",
                        "9",
                        "Минимальная из двух цен : Официальной текущей цены и цены последней сделки, вошедшей в расчёт официальной текущей цены."
                    ],
                    [
                        "MIN_CURR_LAST_TIME",
                        "Время изм. мин. тек. цены",
                        "TIME",
                        "6",
                        "Время изменения минимальной текущей цены"
                    ],
                    [
                        "CLOSING_AUCTION_PRICE",
                        "Цена АЗ",
                        "PRICE",
                        "9",
                        "Цена аукциона закрытия. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона."
                    ],
                    [
                        "CLOSING_AUCTION_VOLUME",
                        "Количество АЗ",
                        "INTEGER",
                        "16",
                        "Количество в сделках аукциона закрытия.  Ожидаемое (состоявшееся) количество лотов в сделках по указанной цене послеторгового аукциона."
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявок на покупку (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку в аукционе Крупных Пакетов"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявок на продажу (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу в аукционе Крупных Пакетов"
                    ],
                    [
                        "SETTLEDATE1",
                        "Дата расчетов 1",
                        "DATE",
                        "8",
                        "Дата расчетов по сделке или первой части сделки РЕПО/своп"
                    ],
                    [
                        "NFAPRICE",
                        "Цена НФА",
                        "PRICE",
                        "9",
                        "Цена Ценового центра НФА"
                    ],
                    [
                        "SETTLEDATE2",
                        "Дата расчетов 2",
                        "DATE",
                        "8",
                        "Дата расчетов второй части сделки РЕПО/своп"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор текущей торговой сессии"
                    ],
                    [
                        "EVENINGSESSION",
                        "Доступность в дополнительной сессии",
                        "TYesNo",
                        "1",
                        "Флаг допуска бумаги для торгов в дополнительной сессии"
                    ]
                ],
                "title": "Тип финансового инструмента (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECTYPE</td> <td>Тип ценной бумаги</td> <td>CHAR</td> <td align=right>1</td> <td>Тип ценной бумаги</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя</td> <td>CHAR</td> <td align=right>4</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATNAME</td> <td>Имя на английском</td> <td>CHAR</td> <td align=right>4</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>128</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_31\"></a> <h4>SECURITIES - Финансовые инструменты (обновляемая)</h4> <ul> Таблица содержит текущую биржевую информацию о финансовых инструментах, относящихся к различным режимам торгов. Каждая строка таблицы соответствует уникальной паре режим торгов - финансовый инструмент.",
                "input": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ]
                ]
            },
            "SEC_SETTLECODE": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "НКД",
                        "FLOAT",
                        "17",
                        "Накопленный процентный доход на дату SettleDate для кода расчетов, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT2",
                        "НКД 2 части РЕПО",
                        "FLOAT",
                        "17",
                        "Накопленный процентный доход на дату SettleDate2 для кода расчетов, выраженный в валюте расчетов"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Фиксированная ставка РЕПО, в процентах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов адресной сделки или первой части сделки РЕПО"
                    ],
                    [
                        "SETTLEDATE2",
                        "Дата расчетов РЕПО",
                        "DATE",
                        "8",
                        "Дата расчетов второй части сделки РЕПО"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "TRANSFERSONLY",
                        "Только переводы",
                        "TYesNo",
                        "1",
                        "Разрешены только переводы"
                    ]
                ],
                "title": "Накопленный доход и ставки РЕПО на дату расчетов (обновляемая)",
                "desc": "По данному запросу, Торговая система предоставляет информацию по допустимым кодам расчетов для заданного инструмента, соответствующим датам расчетов и значениям накопленного дохода",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "SEC_SETTLECODE_STATS": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "PRICE",
                        "9",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "PRICE",
                        "9",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ]
                ],
                "title": "Лучшие котировки внебиржевых заявок *Всем (обновляемая)",
                "desc": "Таблица содержит информацию о адресных заявках с лучшими ценами (отдельно на покупку и на продажу) по финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ]
                ]
            },
            "SEC_STATS": {
                "output": [
                    [
                        "SESSION",
                        "Номер старта",
                        "INTEGER",
                        "10",
                        "Уникальный номер старта Торговой системы"
                    ],
                    [
                        "TEVERSION",
                        "Версия",
                        "CHAR",
                        "10",
                        "Номер версии торговой/клиринговой системы"
                    ],
                    [
                        "SYSTEMID",
                        "Тип",
                        "TSystemID",
                        "1",
                        "Тип торговой/клиринговой системы"
                    ],
                    [
                        "TESTSYSTEM",
                        "Тестовая система",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Итоги торговых сессий (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADINGSESSION</td> <td>Торговая сессия</td> <td>CHAR</td> <td align=right>1</td> <td>Идентификатор торговой сессии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TIME</td> <td>Время последней</td> <td>TIME</td> <td align=right>6</td> <td>Время заключения последней сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICEMINUSPREVWAPRICE</td> <td>К оценке пред. дня</td> <td>PRICE</td> <td align=right>10</td> <td>Цена последней сделки к оценке предыдущего дня</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VOLTODAY</td> <td>Количество за сегодня</td> <td>INTEGER</td> <td align=right>16</td> <td>Объем совершенных сделок, выраженный в единицах ценных бумаг</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LOWOFFER</td> <td>Лучшее предложение</td> <td>PRICE</td> <td align=right>9</td> <td>Наименьшая цена предложения в течение торговой сессии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">HIGHBID</td> <td>Лучший спрос</td> <td>PRICE</td> <td align=right>9</td> <td>Наибольшая цена спроса в течение торговой сессии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">HIGH</td> <td>Максимум</td> <td>PRICE</td> <td align=right>9</td> <td>Максимальная цена сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LOW</td> <td>Минимум</td> <td>PRICE</td> <td align=right>9</td> <td>Минимальная цена сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALTODAY</td> <td>Объем за сегодня</td> <td>INTEGER</td> <td align=right>16</td> <td>Объем совершенных сделок, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">WAPRICE</td> <td>Оценка</td> <td>PRICE</td> <td align=right>9</td> <td>Средневзвешенная цена</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OPEN</td> <td>Первая</td> <td>PRICE</td> <td align=right>9</td> <td>Цена первой сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LAST</td> <td>Последняя</td> <td>PRICE</td> <td align=right>9</td> <td>Цена последней сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PREVPRICE</td> <td>Последняя предыдущего дня</td> <td>PRICE</td> <td align=right>9</td> <td>Цена последней сделки предыдущего торгового дня</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LASTOFFER</td> <td>Предложение сессии</td> <td>PRICE</td> <td align=right>9</td> <td>Лучшая котировка на продажу на момент завершения нормального периода торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NUMTRADES</td> <td>Сделок за сегодня</td> <td>INTEGER</td> <td align=right>9</td> <td>Количество сделок за торговый день</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LASTBID</td> <td>Спрос сессии</td> <td>PRICE</td> <td align=right>9</td> <td>Лучшая котировка на покупку на момент завершения нормального периода торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ADMITTEDQUOTE</td> <td>Признаваемая котировка</td> <td>PRICE</td> <td align=right>9</td> <td>Признаваемая котировка, рассчитываемая в соответствии с методикой ФСФР</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">MARKETPRICETODAY</td> <td>Рыночная цена</td> <td>PRICE</td> <td align=right>9</td> <td>Рыночная цена по результатам торгов сегодняшнего дня, за одну ценную бумагу</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">MARKETPRICE2</td> <td>Рыночная цена 2</td> <td>PRICE</td> <td align=right>9</td> <td>Рыночная цена 2, рассчитываемая в соответствии с методикой ФСФР</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LCURRENTPRICE</td> <td>Текущая цена</td> <td>PRICE</td> <td align=right>9</td> <td>Официальная текущая цена, рассчитываемая как средневзвешенная цена сделок заключенных за последние 10 минут</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLOSING_AUCTION_PRICE</td> <td>Цена АЗ</td> <td>PRICE</td> <td align=right>9</td> <td>Цена аукциона закрытия. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LCLOSEPRICE</td> <td>Цена закрытия</td> <td>PRICE</td> <td align=right>9</td> <td>Официальная цена закрытия, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PREVLEGALCLOSEPRICE</td> <td>Цена закрытия предыдущего дня</td> <td>PRICE</td> <td align=right>9</td> <td>Официальная цена закрытия предыдущего дня, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OPENPERIODPRICE</td> <td>Цена предторгового периода</td> <td>PRICE</td> <td align=right>9</td> <td>Цена предторгового периода или аукциона открытия</td> </tr> </table> </ul> <a name=\"t0_35\"></a> <h4>SETTLECODES - Коды расчетов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE</td> <td>Дата расчетов</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов адресной сделки или первой части сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE2</td> <td>Дата расчетов 2</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов 2, для кодов расчетов типа 'R', соответствует дате исполнения второй части РЕПО</td> </tr> </table> </ul> <a name=\"t0_36\"></a> <h4>STATS - Параметры торговой системы (не обновляемая)</h4> <ul> Таблица состоит из одной строки и содержит информацию о параметрах торговой системы"
            },
            "STOPLIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ]
                ],
                "title": "Стоп-листы фирм (обновляемая)",
                "desc": "Таблица содержит информацию о клиентах, находящихся под санкциями"
            },
            "TESYSTIME": {
                "output": [
                    [
                        "TIME",
                        "Текущее время",
                        "TIME",
                        "6",
                        "Текущее время торгового/клирингового сервера"
                    ],
                    [
                        "DATE",
                        "Дата",
                        "DATE",
                        "8",
                        "Текущая дата торгового/клирингового сервера"
                    ],
                    [
                        "TOMORROWDATE",
                        "Дата следующих торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Текущее время торгового/клирингового сервера, микросекунды"
                    ]
                ],
                "title": "Системное время торгового сервера (обновляемая, очищать при обновлении)",
                "desc": "Таблица состоит из одной строки и содержит информацию о текущем времени торгового сервера. Используется для синхронизации времени на клиентском рабочем месте с временем торгового сервера."
            },
            "TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Номер заявки, на основании которой заключена сделка"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, совершившего сделку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой была совершена сделка"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы партнера"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого заключена данная сделка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "PRICE",
                        "9",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Накопленный купонный доход, рассчитанный в соответствии с количеством ценных бумаг данной сделки, в валюте расчетов"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "PRICE",
                        "9",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "TRADETYPE",
                        "Тип",
                        "TTradeType",
                        "1",
                        "Тип сделки"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "COMMISSION",
                        "Комиссия суммарная",
                        "FIXED",
                        "16.2",
                        "Объем комиссии по сделке, руб."
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "PRICE",
                        "9",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "ACCRUED2",
                        "Объем НКД при выкупе",
                        "FIXED",
                        "16.2",
                        "Процентный доход по сделке на дату выкупа, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполенной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "PRICE",
                        "9",
                        "Дисконт в процентах"
                    ],
                    [
                        "LOWERDISCOUNT",
                        "Нижний предел дисконта, %",
                        "PRICE",
                        "9",
                        "Дисконт в процентах"
                    ],
                    [
                        "UPPERDISCOUNT",
                        "Верхний предел дисконта, %",
                        "PRICE",
                        "9",
                        "Дисконт в процентах"
                    ],
                    [
                        "BLOCKSECURITIES",
                        "Блокировать обеспечение",
                        "TYesNo",
                        "1",
                        "Признак блокировки финансового инструмента на специальном счете на время операции РЕПО"
                    ],
                    [
                        "CLEARINGCENTERCOMM",
                        "Комиссия за клиринг",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения за клиринговые услуги, руб."
                    ],
                    [
                        "EXCHANGECOMM",
                        "Комиссия за торги",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения биржи, руб."
                    ],
                    [
                        "TRADINGSYSTEMCOMM",
                        "Комиссия за тех. доступ",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения Технического центра, руб."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "PARENTTRADENO",
                        "Витринная сделка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер витринной сделки в Торговой Системе для сделок РЕПО"
                    ],
                    [
                        "HIDDENQTYORDER",
                        "Сделка по айсберг-заявке",
                        "TYesNo",
                        "1",
                        "Принимает значение 'Y'/'N'. Поле содержит 'Y' если сделка была заключена на основании айсберг-заявки."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRADEDATE",
                        "Дата торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "CLEARINGBANKACCID",
                        "Клиринговый расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор клирингового расчетного счета в НКЦ"
                    ],
                    [
                        "MAKERFLAG",
                        "Активная/Пассивная",
                        "TMakerTaker",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "CPORDERNO",
                        "Встречная заявка адресной сделки",
                        "INTEGER",
                        "12",
                        "Идентификационный номер встречной заявки в Торговой Системе (только для сделок в адресном режиме)"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Сделка урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что сделка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTradeStatus",
                        "1",
                        "Статус сделки"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ],
                    [
                        "FACEAMOUNT",
                        "Объем по номиналу",
                        "FIXED",
                        "16.2",
                        "Объем сделки по номиналу, выраженный в валюте номинала"
                    ],
                    [
                        "CLEARINGTRDACCID",
                        "Клиринговый счет",
                        "CHAR",
                        "12",
                        "Номер клирингового счета"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была заключена сделка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ]
                ],
                "title": "Сделки (обновляемая)",
                "desc": "Таблица содержит информацию о сделках на покупку/продажу, заключенных Членом Секции (Членами Секции) с начала торговой сессии. Каждая сделка представлена в таблице одной строкой."
            },
            "TRADETIME": {
                "output": [
                    [
                        "TIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время наступления события"
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы финансовых инструментов, для которой определено событие"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима финансовых инструментов, для которого определено событие"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "TYPE",
                        "Событие",
                        "CHAR",
                        "2",
                        "Тип события. Все типы событий перечислены в таблице TRDTIMETYPES"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTimeStatus",
                        "1",
                        "Признак - наступило событие или еще нет"
                    ]
                ],
                "title": "Расписание торгов (обновляемая)",
                "desc": "Таблица содержит информацию о временных событиях, соответствующих изменению состояния торгов"
            },
            "TRADING_SESSION": {
                "output": [
                    [
                        "TYPE",
                        "Группа событий",
                        "CHAR",
                        "1",
                        "Группа событий"
                    ],
                    [
                        "NAME",
                        "Наименование группы",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий"
                    ],
                    [
                        "LATNAME",
                        "Английское наименование",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий на английском языке"
                    ]
                ],
                "title": "Торговые сессии (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ID</td> <td>Торговая сессия</td> <td>CHAR</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя торговой сессии</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SHORTNAME</td> <td>Краткое наименование</td> <td>CHAR</td> <td align=right>10</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_42\"></a> <h4>TRANTYPES - Типы переводов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRANTYPE</td> <td>Код операции</td> <td>CHAR</td> <td align=right>4</td> <td>Информация об операции</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>255</td> <td>Описание типа перевода</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td> <td>Англ. Описание</td> <td>CHAR</td> <td align=right>255</td> <td>Описание типа перевода на английском языке</td> </tr> </table> </ul> <a name=\"t0_43\"></a> <h4>TRDACC - Торговые счета (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип депозитарного счета</td> <td> TDepAccType</td> <td align=right>1</td> <td>Тип депозитарного счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Код дополнительной позиции по денежным средствам</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TTrdAccStatus</td> <td align=right>1</td> <td>Индикатор \"торговые операции разрешены/запрещены\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEPACCID</td> <td>Счет депо</td> <td>CHAR</td> <td align=right>12</td> <td>Номер счета депо в Депозитарии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td> <td>Тип торгового счета</td> <td>CHAR</td> <td align=right>1</td> <td>Тип торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMUSE</td> <td>Тип раздела</td> <td>CHAR</td> <td align=right>1</td> <td>Значение 'U' - раздел обеспечения; значения, отличные от 'U' - для торговых разделов.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">MAINTRDACCID</td> <td>Основной торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKIDT0</td> <td>Расчетная организация по Т0</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKIDTPLUS</td> <td>Расчетная организация по Т+</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEPUNITID</td> <td>Раздел счета Депо</td> <td>CHAR</td> <td align=right>17</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GCPLINKTRDACCID</td> <td>Связанный торговый счет Т+ для выдачи КСУ</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTUID</td> <td>Единый идентификатор раздела</td> <td>CHAR</td> <td align=right>12</td> <td>Единый уникальный идентификатор раздела, используемый в НРД</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTSECREQUEST</td> <td>Разрешение на подбор ценных бумаг на раздел</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_44\"></a> <h4>TRDACCTYPES - Список типов торгово-клиринговых счетов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td> <td>Тип торгового счета</td> <td>CHAR</td> <td align=right>1</td> <td>Тип торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя</td> <td>CHAR</td> <td align=right>30</td> <td>Наименование типа</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATNAME</td> <td>Англ. наименование</td> <td>CHAR</td> <td align=right>30</td> <td>Наименование типа на английском языке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OWN</td> <td>Собственный счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLIENT</td> <td>Клиентский счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRUST</td> <td>Доверительное управление (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ISSUING</td> <td>Эмиссионный счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TREASURY</td> <td>Казначейский счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>128</td> <td>Описание типа</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td> <td>Англ. Описание</td> <td>CHAR</td> <td align=right>128</td> <td>Описание типа на английском языке</td> </tr> </table> </ul> <a name=\"t0_45\"></a> <h4>TRDTIMEGROUPS - Группы событий (не обновляемая)</h4> <ul> Группы событий используемых в расписании"
            },
            "TRDTIMETYPES": {
                "output": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TActiveStatus",
                        "1",
                        "Текущее состояние записи об андеррайтере"
                    ]
                ],
                "title": "Типы событий расписания торгов (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип события</td> <td>CHAR</td> <td align=right>2</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>50</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GROUPTYPE</td> <td>Группа</td> <td>CHAR</td> <td align=right>1</td> <td>Тип группы событий</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LAT_DESCRIPTION</td> <td>Английский</td> <td>CHAR</td> <td align=right>50</td> <td>Описание на английском языке</td> </tr> </table> </ul> <a name=\"t0_47\"></a> <h4>UNDERWRITERS - Андеррайтеры (обновляемая)</h4> <ul> Таблица содержит информацию о фирмах, участниках торгов, являющихся андеррайтером при размещении ценной бумаги.",
                "input": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "USERGROUPS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для группы"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ]
                ],
                "title": "Группы пользователей (обновляемая)",
                "desc": "Таблица содержит информацию о группах пользователей.",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ]
                ]
            },
            "USERS": {
                "output": [
                    [
                        "USERID",
                        "Код участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "USERNAME",
                        "Участник",
                        "CHAR",
                        "30",
                        "&nbsp;"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADING",
                        "Торговые/клиринговые операции",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\" управляющим фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "CODMODESUBSCR",
                        "COD-подписка",
                        "TCodMode",
                        "1",
                        "Тип подписки на COD-режим. COD-режим - Cancel on Disconnect - режим снятия заявок при потере соединения с ТС или при отключении от ТС. Доступные режимы: \"Не используется\", \"Всегда\" и \"По требованию\""
                    ],
                    [
                        "CODMODE",
                        "COD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Disconnect)."
                    ],
                    [
                        "MASTERUSER1",
                        "Мастер ID 1",
                        "CHAR",
                        "12",
                        "Первый Мастер User ID для SMA-доступа"
                    ],
                    [
                        "MASTERUSER2",
                        "Мастер ID 2",
                        "CHAR",
                        "12",
                        "Второй Мастер User ID для SMA-доступа"
                    ],
                    [
                        "CODMODE_DC",
                        "CODCD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Drop-Copy  Disconnect)."
                    ],
                    [
                        "MASTERUSERFLAG",
                        "Мастер",
                        "TYesNo",
                        "1",
                        "Идентификатор является контролирующим Мастер Идентификатором (SMA-доступ)"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для пользователя"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ],
                    [
                        "USERALIAS",
                        "Псевдоним участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "IPGATEWAY",
                        "Сервер доступа",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "IPCLIENT",
                        "Рабочая станция",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "LOGGEDON",
                        "Активен",
                        "TBoolInt",
                        "1",
                        "Индикатор информирующий, что пользователь в настоящий момент подключен системе"
                    ],
                    [
                        "EXTIPCLIENT",
                        "Внешний адрес",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ]
                ],
                "title": "Пользователи (обновляемая)",
                "desc": "Таблица содержит информацию о пользователях, в том числе технологических, выделенных для фирмы-участника торгов и/или клиринга. Каждый пользователь представлен в таблице одной строкой."
            },
            "USER_CLIENT": {
                "output": [
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Привязка пользователей к кодам клиентов (обновляемая)",
                "desc": "Привязка пользователей к кодам клиентов"
            },
            "USER_TRDACC": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ]
                ],
                "title": "Трейдер-счет (не обновляемая)",
                "desc": "Привязка идентификаторов пользователей к торговым счетам"
            },
            "USTRADES": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Сделки для исполнения (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADENO</td> <td>Сделка №</td> <td>INTEGER</td> <td align=right>12</td> <td>Идентификационный номер сделки в Торговой Системе</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADEDATE</td> <td>Дата сделки</td> <td>DATE</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE</td> <td>Дата исполнения</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BUYSELL</td> <td>К/П</td> <td> TBuySell</td> <td align=right>1</td> <td>Направленность заявки - \"купля/продажа\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE</td> <td>Цена</td> <td>PRICE</td> <td align=right>9</td> <td>Цена за одну ценную бумагу</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUANTITY</td> <td>Лоты</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALUE</td> <td>Объем</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем сделки, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPFIRMID</td> <td>Партнер</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPTRDACCID</td> <td>Торговый счет партнера</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTNO</td> <td>Отчет</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPREPORTNO</td> <td>Отчет партнера</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TUSTradeStatus</td> <td align=right>1</td> <td>Состояние сделки для исполнения</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ACCRUEDINT</td> <td>Объем НКД</td> <td>FIXED</td> <td align=right>16.2</td> <td>Процентный доход, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BROKERREF</td> <td>Примечание</td> <td>CHAR</td> <td align=right>20</td> <td>Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTRADENO</td> <td>Сделка РЕПО</td> <td>INTEGER</td> <td align=right>12</td> <td>Идентификационный номер сделки первой части РЕПО для режимов торгов РЕПО без ЦК. Для режимов РЕПО с ЦК для первой части сделки заносится номер второй части. Для второй части сделки - номер первой.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE1</td> <td>Цена на дату заключения</td> <td>PRICE</td> <td align=right>9</td> <td>Цена первой части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORATE</td> <td>Ставка РЕПО, %</td> <td>PRICE</td> <td align=right>9</td> <td>Ставка РЕПО, в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE2</td> <td>Цена на дату исполнения</td> <td>PRICE</td> <td align=right>9</td> <td>Цена выкупа второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMISSION</td> <td>Комиссия</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем комиссии по сделке, руб.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLETIME</td> <td>Время исполнения</td> <td>TIME</td> <td align=right>6</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BALANCE</td> <td>Лотов к исполнению</td> <td>INTEGER</td> <td align=right>16</td> <td>Объем неисполненной части заявки, выраженный в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">AMOUNT</td> <td>Сумма к исполнению</td> <td>FIXED</td> <td align=right>16.2</td> <td>Обязательство или требование (в зависимости от направления сделки) по деньгам (для сделок второй части РЕПО - значение обязательства РЕПО на текущую дату)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOVALUE</td> <td>Сумма РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTERM</td> <td>Срок РЕПО</td> <td>INTEGER</td> <td align=right>4</td> <td>Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPO2VALUEBALANCE</td> <td>Остаток стоимости выкупа РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Текущее значение стоимости выкупа по сделке РЕПО, рассчитанная на дату исполнения (по условию сделки) второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">RETURNVALUE</td> <td>Сумма возврата РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Текущее значение суммы возврата по сделке РЕПО, рассчитанная на дату исполнения (по условию сделки) второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DISCOUNT</td> <td>Дисконт</td> <td>PRICE</td> <td align=right>9</td> <td>Для сделок первой части РЕПО - начальный дисконт. Для сделок второй части РЕПО - текущий дисконт.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LOWERDISCOUNT</td> <td>Нижний предел дисконта %</td> <td>PRICE</td> <td align=right>9</td> <td>Нижний предел дисконта %</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">UPPERDISCOUNT</td> <td>Верхний предел дисконта %</td> <td>PRICE</td> <td align=right>9</td> <td>Дисконт в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BLOCKSECURITIES</td> <td>Блокировать обеспечение</td> <td> TYesNo</td> <td align=right>1</td> <td>Признак блокировки финансового инструмента на специальном счете на время операции РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">URGENCYFLAG</td> <td>Исполнить</td> <td> TYesNo</td> <td align=right>1</td> <td>Индикатор информирующий, что сделка должна быть исполнена сегодня</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип</td> <td> TUSTradeType</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OPERATIONTYPE</td> <td>Операция</td> <td> TOperationType</td> <td align=right>1</td> <td>Тип операции: Зачисление/Списание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDDISCOUNT</td> <td>Дисконт после взноса %</td> <td>PRICE</td> <td align=right>9</td> <td>Размер дисконта в процентах после исполнения компенсационного взноса</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDQUANTITY</td> <td>Лотов после взноса</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг после исполнения компенсационного взноса, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDREPOVALUE</td> <td>Сумма РЕПО после взноса</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма привлеченных/предоставленных по сделке РЕПО денежных средств после исполнения компенсационного взноса</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDREPO2VALUE</td> <td>Стоимость выкупа после взноса</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем сделки выкупа РЕПО после исполнения компенсационного взноса, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDRETURNVALUE</td> <td>Сумма возврата после взноса</td> <td>FIXED</td> <td align=right>16.2</td> <td>Значение суммы возврата по сделке РЕПО после исполнения компенсационного взноса, выраженное в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLIENTCODE</td> <td>Код клиента</td> <td>CHAR</td> <td align=right>12</td> <td>Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NEXTDAYSETTLE</td> <td>Исполнить завтра</td> <td> TYesNo</td> <td align=right>1</td> <td>Индикатор информирующий, что сделка должна быть исполнена в следующий расчетный день</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORDERNO</td> <td>Заявка</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер заявки, на основании которой была заключена данная сделка</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTRADETRADEDATE</td> <td>Дата заключения</td> <td>DATE</td> <td align=right>8</td> <td>Для компенсационных взносов - дата заключения исходной сделки РЕПО, пусто для остальных случаев</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTREF</td> <td>Код внешнего пользователя</td> <td>CHAR</td> <td align=right>12</td> <td>Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLED</td> <td>Состояние расчетов</td> <td> TSettled</td> <td align=right>1</td> <td>Состояние расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTYPE</td> <td>Тип клиринга</td> <td> TClearingType</td> <td align=right>1</td> <td>Тип процедуры расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTIME</td> <td>Время расчетов</td> <td>TIME</td> <td align=right>6</td> <td>Время завершения процедуры расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTCOMMISSION</td> <td>Комиссия за отчет</td> <td>FIXED</td> <td align=right>16.2</td> <td>Размер комиссионного вознаграждения за исполнение сделки срочным отчетом, в руб.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COUPONPAYMENT</td> <td>Купонная выплата</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем купонной выплаты, прошедшей со дня последних торгов по бумагам, входящим в обеспечение сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COUPONPAYMENTDATE</td> <td>Дата купонной выплаты</td> <td>DATE</td> <td align=right>8</td> <td>Дата прошедшей купонной выплаты</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRINCIPALPAYMENT</td> <td>Выплата по основному долгу</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем выплаты по основному долгу, прошедшей со дня последних торгов по бумагам, входящим в обеспечение сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRINCIPALPAYMENTDATE</td> <td>Дата выплаты по основному долгу</td> <td>DATE</td> <td align=right>8</td> <td>Дата прошедшей выплаты по основному долгу (амортизации)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CONFIRMED</td> <td>Статус подтверждения</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPCONFIRMED</td> <td>Статус подтверждения контрагента</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CONFIRMREPORT</td> <td>Номер поручения</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер поручения на подтверждение внебиржевой сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CONFIRMTIME</td> <td>Время подтверждения</td> <td>TIME</td> <td align=right>6</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRECISEBALANCE</td> <td>Бумаг к исполнению</td> <td>INTEGER</td> <td align=right>16</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKID</td> <td>Расчетная организация</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRENCYID</td> <td>Валюта расчетов</td> <td>CHAR</td> <td align=right>4</td> <td>Валюта расчетов по инструменту</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMPVAL</td> <td>Сумма отступного</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма отступного, в валюте сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PARENTTRADENO</td> <td>Витринная сделка</td> <td>INTEGER</td> <td align=right>12</td> <td>Идентификационный номер витринной сделки в Торговой Системе для сделок РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td> <td>Клиринговая фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы - Участника Клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGBANKACCID</td> <td>Клиринговый расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор клирингового расчетного счета в НКЦ</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTRDACCID</td> <td>Клиринговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер клирингового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLESTATUS</td> <td>Досрочное исполнение</td> <td> TEarlySettle</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLEREPORTNO</td> <td>Отчет на досрочное исполнение</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета на досрочное исполнение</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLECPREPORTNO</td> <td>Отчет на досрочное исполнение партнера</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета на досрочное исполнение от партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DUEDATE</td> <td>Надлежащая дата расчетов</td> <td>DATE</td> <td align=right>8</td> <td>Надлежащая дата расчетов сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FLOATINGRATE</td> <td>Плавающая ставка</td> <td> TFloatingRate</td> <td align=right>1</td> <td>Признак плавающей ставки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BENCHMARK</td> <td>Бенчмарк</td> <td>CHAR</td> <td align=right>8</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_53\"></a> <h4>U_BOARD_BLACK_LIST - Чёрный список режимов торгов (обновляемая)</h4> <ul> Cписок недоступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_BOARD_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Белый список режимов торгов (обновляемая)",
                "desc": "Список доступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_HOLD_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения позиции по бумагам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в ценных бумагах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_ORDER_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICEBOUNDUP",
                        "Отклонение цены вверх",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вверх (в процентах от текущей цены)"
                    ],
                    [
                        "PRICEBOUNDDOWN",
                        "Отклонение цены вниз",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вниз (в процентах от текущей цены)"
                    ],
                    [
                        "MAXQTY",
                        "Максимальное количество в заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в заявке"
                    ],
                    [
                        "MAXORDERVAL",
                        "Максимальный объем заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXMKTQTY",
                        "Максимальное количество в рыночной заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в рыночной заявке"
                    ],
                    [
                        "MAXMKTORDERVAL",
                        "Максимальный объем рыночной заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем рыночной заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXORDVALTODAY",
                        "Максимальная сумма заявок",
                        "FIXED",
                        "16.2",
                        "Максимальная сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "CURORDVALTODAY",
                        "Текущая сумма заявок",
                        "FIXED",
                        "16.2",
                        "Текущая сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения по заявкам (обновляемая)",
                "desc": "Ограничения пользователя по заявкам",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_POSN_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения позиции по деньгам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в деньгах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список недоступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список доступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (обновляемая)",
                "desc": "Список недоступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (обновляемая)",
                "desc": "Список доступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            }
        },
        "Currency": {
            "ALL_TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки инициирующей заключение сделки: B - Купля  S - Продажа  Для СВОП-заявок:  B - Продажа/Купля  S - Купля/Продажа"
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ]
                ],
                "title": "Все сделки (обновляемая)",
                "desc": "Таблица содержит общую информацию (без указания сторон по сделке) по всем сделкам купли/продажи финансовых инструментов, совершенным в Торговой Системе с начала торговой сессии"
            },
            "AUCTSTATS": {
                "output": [
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDTIME",
                        "Запланированное время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона (из расписания торгов)"
                    ],
                    [
                        "STARTTIME",
                        "Время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона"
                    ],
                    [
                        "ENDTIME",
                        "Время окончания аукциона",
                        "TIME",
                        "6",
                        "Время окончания аукциона"
                    ],
                    [
                        "AUCTPRICE",
                        "Итоговая цена аукциона",
                        "PRICE",
                        "9",
                        "Итоговая цена аукциона. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона."
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем совершенных сделок аукциона, выраженный в валюте расчетов. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "VOLUME",
                        "Количество",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, в единицах ценных бумаг. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "NUMTRADES",
                        "Сделок",
                        "INTEGER",
                        "9",
                        "Количество заключенных сделок"
                    ],
                    [
                        "IMBALANCE",
                        "Дисбаланс",
                        "INTEGER",
                        "16",
                        "Суммарный объем заявок, которые остались бы неисполненными при завершении аукциона по ожидаемой цене"
                    ],
                    [
                        "MARKETVOLB",
                        "Рыночных на покупку",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на покупку по ожидаемой цене, в единицах ценных бумаг"
                    ],
                    [
                        "MARKETVOLS",
                        "Рыночных на продажу",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на продажу, в единицах ценных бумаг"
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявок на покупку (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку  на аукционе КП"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявок на продажу (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу  на аукционе КП"
                    ],
                    [
                        "DPORDERINDICATOR",
                        "Наличие спроса/предложения",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку или продажу на аукционе крупными лотами до данному финасовому инструменту"
                    ]
                ],
                "title": "Результаты аукционов (обновляемая)",
                "desc": "Результаты аукционов"
            },
            "BANK": {
                "output": [
                    [
                        "URGENCY",
                        "Важность",
                        "TUrgency",
                        "1",
                        "Срочность или важность сообщения"
                    ],
                    [
                        "FROMUSER",
                        "От кого",
                        "CHAR",
                        "12",
                        "Идентификатор пользователя, отправившего сообщение"
                    ],
                    [
                        "MSGTIME",
                        "Время",
                        "CHAR",
                        "8",
                        "Время, когда было отправлено сообщение"
                    ],
                    [
                        "MSGTEXT",
                        "Текст",
                        "CHAR",
                        "256",
                        "Текст сообщения"
                    ]
                ],
                "title": "Расчетные организации (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKID</td> <td>Расчетная организация</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SHORTNAME</td> <td>Наименование</td> <td>CHAR</td> <td align=right>12</td> <td>Краткое наименование расчетной организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKNAME</td> <td>Полное наименование</td> <td>CHAR</td> <td align=right>120</td> <td>Полное наименование расчетной организации</td> </tr> </table> </ul> <a name=\"t0_3\"></a> <h4>BANKACC - Расчетные коды (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Расчетный код в клиринговой организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEFAULTER</td> <td>Дополнительная сессия</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLE</td> <td>Ранние расчеты</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADINGCLOSED</td> <td>Торги закончены</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TStatus</td> <td align=right>1</td> <td>Индикатор \"торговые/клиринговые операции разрешены/запрещены\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLIENTCODE</td> <td>Код клиента</td> <td>CHAR</td> <td align=right>12</td> <td>Код клиента, присвоенный брокером</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td> <td>Клиринговая фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы - Участника Клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGBANKACCID</td> <td>Клиринговый расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор клирингового расчетного счета в НКЦ</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DETAILS</td> <td>Реквизит 1</td> <td>CHAR</td> <td align=right>20</td> <td>Данные о клиенте (ИНН, номер паспорта или другой документ)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SUBDETAILS</td> <td>Реквизит 2</td> <td>CHAR</td> <td align=right>20</td> <td>Данные о клиенте клиента (ИНН, номер паспорта или другой документ)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">UNIFIEDPOOL</td> <td>Единый пул</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLETIME</td> <td>Время ранних расчетов</td> <td>TIME</td> <td align=right>6</td> <td>Время ранних расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADINGCLOSEDTIME</td> <td>Время прекращения торгов</td> <td>TIME</td> <td align=right>6</td> <td>Время прекращения торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMBANKACCID</td> <td>Расчетный код для списания оборотной комиссии</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации для списания оборотной комиссии</td> </tr> </table> </ul> <a name=\"t0_4\"></a> <h4>BCMESSAGES - Сообщения (обновляемая)</h4> <ul> Таблица содержит информацию о сообщениях, полученных от других участников торгов с момента начала торговой сессии"
            },
            "BOARDS": {
                "output": [
                    [
                        "BOARDID",
                        "Код режима",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "BOARDNAME",
                        "Режим",
                        "CHAR",
                        "30",
                        "Наименование режима"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка, к которому относится данный режим"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование режима торгов на английском языке"
                    ]
                ],
                "title": "Режимы торгов (обновляемая)",
                "desc": "Таблица содержит информацию о режимах торгов. Под режимом понимается набор правил проведения торгов, определяющих допустимые типы заявок, регламент торгов, виды расчетов и пр. Каждый режим представлен в таблице одной строкой."
            },
            "CLIENTCODES": {
                "output": [
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "CLIENTTYPE",
                        "Тип",
                        "CHAR",
                        "2",
                        "Форма идентификации клиента"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "QINVESTOR",
                        "Квалифицированный инвестор",
                        "TYesNo",
                        "1",
                        "Квалифицированный инвестор"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние кода клиента"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "BLOCKCLIENTTE",
                        "Блокировка торгов",
                        "TYesNo",
                        "1",
                        "Флаг блокировки доступа к торгам"
                    ]
                ],
                "title": "Клиенты брокера (обновляемая)",
                "desc": "Таблица \"Клиенты брокера\" содержит информацию о кодах клиентов, зарегистрированных в торговой системе ММВБ для данного брокера"
            },
            "CURRENCY": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "MMID",
                        "ID записи",
                        "CHAR",
                        "12",
                        "Идентификатор записи маркет-мейкинга в ТС"
                    ],
                    [
                        "PARENTMMID",
                        "ID родительской записи",
                        "CHAR",
                        "12",
                        "Идентификатор родительской записи маркет-мейкинга в ТС"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SCHEMANAME",
                        "Схема",
                        "CHAR",
                        "20",
                        "Наименование схемы маркет-мейкинга"
                    ],
                    [
                        "AGREEMENT",
                        "№ договора",
                        "CHAR",
                        "12",
                        "Идентификатор (номер) договора с маркет-мейкером"
                    ],
                    [
                        "AGREEMENTDATE",
                        "Дата договора",
                        "DATE",
                        "8",
                        "Дата подписания договора с маркет-мейкером"
                    ],
                    [
                        "MINSPREADVOLUMEBUY",
                        "МДО 1",
                        "INTEGER",
                        "16",
                        "Минимальный допустимый объем заявки маркет-мейкера в лотах"
                    ],
                    [
                        "MINSPREADVOLUMESELL",
                        "МДО 2",
                        "INTEGER",
                        "16",
                        "Дополнительный минимальный допустимый объем заявки маркет-мейкера в лотах"
                    ],
                    [
                        "MAXTRADESVOLUME",
                        "ДО",
                        "INTEGER",
                        "16",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на одностороннее или на освобождение от котирования, в лотах"
                    ],
                    [
                        "MAXTRADESVALUE",
                        "ДО, руб.",
                        "FIXED",
                        "16.2",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на одностороннее или на освобождение от котирования, руб."
                    ],
                    [
                        "MAXSPREADPERC",
                        "Макс. спрэд 1, %",
                        "FLOAT",
                        "8",
                        "Допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPERC1",
                        "Макс. спрэд 2, %",
                        "FLOAT",
                        "8",
                        "Второй допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPERC2",
                        "Макс. спрэд 3, %",
                        "FLOAT",
                        "8",
                        "Третий допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPRICE",
                        "Макс. спрэд",
                        "PRICE",
                        "9",
                        "Допустимый коридор колебания цены в руб."
                    ],
                    [
                        "MINKEEPPERCENT",
                        "Мин. % исполнения",
                        "FIXED",
                        "9.2",
                        "Минимальный процент исполнения"
                    ],
                    [
                        "CURRENTSPREADPERC",
                        "Спрэд, %",
                        "FLOAT",
                        "8",
                        "Величина текущего спрэда маркет-мейкера в процентах"
                    ],
                    [
                        "CURRENTSPREADPRICE",
                        "Спрэд",
                        "PRICE",
                        "9",
                        "Величина текущего спрэда маркет-мейкера в руб."
                    ],
                    [
                        "CURRENTMINBUYPRICE",
                        "Лучшая цена покупки",
                        "PRICE",
                        "9",
                        "Лучшая цена активной лимитированной заявки на покупку"
                    ],
                    [
                        "CURRENTMAXSELLPRICE",
                        "Лучшая цена продажи",
                        "PRICE",
                        "9",
                        "Лучшая цена активной лимитированной заявки на продажу"
                    ],
                    [
                        "CURRENTALLOWEDBUYPRICE",
                        "Минимум доп.",
                        "PRICE",
                        "9",
                        "Минимальная допустимая цена активной лимитной заявки на покупку"
                    ],
                    [
                        "CURRENTALLOWEDSELLPRICE",
                        "Максимум доп.",
                        "PRICE",
                        "9",
                        "Максимальная допустимая цена активной  лимитной заявки на продажу"
                    ],
                    [
                        "TOTALBUYVOLUME",
                        "Купля",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на покупку, выраженный в лотах"
                    ],
                    [
                        "TOTALSELLVOLUME",
                        "Продажа",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на продажу, выраженный в лотах"
                    ],
                    [
                        "TOTALBREACHTIME",
                        "Время перерыва",
                        "TIME",
                        "6",
                        "Общее время нарушения маркет-мейкером своих обязательств по поддержке котировок"
                    ],
                    [
                        "TOTALKEEPTIME",
                        "Время поддерж.",
                        "TIME",
                        "6",
                        "Общее время выполнения обязательств по МДО и спрэду"
                    ],
                    [
                        "FACTTRADESVOLUME",
                        "Объем",
                        "INTEGER",
                        "16",
                        "Текущий объем заключенных сделок, в лотах"
                    ],
                    [
                        "FACTTRADESVALUE",
                        "Объем, руб.",
                        "FIXED",
                        "16.2",
                        "Текущий объем заключенных сделок, в руб."
                    ],
                    [
                        "FACTKEEPPERCENT",
                        "% исполнения",
                        "FIXED",
                        "9.2",
                        "&nbsp;"
                    ],
                    [
                        "LEFTKEEPTIME",
                        "Оставшееся время до исполнения",
                        "TIME",
                        "6",
                        "Оставшееся время до исполнения обязательств"
                    ],
                    [
                        "UPDATETIME",
                        "Время обновления",
                        "TIME",
                        "6",
                        "Время обновления"
                    ],
                    [
                        "PROCESSED",
                        "Обязат. исполн.",
                        "TYesNo",
                        "1",
                        "Обязательства исполнены"
                    ],
                    [
                        "KEEPSPREADVARIANT",
                        "Тип спрэда",
                        "CHAR",
                        "4",
                        "Тип поддерживаемого спрэда"
                    ]
                ],
                "title": "Справочник валют (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRCODE</td> <td>Валюта расчетов</td> <td>CHAR</td> <td align=right>4</td> <td>Код валюты расчетов инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRENCYNAME</td> <td>Наименование</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CROSSRATE</td> <td>Курс</td> <td>FLOAT</td> <td align=right>17</td> <td>Курс в руб. за единицу валюты с плавающей точкой</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ASSET</td> <td>Актив</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_8\"></a> <h4>EXT_MMSTATS - Обязательства маркет-мейкера (обновляемая)</h4> <ul> В таблице представлена информация по выполнению маркет-мейкером его обязательств"
            },
            "EXT_ORDERBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Цена котировки"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ]
                ],
                "title": "Котировки по инструменту (обновляемая, очищать при обновлении)",
                "desc": "Расширенный вариант таблицы котировок. Таблица содержит информацию о заявках с лучшими ценами и временем активации (отдельно на покупку и на продажу) по финансовому инструменту. Каждая строка таблицы соответствует уникальной паре значений времени активации и цены для финансового инструмента и отражает суммарное количество лотов, выставленных на покупку или продажу по этой цене с данным временем активации.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "DEPTH",
                        "Глубина котировок",
                        "INTEGER",
                        "2",
                        "Запрашиваемое количество лучших котировок на покупку/продажу по инструменту. Для получения всех котировок значение не указывается."
                    ]
                ]
            },
            "FIRMS": {
                "output": [
                    [
                        "FIRMID",
                        "Код фирмы",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "FIRMNAME",
                        "Фирма",
                        "CHAR",
                        "30",
                        "Краткое наименование фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "EXCHANGE",
                        "Биржа",
                        "CHAR",
                        "4",
                        "Идентификатор региональной биржи"
                    ],
                    [
                        "INN",
                        "ИНН",
                        "CHAR",
                        "12",
                        "Индивидуальный номер налогоплательщика"
                    ],
                    [
                        "INLIQUIDATION",
                        "Ликвидационный неттинг",
                        "TYesNo",
                        "1",
                        "В отношении фирмы инициирован ликвидационный неттинг"
                    ],
                    [
                        "CLEARINGACCESS",
                        "Доступ к клирингу",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "TRADINGACCESS",
                        "Доступ к торгам",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Фирмы (обновляемая)",
                "desc": "Данная таблица содержит информацию о фирмах-участниках торгов. Каждая фирма представлена одной строкой таблицы."
            },
            "INDEXES": {
                "output": [
                    [
                        "INDEXBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для ценных бумаг, участвующих в расчете индекса"
                    ],
                    [
                        "INDEXCODE",
                        "Код индекса",
                        "CHAR",
                        "12",
                        "Идентификатор биржевого индекса"
                    ],
                    [
                        "NAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса"
                    ],
                    [
                        "SHORTNAME",
                        "Индекс",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "CURRENTVALUE",
                        "Текущий",
                        "PRICE",
                        "9",
                        "Текущее значение индекса"
                    ],
                    [
                        "LASTVALUE",
                        "Закрытие",
                        "PRICE",
                        "9",
                        "Последнее значение индекса предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части числа. Используется для форматирования значений полей с типом PRICE."
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса на английском языке"
                    ],
                    [
                        "TIME",
                        "Время вычисления",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "OPENVALUE",
                        "Открытие",
                        "PRICE",
                        "9",
                        "Значение индекса на открытие текущего торгового дня"
                    ],
                    [
                        "VALTODAY",
                        "Объем торгов",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок по бумагам, входящим в индекс, выраженный в руб."
                    ],
                    [
                        "MIN",
                        "Минимум",
                        "PRICE",
                        "9",
                        "Минимальное значение индекса"
                    ],
                    [
                        "MAX",
                        "Максимум",
                        "PRICE",
                        "9",
                        "Максимальное значение индекса"
                    ]
                ],
                "title": "Индексы (обновляемая)",
                "desc": "Таблица содержит интегральные показатели валютного рынка, например, значение бивалютной корзины"
            },
            "INSTRS": {
                "output": [
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "INSTRNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование группы инструментов"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "INSTRTYPE",
                        "Тип инструмента",
                        "TInstrType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "QUOTEBASIS",
                        "Тип курса",
                        "TQuoteBasis",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "INSTRFWD",
                        "\"Длинный\" инструмент",
                        "TYesNo",
                        "1",
                        "Признак того, что данный инструмент является форвардом или \"длинным СВОПом\""
                    ]
                ],
                "title": "Группы финансовых инструментов (обновляемая)",
                "desc": "Таблица содержит информацию о группах однотипных ценных бумаг (например: Акции (1 уровень), Акции (2 уровень), Внесписочные акции и т.д.) Каждая группа ценных бумаг представлена в таблице одной строкой."
            },
            "MARKETS": {
                "output": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "MARKETNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка на английском языке"
                    ]
                ],
                "title": "Рынки (обновляемая)",
                "desc": "Таблица содержит информацию о рынках. Под рынком понимается группа режимов торгов, объединенных по административным признакам (ГЦБ, НГЦБ, РПС)."
            },
            "NEGDEALBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс котировки"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ]
                ],
                "title": "Котировки внесистемных заявок *Всем (обновляемая, очищать при обновлении)",
                "desc": "Таблица содержит информацию о внесистемных заявках с лучшими ценами (отдельно на покупку и на продажу) по финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ]
                ]
            },
            "NEGDEALS": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию внесистемной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило: <код клиента>/<номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных внесистемных заявок"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "CPUSERALIAS",
                        "Псевдоним адресата",
                        "CHAR",
                        "12",
                        "Псевдоним пользователя, которому адресована заявка"
                    ]
                ],
                "title": "Внесистемные заявки (обновляемая)",
                "desc": "Таблица содержит информацию о внесистемных заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала торговой сессии, для регистрации внесистемных сделок. Каждая внесистемная заявка представлена в таблице одной строкой."
            },
            "ONENEGDEAL": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию внесистемной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило: <код клиента>/<номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных внесистемных заявок"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "CPUSERALIAS",
                        "Псевдоним адресата",
                        "CHAR",
                        "12",
                        "Псевдоним пользователя, которому адресована заявка"
                    ]
                ],
                "title": "Информация по внесистемной заявке (обновляемая)",
                "desc": "Таблица состоит из одной строки и содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ONEORDER": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по курсу",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным курсам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило: <код клиента>/<номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, подавший заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ENTRYTYPE",
                        "Тип ввода",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения курса заявки - \"по курсу/по средневзвешенному курсу\""
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VISIBLEBALANCE",
                        "Видимое количество",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части айсберг-заявки, отображаемый в котировках, выраженный в лотах"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "PRICE",
                        "9",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ]
                ],
                "title": "Информация по заявке (обновляемая)",
                "desc": "Таблица содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ORDERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по курсу",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным курсам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило: <код клиента>/<номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, подавший заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ENTRYTYPE",
                        "Тип ввода",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения курса заявки - \"по курсу/по средневзвешенному курсу\""
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VISIBLEBALANCE",
                        "Видимое количество",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части айсберг-заявки, отображаемый в котировках, выраженный в лотах"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "PRICE",
                        "9",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ]
                ],
                "title": "Заявки (обновляемая)",
                "desc": "Таблица содержит информацию о заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "PRICEMOVELIMIT": {
                "output": [
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "NUM",
                        "Диапазон",
                        "INTEGER",
                        "1",
                        "Номер диапазона"
                    ],
                    [
                        "LIMITBEGIN",
                        "Начало диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND",
                        "Конец диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "RTL_RUB",
                        "Нижняя граница курса",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "RTH_RUB",
                        "Верхняя граница курса",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "LIMITBEGIN_RUB",
                        "Начало диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND_RUB",
                        "Конец диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_L",
                        "Ставка риска падения курса, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_H",
                        "Ставка риска роста курса, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "RCRUB",
                        "Центральный курс",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "CHANGETIME",
                        "Время изменения ставок риска",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ]
                ],
                "title": "Ценовые границы (не обновляемая)",
                "desc": "<table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Входное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> </table>",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "UPPERLIMIT",
                        "Верхняя граница",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "LOWERLIMIT",
                        "Нижняя граница",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ]
                ]
            },
            "SECTRANSFERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки на перевод в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки на перевод в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки на перевод"
                    ],
                    [
                        "BUYSELL",
                        "З/С",
                        "TSecTransferBuySell",
                        "1",
                        "Направленность перевода: \"покупка\" - зачисление на счет,  \"продажа\" - списание со счета."
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило: <код клиента>/<номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, подавший заявку на перевод"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой подана заявка на перевод"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма, которой адресована заявка на перевод"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных переводов"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем перевода, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "WITHDRAWTIME",
                        "Время снятия",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ]
                ],
                "title": "Заявки на перевод (обновляемая)",
                "desc": "Таблица содержит текущую информацию о заявках на перевод ценных бумаг или денег, поданных Членом Секции в Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "SECURITIES": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Код инструмента",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SECNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента"
                    ],
                    [
                        "REMARKS",
                        "Примечание",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "SHORTNAME",
                        "Инструмент",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TSecStatus",
                        "1",
                        "Индикатор \"торговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADINGSTATUS",
                        "Состояние",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту"
                    ],
                    [
                        "MARKETCODE",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка на котором торгуется финансовый инструмент"
                    ],
                    [
                        "INSTRID",
                        "Группа инструментов",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "LOTSIZE",
                        "Размер лота",
                        "INTEGER",
                        "8",
                        "Количество валюты в одном стандартном лоте"
                    ],
                    [
                        "MINSTEP",
                        "Мин. шаг курса заявок",
                        "PRICE",
                        "9",
                        "Минимально возможная разница между курсами, указанными в заявках на покупку/продажу ценных бумаг (кроме заявок \"со средневзвешенной ценой\")"
                    ],
                    [
                        "FACEVALUE",
                        "Номинал",
                        "FLOAT",
                        "17",
                        "Установленное количество инструмента, для которого указывается курс в котировках"
                    ],
                    [
                        "FACEUNIT",
                        "Валюта инструмента",
                        "CHAR",
                        "4",
                        "Валюта, в которой выражен номинал инструмента"
                    ],
                    [
                        "PREVPRICE",
                        "Последняя предыдущего дня",
                        "PRICE",
                        "9",
                        "Курс последней сделки предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части числа. Используется для форматирования значений полей с типом PRICE."
                    ],
                    [
                        "PREVWAPRICE",
                        "Оценка пред. дня",
                        "PRICE",
                        "9",
                        "Значение оценки предыдущего торгового дня"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента на английском языке"
                    ],
                    [
                        "PREVLOTSIZE",
                        "Предыдущий размер лота",
                        "INTEGER",
                        "8",
                        "Предыдущее значение размера лота"
                    ],
                    [
                        "LOTSIZECHANGEDATE",
                        "Дата последнего изменения размера лота",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "ORIGINTRADINGSTATUS",
                        "Состояние сессии",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту. Во время перерыва показывает действительное состояние торговой сесии (никогда не принимает значение \"Перерыв\")."
                    ],
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "LOTDIVIDER",
                        "Коэффициент дробления",
                        "INTEGER",
                        "8",
                        "Количество валюты в одном стандартном лоте"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "PRICE",
                        "9",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "PRICE",
                        "9",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ],
                    [
                        "OPEN",
                        "Первая",
                        "PRICE",
                        "9",
                        "Курс первой сделки"
                    ],
                    [
                        "HIGH",
                        "Максимум",
                        "PRICE",
                        "9",
                        "Максимальный курс сделки"
                    ],
                    [
                        "LOW",
                        "Минимум",
                        "PRICE",
                        "9",
                        "Минимальный курс сделки"
                    ],
                    [
                        "LAST",
                        "Последняя",
                        "PRICE",
                        "9",
                        "Курс последней сделки"
                    ],
                    [
                        "CHANGE",
                        "К закрытию",
                        "PRICE",
                        "9",
                        "Изменение курса последней сделки по отношению к курсу последней сделки предыдущего торгового дня"
                    ],
                    [
                        "QTY",
                        "Лотов в последней",
                        "INTEGER",
                        "16",
                        "Объем последней сделки, в лотах"
                    ],
                    [
                        "TIME",
                        "Время последней",
                        "TIME",
                        "6",
                        "Время заключения последней сделки"
                    ],
                    [
                        "VOLTODAY",
                        "Объем в валюте инструмента",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в валюте финансового инструмента"
                    ],
                    [
                        "VALTODAY",
                        "Объем за сегодня",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в валюте расчетов"
                    ],
                    [
                        "VALUE",
                        "Объем в последней",
                        "FIXED",
                        "16.2",
                        "Объем последней сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "WAPRICE",
                        "Оценка",
                        "PRICE",
                        "9",
                        "Средневзвешенный курс"
                    ],
                    [
                        "HIGHBID",
                        "Лучший спрос",
                        "PRICE",
                        "9",
                        "Наибольший курс спроса в течение торговой сессии"
                    ],
                    [
                        "LOWOFFER",
                        "Лучшее предложение",
                        "PRICE",
                        "9",
                        "Наименьший курс предложения в течение торговой сессии"
                    ],
                    [
                        "NUMTRADES",
                        "Сделок за сегодня",
                        "INTEGER",
                        "9",
                        "Количество сделок за торговый день"
                    ],
                    [
                        "PRICEMINUSPREVWAPRICE",
                        "К оценке пред. дня",
                        "PRICE",
                        "10",
                        "Курс последней сделки к оценке предыдущего дня"
                    ],
                    [
                        "CLOSEPRICE",
                        "Срвзв. курс 11:30",
                        "PRICE",
                        "9",
                        "Курс периода закрытия"
                    ],
                    [
                        "NUMNEGDEALS",
                        "Внесистемных сделок",
                        "INTEGER",
                        "9",
                        "Количество внесистемных сделок за торговый день"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "MARKETPRICE",
                        "Вчерашний фиксинг",
                        "PRICE",
                        "9",
                        "Фиксинг МБ (рассчитанный вчера)"
                    ],
                    [
                        "MARKETPRICETODAY",
                        "Текущий фиксинг",
                        "PRICE",
                        "9",
                        "Значение курса, полученное по методике оценки ликвидности в стакане и сделок за секундный интервал"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по умолчанию для данного инструмента"
                    ],
                    [
                        "MARKETPRICE2",
                        "Фиксинг МБ",
                        "PRICE",
                        "9",
                        "Среднее значение FX fixing Curr, рассчитанное с 12:25:01 по 12:30:00"
                    ],
                    [
                        "ADMITTEDQUOTE",
                        "Международный фиксинг",
                        "PRICE",
                        "9",
                        "Арифметическое среднее FX fixing ME и FX fixing EBS"
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявки на покупку WAP",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку в режиме средневзвешенных сделок"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявки на продажу WAP",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу в режиме средневзвешенных сделок"
                    ],
                    [
                        "SETTLEDATE1",
                        "Дата расчетов 1",
                        "DATE",
                        "8",
                        "Дата расчетов по сделке или первой части сделки РЕПО/своп"
                    ],
                    [
                        "SETTLEDATE2",
                        "Дата расчетов 2",
                        "DATE",
                        "8",
                        "Дата расчетов второй части сделки РЕПО/своп"
                    ]
                ],
                "title": "Финансовые инструменты (обновляемая)",
                "desc": "Таблица содержит текущую биржевую информацию о финансовых инструментах, относящихся к различным режимам торгов. Каждая строка таблицы соответствует уникальной паре режим торгов - финансовый инструмент.",
                "input": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ]
                ]
            },
            "SEC_SETTLECODE": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "TRANSFERSONLY",
                        "Только переводы",
                        "TYesNo",
                        "1",
                        "Разрешены только переводы"
                    ]
                ],
                "title": "Коды расчетов для инструмента (обновляемая)",
                "desc": "По данному запросу, Торговая система предоставляет информацию по допустимым кодам расчетов для заданного инструмента и соответствующим датам расчетов",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "SEC_SETTLECODE_STATS": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "PRICE",
                        "9",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "PRICE",
                        "9",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ]
                ],
                "title": "Лучшие котировки внебиржевых заявок *Всем (обновляемая)",
                "desc": "Таблица содержит информацию о внесистемных заявках с лучшими ценами (отдельно на покупку и на продажу) по финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "SETTLECODES": {
                "output": [
                    [
                        "SESSION",
                        "Номер старта",
                        "INTEGER",
                        "10",
                        "Уникальный номер старта Торговой системы"
                    ],
                    [
                        "TEVERSION",
                        "Версия",
                        "CHAR",
                        "10",
                        "Номер версии торговой/клиринговой системы"
                    ],
                    [
                        "SYSTEMID",
                        "Тип",
                        "TSystemID",
                        "1",
                        "Тип торговой/клиринговой системы"
                    ],
                    [
                        "TESTSYSTEM",
                        "Тестовая система",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Коды расчетов (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE</td> <td>Дата расчетов</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIXINGDATE</td> <td>Дата фиксинга</td> <td>DATE</td> <td align=right>8</td> <td>Дата фиксинга</td> </tr> </table> </ul> <a name=\"t0_26\"></a> <h4>STATS - Параметры торговой системы (не обновляемая)</h4> <ul> Таблица состоит из одной строки и содержит информацию о параметрах торговой системы"
            },
            "STOPLIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ]
                ],
                "title": "Стоп-листы фирм (обновляемая)",
                "desc": "Таблица содержит информацию о клиентах, находящихся под санкциями"
            },
            "TESYSTIME": {
                "output": [
                    [
                        "TIME",
                        "Текущее время",
                        "TIME",
                        "6",
                        "Текущее время торгового/клирингового сервера"
                    ],
                    [
                        "DATE",
                        "Дата",
                        "DATE",
                        "8",
                        "Текущая дата торгового/клирингового сервера"
                    ],
                    [
                        "TOMORROWDATE",
                        "Дата следующих торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Текущее время торгового/клирингового сервера, микросекунды"
                    ]
                ],
                "title": "Системное время торгового сервера (обновляемая, очищать при обновлении)",
                "desc": "Таблица состоит из одной строки и содержит информацию о текущем времени торгового сервера. Используется для синхронизации времени на клиентском рабочем месте с временем торгового сервера."
            },
            "TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Номер заявки, на основании которой заключена сделка"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки: B - Купля  S - Продажа  Для СВОП-заявок: B - Продажа/Купля S - Купля/Продажа"
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило: <код клиента>/<номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, совершивший сделку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой была совершена сделка"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма - котрагент сделки"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого заключена данная сделка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "PRICE",
                        "9",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "TRADETYPE",
                        "Тип",
                        "TTradeType",
                        "1",
                        "Тип сделки"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "COMMISSION",
                        "Комиссия суммарная",
                        "FIXED",
                        "16.2",
                        "Объем комиссии по сделке, руб."
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "PRICE",
                        "9",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGCENTERCOMM",
                        "Комиссия за клиринг",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения за клиринговые услуги, руб."
                    ],
                    [
                        "EXCHANGECOMM",
                        "Комиссия за торги",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения биржи, руб."
                    ],
                    [
                        "TRADINGSYSTEMCOMM",
                        "Комиссия за тех. доступ",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения Технического центра, руб."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "PRICE",
                        "9",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "PARENTTRADENO",
                        "Витринная сделка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер витринной сделки в Торговой Системе для сделок СВОП"
                    ],
                    [
                        "HIDDENQTYORDER",
                        "Сделка по айсберг-заявке",
                        "TYesNo",
                        "1",
                        "Принимает значение 'Y'/'N'. Поле содержит 'Y' если сделка была заключена на основании айсберг-заявки."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRADEDATE",
                        "Дата торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "CLEARINGBANKACCID",
                        "Клиринговый расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор клирингового расчетного счета в НКЦ"
                    ],
                    [
                        "MAKERFLAG",
                        "Активная/Пассивная",
                        "TMakerTaker",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "CPORDERNO",
                        "Встречная заявка внесистемной сделки",
                        "INTEGER",
                        "12",
                        "Идентификационный номер встречной заявки в Торговой Системе (только для сделок в внесистемном режиме)"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Сделка урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что сделка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTradeStatus",
                        "1",
                        "Статус сделки"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "CLEARINGTRDACCID",
                        "Клиринговый счет",
                        "CHAR",
                        "12",
                        "Номер клирингового счета"
                    ]
                ],
                "title": "Сделки (обновляемая)",
                "desc": "Таблица содержит информацию о сделках на покупку/продажу, заключенных Членом Секции (Членами Секции) с начала торговой сессии. Каждая сделка представлена в таблице одной строкой."
            },
            "TRADETIME": {
                "output": [
                    [
                        "TIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время наступления события"
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы финансовых инструментов, для которой определено событие"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима финансовых инструментов, для которого определено событие"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "TYPE",
                        "Событие",
                        "CHAR",
                        "2",
                        "Тип события. Все типы событий перечислены в таблице TRDTIMETYPES"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTimeStatus",
                        "1",
                        "Признак - наступило событие или еще нет"
                    ]
                ],
                "title": "Расписание торгов (обновляемая)",
                "desc": "Таблица содержит информацию о временных событиях, соответствующих изменению состояния торгов"
            },
            "TRANTYPES": {
                "output": [
                    [
                        "TYPE",
                        "Группа событий",
                        "CHAR",
                        "1",
                        "Группа событий"
                    ],
                    [
                        "NAME",
                        "Наименование группы",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий"
                    ],
                    [
                        "LATNAME",
                        "Английское наименование",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий на английском языке"
                    ]
                ],
                "title": "Типы переводов (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRANTYPE</td> <td>Код операции</td> <td>CHAR</td> <td align=right>4</td> <td>Информация об операции</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>255</td> <td>Описание типа перевода</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td> <td>Англ. Описание</td> <td>CHAR</td> <td align=right>255</td> <td>Описание типа перевода на английском языке</td> </tr> </table> </ul> <a name=\"t0_32\"></a> <h4>TRDACC - Торговые счета (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип депозитарного счета</td> <td> TDepAccType</td> <td align=right>1</td> <td>Тип депозитарного счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Код дополнительной позиции по денежным средствам</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TTrdAccStatus</td> <td align=right>1</td> <td>Индикатор \"торговые операции разрешены/запрещены\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td> <td>Тип торгового счета</td> <td>CHAR</td> <td align=right>1</td> <td>Тип торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTRDACCID</td> <td>Клиринговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер клирингового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td> <td>Клиринговая фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы - Участника Клиринга</td> </tr> </table> </ul> <a name=\"t0_33\"></a> <h4>TRDACCTYPES - Список типов торгово-клиринговых счетов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td> <td>Тип торгового счета</td> <td>CHAR</td> <td align=right>1</td> <td>Тип торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя</td> <td>CHAR</td> <td align=right>30</td> <td>Наименование типа</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATNAME</td> <td>Англ. наименование</td> <td>CHAR</td> <td align=right>30</td> <td>Наименование типа на английском языке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OWN</td> <td>Собственный счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLIENT</td> <td>Клиентский счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRUST</td> <td>Доверительное управление (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ISSUING</td> <td>Эмиссионный счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TREASURY</td> <td>Казначейский счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>128</td> <td>Описание типа</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td> <td>Англ. Описание</td> <td>CHAR</td> <td align=right>128</td> <td>Описание типа на английском языке</td> </tr> </table> </ul> <a name=\"t0_34\"></a> <h4>TRDTIMEGROUPS - Группы событий (не обновляемая)</h4> <ul> Группы событий используемых в расписании"
            },
            "TRDTIMETYPES": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для группы"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ]
                ],
                "title": "Типы событий расписания торгов (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип события</td> <td>CHAR</td> <td align=right>2</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>50</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GROUPTYPE</td> <td>Группа</td> <td>CHAR</td> <td align=right>1</td> <td>Тип группы событий</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LAT_DESCRIPTION</td> <td>Английский</td> <td>CHAR</td> <td align=right>50</td> <td>Описание на английском языке</td> </tr> </table> </ul> <a name=\"t0_36\"></a> <h4>USERGROUPS - Группы пользователей (обновляемая)</h4> <ul> Таблица содержит информацию о группах пользователей.",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ]
                ]
            },
            "USERS": {
                "output": [
                    [
                        "USERID",
                        "Код участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "USERNAME",
                        "Участник",
                        "CHAR",
                        "30",
                        "&nbsp;"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADING",
                        "Торговые/клиринговые операции",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\" управляющим фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "CODMODESUBSCR",
                        "COD-подписка",
                        "TCodMode",
                        "1",
                        "Тип подписки на COD-режим. COD-режим - Cancel on Disconnect - режим снятия заявок при потере соединения с ТС или при отключении от ТС. Доступные режимы: \"Не используется\", \"Всегда\" и \"По требованию\""
                    ],
                    [
                        "CODMODE",
                        "COD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Disconnect)."
                    ],
                    [
                        "MASTERUSER1",
                        "Мастер ID 1",
                        "CHAR",
                        "12",
                        "Первый Мастер User ID для SMA-доступа"
                    ],
                    [
                        "MASTERUSER2",
                        "Мастер ID 2",
                        "CHAR",
                        "12",
                        "Второй Мастер User ID для SMA-доступа"
                    ],
                    [
                        "CODMODE_DC",
                        "CODCD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Drop-Copy  Disconnect)."
                    ],
                    [
                        "MASTERUSERFLAG",
                        "Мастер",
                        "TYesNo",
                        "1",
                        "Идентификатор является контролирующим Мастер Идентификатором (SMA-доступ)"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для пользователя"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ],
                    [
                        "USERALIAS",
                        "Псевдоним участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "IPGATEWAY",
                        "Сервер доступа",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "IPCLIENT",
                        "Рабочая станция",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "LOGGEDON",
                        "Активен",
                        "TBoolInt",
                        "1",
                        "Индикатор информирующий, что пользователь в настоящий момент подключен системе"
                    ],
                    [
                        "EXTIPCLIENT",
                        "Внешний адрес",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ]
                ],
                "title": "Пользователи (обновляемая)",
                "desc": "Таблица содержит информацию о пользователях, в том числе технологических, выделенных для фирмы-участника торгов и/или клиринга. Каждый пользователь представлен в таблице одной строкой."
            },
            "USER_CLIENT": {
                "output": [
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Привязка пользователей к кодам клиентов (обновляемая)",
                "desc": "Привязка пользователей к кодам клиентов"
            },
            "USER_TRDACC": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ]
                ],
                "title": "Трейдер-счет (не обновляемая)",
                "desc": "Привязка идентификаторов пользователей к торговым счетам"
            },
            "U_BOARD_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Чёрный список режимов торгов (обновляемая)",
                "desc": "Cписок недоступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_BOARD_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Белый список режимов торгов (обновляемая)",
                "desc": "Список доступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_HOLD_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения позиции по бумагам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в ценных бумагах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_ORDER_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICEBOUNDUP",
                        "Отклонение цены вверх",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вверх (в процентах от текущей цены)"
                    ],
                    [
                        "PRICEBOUNDDOWN",
                        "Отклонение цены вниз",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вниз (в процентах от текущей цены)"
                    ],
                    [
                        "MAXQTY",
                        "Максимальное количество в заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в заявке"
                    ],
                    [
                        "MAXORDERVAL",
                        "Максимальный объем заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXMKTQTY",
                        "Максимальное количество в рыночной заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в рыночной заявке"
                    ],
                    [
                        "MAXMKTORDERVAL",
                        "Максимальный объем рыночной заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем рыночной заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXORDVALTODAY",
                        "Максимальная сумма заявок",
                        "FIXED",
                        "16.2",
                        "Максимальная сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "CURORDVALTODAY",
                        "Текущая сумма заявок",
                        "FIXED",
                        "16.2",
                        "Текущая сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения по заявкам (обновляемая)",
                "desc": "Ограничения пользователя по заявкам",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_POSN_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения позиции по деньгам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в деньгах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список недоступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список доступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (обновляемая)",
                "desc": "Список недоступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (обновляемая)",
                "desc": "Список доступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            }
        }
    },
    "output": [
        "Выходное поле",
        "Описание",
        "Тип",
        "Размер",
        "Примечание"
    ],
    "input": [
        "Входное поле",
        "Описание",
        "Тип",
        "Размер",
        "Примечание"
    ],
    "40": {
        "Equities": {
            "ALL_TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Процентный доход, выраженный в валюте расчетов"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки инициирующей заключение сделки - \"купля/продажа\""
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "FLOAT",
                        "17",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма / Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "FACEAMOUNT",
                        "Объем по номиналу",
                        "FIXED",
                        "16.2",
                        "Объем сделки по номиналу, выраженный в валюте номинала"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была заключена сделка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ]
                ],
                "title": "Все сделки (обновляемая)",
                "desc": "Таблица содержит общую информацию (без указания сторон по сделке) по всем сделкам купли/продажи финансовых инструментов, совершенным в Торговой Системе с начала торговой сессии"
            },
            "AUCTSTATS": {
                "output": [
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDTIME",
                        "Запланированное время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона (из расписания торгов)"
                    ],
                    [
                        "STARTTIME",
                        "Время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона"
                    ],
                    [
                        "ENDTIME",
                        "Время окончания аукциона",
                        "TIME",
                        "6",
                        "Время окончания аукциона"
                    ],
                    [
                        "AUCTPRICE",
                        "Цена аукциона",
                        "FLOAT",
                        "17",
                        "Цена аукциона. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона."
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем совершенных сделок аукциона, выраженный в валюте расчетов. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "VOLUME",
                        "Количество",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, в единицах ценных бумаг. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "NUMTRADES",
                        "Сделок",
                        "INTEGER",
                        "9",
                        "Количество заключенных сделок"
                    ],
                    [
                        "IMBALANCE",
                        "Дисбаланс",
                        "INTEGER",
                        "16",
                        "Суммарный объем заявок, которые остались бы неисполненными при завершении аукциона по ожидаемой цене"
                    ],
                    [
                        "MARKETVOLB",
                        "Рыночных на покупку",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на покупку по ожидаемой цене, в единицах ценных бумаг"
                    ],
                    [
                        "MARKETVOLS",
                        "Рыночных на продажу",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на продажу, в единицах ценных бумаг"
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявок на покупку (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку  на аукционе КП"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявок на продажу (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу  на аукционе КП"
                    ],
                    [
                        "DPORDERINDICATOR",
                        "Наличие спроса/предложения",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку или продажу на аукционе крупными лотами до данному финасовому инструменту"
                    ],
                    [
                        "MATDATE",
                        "Дата погашения",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "STATUS",
                        "Статус аукциона",
                        "TAuctStatus",
                        "1",
                        "Статус аукциона"
                    ]
                ],
                "title": "Результаты аукционов (обновляемая)",
                "desc": "Результаты аукционов"
            },
            "BANK": {
                "output": [
                    [
                        "URGENCY",
                        "Важность",
                        "TUrgency",
                        "1",
                        "Срочность или важность сообщения"
                    ],
                    [
                        "FROMUSER",
                        "От кого",
                        "CHAR",
                        "12",
                        "Идентификатор пользователя, отправившего сообщение"
                    ],
                    [
                        "MSGTIME",
                        "Время",
                        "CHAR",
                        "8",
                        "Время, когда было отправлено сообщение"
                    ],
                    [
                        "MSGTEXT",
                        "Текст",
                        "CHAR",
                        "256",
                        "Текст сообщения"
                    ]
                ],
                "title": "Расчетные организации (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKID</td> <td>Расчетная организация</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SHORTNAME</td> <td>Наименование</td> <td>CHAR</td> <td align=right>12</td> <td>Краткое наименование расчетной организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKNAME</td> <td>Полное наименование</td> <td>CHAR</td> <td align=right>120</td> <td>Полное наименование расчетной организации</td> </tr> </table> </ul> <a name=\"t0_3\"></a> <h4>BANKACC - Расчетные коды (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEFAULTER</td> <td>Принудительное закрытие</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TStatus</td> <td align=right>1</td> <td>Индикатор \"торговые/клиринговые операции разрешены/запрещены\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td> <td>Клиринговая фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы - Участника Клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGBANKACCID</td> <td>Клиринговый расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор клирингового расчетного счета в НКЦ</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DETAILS</td> <td>Реквизит 1</td> <td>CHAR</td> <td align=right>20</td> <td>Данные о клиенте (ИНН, номер паспорта или другой документ)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SUBDETAILS</td> <td>Реквизит 2</td> <td>CHAR</td> <td align=right>20</td> <td>Данные о клиенте клиента (ИНН, номер паспорта или другой документ)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCTYPE</td> <td>Тип</td> <td> TBankAccType</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GCPOOLID</td> <td>Идентификатор пула</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">UNIFIEDPOOL</td> <td>Единый пул</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLETIME</td> <td>Время ранних расчетов</td> <td>TIME</td> <td align=right>6</td> <td>Время ранних расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADINGCLOSEDTIME</td> <td>Время прекращения торгов</td> <td>TIME</td> <td align=right>6</td> <td>Время прекращения торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMBANKACCID</td> <td>Расчетный код для списания оборотной комиссии</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации для списания оборотной комиссии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CALC_PERCENT</td> <td>Учитывать процентный риск</td> <td> TYesNo</td> <td align=right>1</td> <td>Учитывать процентный риск</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGMODE</td> <td>Юридическая клиринговая модель</td> <td> TClearingMode</td> <td align=right>1</td> <td>Юридическая клиринговая модель</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CM_CONTROL_LEVEL3</td> <td>УК управляет 3-м ур.</td> <td> TYesNo</td> <td align=right>1</td> <td>Участник клиринга управляет третьим уровнем</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CM_DISCLOSE_CLIENTS</td> <td>Информация о клиентах УК</td> <td> TYesNo</td> <td align=right>1</td> <td>Раскрытие информации о клиентах Участнику клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PROTECTEDCLIENT</td> <td>Защита денежных средств</td> <td> TYesNo</td> <td align=right>1</td> <td>Защита денежных средств обособленного клиента</td> </tr> </table> </ul> <a name=\"t0_4\"></a> <h4>BCMESSAGES - Сообщения (обновляемая)</h4> <ul> Таблица содержит информацию о сообщениях, полученных от других участников торгов с момента начала торговой сессии"
            },
            "BENCHMARKS": {
                "output": [
                    [
                        "BOARDID",
                        "Код режима",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "BOARDNAME",
                        "Режим",
                        "CHAR",
                        "30",
                        "Наименование режима"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "CURRCODE",
                        "Валюта",
                        "CHAR",
                        "4",
                        "Код валюты"
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка, к которому относится данный режим"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование режима торгов на английском языке"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "Идентификатор бэнчмарка"
                    ]
                ],
                "title": "Бэнчмарки (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BENCHMARK</td> <td>Бенчмарк</td> <td>CHAR</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Название бенчмарка</td> <td>CHAR</td> <td align=right>128</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALUE</td> <td>Значение бенчмарка, %</td> <td>FLOAT</td> <td align=right>10</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_6\"></a> <h4>BOARDS - Режимы торгов (обновляемая)</h4> <ul> Таблица содержит информацию о режимах торгов. Под режимом понимается набор правил проведения торгов, определяющих допустимые типы заявок, регламент торгов, виды расчетов и пр. Каждый режим представлен в таблице одной строкой."
            },
            "CLIENTCODES": {
                "output": [
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "CLIENTTYPE",
                        "Тип",
                        "CHAR",
                        "2",
                        "Форма идентификации клиента"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "QINVESTOR",
                        "Квалифицированный инвестор",
                        "TYesNo",
                        "1",
                        "Квалифицированный инвестор"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние кода клиента"
                    ],
                    [
                        "CROSSTRADING",
                        "Кросс-сделки",
                        "TCrossTrading",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "BLOCKCLIENTTE",
                        "Блокировка торгов",
                        "TYesNo",
                        "1",
                        "Флаг блокировки доступа к торгам"
                    ]
                ],
                "title": "Клиенты брокера (обновляемая)",
                "desc": "Таблица \"Клиенты брокера\" содержит информацию о кодах клиентов, зарегистрированных в торговой системе ММВБ для данного брокера"
            },
            "COMPLEXPRODUCTTYPES": {
                "output": [
                    [
                        "ID",
                        "Сложный финансовый продукт",
                        "INTEGER",
                        "10",
                        "Тип сложного финансового продукта"
                    ],
                    [
                        "DESCRIPTION",
                        "Описание",
                        "CHAR",
                        "255",
                        "&nbsp;"
                    ]
                ],
                "title": "Cложный финансовый продукт (не обновляемая)",
                "desc": "Справочник типов сложных финансовых продуктов"
            },
            "CURRENCY": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDTIME",
                        "Запланированное время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона (из расписания торгов)"
                    ],
                    [
                        "STARTTIME",
                        "Время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона"
                    ],
                    [
                        "ENDTIME",
                        "Время окончания аукциона",
                        "TIME",
                        "6",
                        "Время окончания аукциона"
                    ],
                    [
                        "LCURRENTPRICE",
                        "Официальная текущая цена",
                        "FLOAT",
                        "17",
                        "Официальная текущая цена, рассчитываемая как средневзвешенная цена сделок заключенных за последние 10 минут, зафиксированная на момент начала ценового окна"
                    ],
                    [
                        "PRICEBOUNDUP",
                        "Максимальная допустимая цена аукциона",
                        "FLOAT",
                        "17",
                        "Максимальная допустимая цена аукциона  при выборе цены как одной из средних цен ценового окна"
                    ],
                    [
                        "PRICEBOUNDDOWN",
                        "Минимальная допустимая цена аукциона",
                        "FLOAT",
                        "17",
                        "Минимальная допустимая цена аукциона при выборе цены как одной из средних цен ценового окна"
                    ],
                    [
                        "AUCTPRICE",
                        "Цена аукциона",
                        "FLOAT",
                        "17",
                        "Цена аукциона"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем совершенных сделок аукциона, выраженный в валюте расчетов"
                    ],
                    [
                        "VOLUME",
                        "Количество",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "NUMTRADES",
                        "Сделок",
                        "INTEGER",
                        "9",
                        "Количество заключенных сделок"
                    ]
                ],
                "title": "Справочник валют (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRCODE</td> <td>Валюта</td> <td>CHAR</td> <td align=right>4</td> <td>Код валюты</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRENCYNAME</td> <td>Наименование</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CROSSRATE</td> <td>Курс</td> <td>FLOAT</td> <td align=right>17</td> <td>Курс в руб. за единицу валюты с плавающей точкой</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ASSET</td> <td>Актив</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_10\"></a> <h4>DPAUCTIONS - Аукционы крупных пакетов (DarkPool) (обновляемая)</h4> <ul> Результаты аукционов крупных пакетов (DarkPool)"
            },
            "EXT_MMSTATS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "MMID",
                        "ID записи",
                        "CHAR",
                        "12",
                        "Идентификатор записи маркет-мейкинга в ТС"
                    ],
                    [
                        "PARENTMMID",
                        "ID родительской записи",
                        "CHAR",
                        "12",
                        "Идентификатор родительской записи маркет-мейкинга в ТС"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "SCHEMANAME",
                        "Схема",
                        "CHAR",
                        "20",
                        "Наименование схемы маркет-мейкинга"
                    ],
                    [
                        "AGREEMENT",
                        "№ договора",
                        "CHAR",
                        "12",
                        "Идентификатор (номер) договора с маркет-мейкером"
                    ],
                    [
                        "AGREEMENTDATE",
                        "Дата договора",
                        "DATE",
                        "8",
                        "Дата подписания договора с маркет-мейкером"
                    ],
                    [
                        "MINSPREADVOLUMEBUY",
                        "МДО-Купля",
                        "INTEGER",
                        "16",
                        "Минимальный допустимый объем в лотах на покупку для маркет-мейкера"
                    ],
                    [
                        "MINSPREADVALUEBUY",
                        "МДО-Купля, руб.",
                        "FIXED",
                        "16.2",
                        "Минимальный допустимый объем в руб. на покупку для маркет-мейкера"
                    ],
                    [
                        "MINSPREADVOLUMESELL",
                        "МДО-Продажа",
                        "INTEGER",
                        "16",
                        "Минимальный допустимый объем в лотах на продажу для маркет-мейкера"
                    ],
                    [
                        "MINSPREADVALUESELL",
                        "МДО-Продажа, руб.",
                        "FIXED",
                        "16.2",
                        "Минимальный допустимый объем в руб. на продажу для маркет-мейкера"
                    ],
                    [
                        "MAXTRADESVOLUME",
                        "ДО",
                        "INTEGER",
                        "16",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на одностороннее или на освобождение от котирования, в лотах"
                    ],
                    [
                        "MAXTRADESVALUE",
                        "ДО, руб.",
                        "FIXED",
                        "16.2",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на одностороннее или на освобождение от котирования, руб."
                    ],
                    [
                        "MINPASSIVETRADESVALUE",
                        "Мин. пассив. объем, руб.",
                        "FIXED",
                        "16.2",
                        "Минимальный объем пассивных сделок, выраженный в руб."
                    ],
                    [
                        "MAXSPREADPERC",
                        "Макс. спрэд, %",
                        "FLOAT",
                        "8",
                        "Допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPERC1",
                        "Макс. спрэд-Купля, %",
                        "FLOAT",
                        "8",
                        "Предельное отклонение цены заявки на покупку от расчетной цены"
                    ],
                    [
                        "MAXSPREADPERC2",
                        "Макс. спрэд-Продажа, %",
                        "FLOAT",
                        "8",
                        "Предельное отклонение цены заявки на продажу от расчетной цены"
                    ],
                    [
                        "MAXSPREADPRICE",
                        "Макс. спрэд",
                        "FLOAT",
                        "17",
                        "Допустимый коридор колебания цены в руб."
                    ],
                    [
                        "MINKEEPTIME",
                        "Мин. время поддерж.",
                        "TIME",
                        "6",
                        "Минимальное время поддержания"
                    ],
                    [
                        "MINKEEPPERCENT",
                        "Мин. % исполнения",
                        "FIXED",
                        "9.2",
                        "Минимальный процент исполнения"
                    ],
                    [
                        "CURRENTSPREADPERC",
                        "Спрэд, %",
                        "FLOAT",
                        "8",
                        "Величина текущего спрэда маркет-мейкера в процентах"
                    ],
                    [
                        "CURRENTSPREADPERC1",
                        "Спрэд-Купля, %",
                        "FLOAT",
                        "8",
                        "Отклонение цены заявки на покупку от текущей цены"
                    ],
                    [
                        "CURRENTSPREADPERC2",
                        "Спрэд-Продажа, %",
                        "FLOAT",
                        "8",
                        "Отклонение цены заявки на продажу от текущей цены"
                    ],
                    [
                        "CURRENTSPREADPRICE",
                        "Спрэд",
                        "FLOAT",
                        "17",
                        "Величина текущего спрэда маркет-мейкера в руб."
                    ],
                    [
                        "CURRENTMINBUYPRICE",
                        "Лучшая цена покупки",
                        "FLOAT",
                        "17",
                        "Лучшая цена активной лимитированной заявки на покупку"
                    ],
                    [
                        "CURRENTMAXSELLPRICE",
                        "Лучшая цена продажи",
                        "FLOAT",
                        "17",
                        "Лучшая цена активной лимитированной заявки на продажу"
                    ],
                    [
                        "TOTALBUYVOLUME",
                        "Купля",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на покупку, выраженный в лотах"
                    ],
                    [
                        "TOTALSELLVOLUME",
                        "Продажа",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на продажу, выраженный в лотах"
                    ],
                    [
                        "PUBLICPRICE",
                        "Текущая цена",
                        "FLOAT",
                        "17",
                        "Текущая расчетная цена"
                    ],
                    [
                        "TOTALBREACHTIME",
                        "Время перерыва",
                        "TIME",
                        "6",
                        "Общее время нарушения маркет-мейкером своих обязательств по поддержке котировок"
                    ],
                    [
                        "TOTALKEEPTIME",
                        "Время поддерж.",
                        "TIME",
                        "6",
                        "Общее время выполнения обязательств по МДО и спрэду"
                    ],
                    [
                        "TOTALKEEPTIME1",
                        "Время поддерж.-Купля",
                        "TIME",
                        "6",
                        "Фактическое время поддержания заявок на покупку"
                    ],
                    [
                        "TOTALKEEPTIME2",
                        "Время поддерж.-Продажа",
                        "TIME",
                        "6",
                        "Фактическое время поддержания заявок на продажу"
                    ],
                    [
                        "FACTTRADESVOLUME",
                        "Объем",
                        "INTEGER",
                        "16",
                        "Текущий объем заключенных сделок, в лотах"
                    ],
                    [
                        "FACTTRADESVALUE",
                        "Объем, руб.",
                        "FIXED",
                        "16.2",
                        "Текущий объем заключенных сделок, в руб."
                    ],
                    [
                        "FACTPASSIVETRADESVOLUME",
                        "Пассивное количество",
                        "INTEGER",
                        "16",
                        "Текущий объем заключенных пассивных сделок, в лотах"
                    ],
                    [
                        "FACTPASSIVETRADESVALUE",
                        "Пассивный объем, руб.",
                        "FIXED",
                        "16.2",
                        "Текущий объем заключенных пассивных сделок, в руб."
                    ],
                    [
                        "QUOTETYPE",
                        "Котирование",
                        "TMMQuoteType",
                        "1",
                        "Тип котирования в текущий момент (двухстороннее, одностороннее или не требуется)"
                    ],
                    [
                        "FACTKEEPPERCENT",
                        "% исполнения",
                        "FIXED",
                        "9.2",
                        "&nbsp;"
                    ],
                    [
                        "FACTKEEPPERCENT1",
                        "% исп.-Купля",
                        "FIXED",
                        "9.2",
                        "Процент исполнения на покупку"
                    ],
                    [
                        "FACTKEEPPERCENT2",
                        "% исп.-Продажа",
                        "FIXED",
                        "9.2",
                        "Процент исполнения на продажу"
                    ],
                    [
                        "LEFTKEEPTIME",
                        "Оставшееся время до исполнения",
                        "TIME",
                        "6",
                        "Оставшееся время до исполнения обязательств"
                    ],
                    [
                        "UPDATETIME",
                        "Время обновления",
                        "TIME",
                        "6",
                        "Время обновления"
                    ],
                    [
                        "PROCESSED",
                        "Обязат. исполн.",
                        "TYesNo",
                        "1",
                        "Обязательства исполнены"
                    ],
                    [
                        "INDICATOR1",
                        "Фикс. ставка РЕПО ЦБ ON, %",
                        "FLOAT",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "INDICATOR2",
                        "Ставка RuRepo ON, %",
                        "FLOAT",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "INDICATOR3",
                        "Ставка MosPrime ON, %",
                        "FLOAT",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "MINSHAREISSUES",
                        "Мин. обяз. кол-во выпусков",
                        "INTEGER",
                        "4",
                        "Минимальное обязательство по количеству выпусков ценных бумаг"
                    ],
                    [
                        "COMPLETESHAREISSUES",
                        "Выполн. по кол-ву выпусков",
                        "INTEGER",
                        "4",
                        "Выполнено по количеству выпусков ценных бумаг"
                    ]
                ],
                "title": "Обязательства маркет-мейкера (обновляемая)",
                "desc": "В таблице представлена информация по выполнению маркет-мейкером его обязательств"
            },
            "EXT_ORDERBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена котировки"
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки. Используется только в отдельных видах аукционов. В остальных случаях заполняется пробелами."
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность по цене котировки"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Суммарный объем котировок РЕПО по данной ставке, выраженный в валюте расчетов. Для инструментов обычных режимов значение не вычисляется."
                    ]
                ],
                "title": "Котировки по инструменту (обновляемая, очищать при обновлении)",
                "desc": "Расширенный вариант таблицы котировок. Таблица содержит информацию о заявках с лучшими ценами и временем активации (отдельно на покупку и на продажу) по финансовому инструменту. Каждая строка таблицы соответствует уникальной паре значений времени активации и цены для финансового инструмента и отражает суммарное количество лотов, выставленных на покупку или продажу по этой цене с данным временем активации.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "DEPTH",
                        "Глубина котировок",
                        "INTEGER",
                        "2",
                        "Запрашиваемое количество лучших котировок на покупку/продажу по инструменту. Для получения всех котировок значение не указывается."
                    ]
                ]
            },
            "FIRMS": {
                "output": [
                    [
                        "FIRMID",
                        "Код фирмы",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "FIRMNAME",
                        "Фирма",
                        "CHAR",
                        "30",
                        "Краткое наименование фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "EXCHANGE",
                        "Биржа",
                        "CHAR",
                        "4",
                        "Идентификатор региональной биржи"
                    ],
                    [
                        "INN",
                        "ИНН",
                        "CHAR",
                        "12",
                        "Индивидуальный номер налогоплательщика"
                    ],
                    [
                        "INLIQUIDATION",
                        "Ликвидационный неттинг",
                        "TYesNo",
                        "1",
                        "В отношении фирмы инициирован ликвидационный неттинг"
                    ],
                    [
                        "CLEARINGACCESS",
                        "Доступ к клирингу",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "TRADINGACCESS",
                        "Доступ к торгам",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "EVENINGSESSION",
                        "Доступность в дополнительной сессии",
                        "TYesNo",
                        "1",
                        "Флаг допуска фирмы для торгов в дополнительной сессии"
                    ]
                ],
                "title": "Фирмы (обновляемая)",
                "desc": "Данная таблица содержит информацию о фирмах-участниках торгов. Каждая фирма представлена одной строкой таблицы."
            },
            "INDEXES": {
                "output": [
                    [
                        "INDEXBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для ценных бумаг, участвующих в расчете индекса"
                    ],
                    [
                        "INDEXCODE",
                        "Код индекса",
                        "CHAR",
                        "12",
                        "Идентификатор биржевого индекса"
                    ],
                    [
                        "NAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса"
                    ],
                    [
                        "SHORTNAME",
                        "Индекс",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "CURRENTVALUE",
                        "Текущий",
                        "FLOAT",
                        "17",
                        "Текущее значение индекса"
                    ],
                    [
                        "LASTVALUE",
                        "Закрытие",
                        "FLOAT",
                        "17",
                        "Последнее значение индекса предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части цены ценной бумаги или производных значений от цены"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса на английском языке"
                    ],
                    [
                        "TIME",
                        "Время вычисления",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "OPENVALUE",
                        "Открытие",
                        "FLOAT",
                        "17",
                        "Значение индекса на открытие текущего торгового дня"
                    ],
                    [
                        "VALTODAY",
                        "Объем торгов",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок по бумагам, входящим в индекс, выраженный в руб."
                    ],
                    [
                        "MIN",
                        "Минимум",
                        "FLOAT",
                        "17",
                        "Минимальное значение индекса"
                    ],
                    [
                        "MAX",
                        "Максимум",
                        "FLOAT",
                        "17",
                        "Максимальное значение индекса"
                    ],
                    [
                        "INDEXCROSSRATE",
                        "Курс",
                        "FIXED",
                        "9.4",
                        "Курс валюты индекса"
                    ]
                ],
                "title": "Индексы (обновляемая)",
                "desc": "Каждая строка таблицы представляет один из индексов ММВБ, рассчитываемых для этого рынка"
            },
            "INSTRUMENTS": {
                "output": [
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "INSTRNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование группы инструментов"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "INSTRTYPE",
                        "Тип инструмента",
                        "TInstrType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "QUOTEBASIS",
                        "Тип цены",
                        "TQuoteBasis",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Группы ценных бумаг (обновляемая)",
                "desc": "Таблица содержит информацию о группах однотипных ценных бумаг (например: Акции (1 уровень), Акции (2 уровень), Внесписочные акции и т.д.) Каждая группа ценных бумаг представлена в таблице одной строкой."
            },
            "MARKETS": {
                "output": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "MARKETNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка на английском языке"
                    ]
                ],
                "title": "Рынки (обновляемая)",
                "desc": "Таблица содержит информацию о рынках. Под рынком понимается группа режимов торгов, объединенных по административным признакам (ГЦБ, НГЦБ, РПС)."
            },
            "NEGDEALBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена котировки"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ],
                "title": "Котировки адресных заявок *Всем (обновляемая, очищать при обновлении)",
                "desc": "Таблица содержит информацию об адресных заявках с лучшими ценами (отдельно на покупку и на продажу) по финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ]
                ]
            },
            "NEGDEALS": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию адресной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных адресных заявок"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность по цене заявки"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Процентный доход, выраженный в валюте расчетов"
                    ],
                    [
                        "QUOTENO",
                        "Встречная заявка",
                        "INTEGER",
                        "12",
                        "Номер встречной безадресной заявки, 0 - если заявки нет"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "FLOAT",
                        "17",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "REFUNDRATE",
                        "Возмещение, %",
                        "FIXED",
                        "9.2",
                        "Ставка фиксированного возмещения, выплачиваемого в случае неисполнения второй части РЕПО, в процентах"
                    ],
                    [
                        "REPOENTRY",
                        "Тип ввода заявки РЕПО",
                        "TRepoEntry",
                        "1",
                        "Тип ввода заявки РЕПО"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма / Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "FLOAT",
                        "17",
                        "Начальный дисконт, в процентах"
                    ],
                    [
                        "LOWERDISCOUNT",
                        "Нижний предел дисконта, %",
                        "FLOAT",
                        "17",
                        "Нижнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "UPPERDISCOUNT",
                        "Верхний предел дисконта, %",
                        "FLOAT",
                        "17",
                        "Верхнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "BLOCKSECURITIES",
                        "Блокировать обеспечение",
                        "TYesNo",
                        "1",
                        "Признак блокировки финансового инструмента на специальном счете на время операции РЕПО"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "ORIGINREPOVALUE",
                        "Сумма РЕПО, указанная пользователем",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, значение Суммы РЕПО. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINQUANTITY",
                        "Кол-во лотов, указанное пользователем",
                        "INTEGER",
                        "16",
                        "Первоначальное, указанное при регистрации, количество бумаг (в стандартных лотах). Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINDISCOUNT",
                        "Дисконт, указанный пользователем",
                        "FLOAT",
                        "17",
                        "Первоначальное, указанное при регистрации, значение дисконта. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ENTRYDATE",
                        "Дата регистрации",
                        "DATE",
                        "8",
                        "Дата регистрации заявки"
                    ],
                    [
                        "ACTIVATIONDATE",
                        "Дата активации",
                        "DATE",
                        "8",
                        "Дата активации заявки - дата, при наступлении которой возможно заключение сделки(ок) на основании данной заявки. До наступления даты активации поданные по инструменту заявки накапливаются в торговой системе и имеют статус T."
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "ORIGINVALUE",
                        "Сумма денежных средств",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, количество денежных средств (только при вводе адресной заявки без указания количества лотов)."
                    ],
                    [
                        "NEGDEALENTRY",
                        "Тип ввода адресной заявки",
                        "TNegdealEntry",
                        "1",
                        "Тип ввода адресной заявки: с указанием количество лотов или суммы денежных средств"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "PARENTTRADENO",
                        "№ породившей сделки",
                        "INTEGER",
                        "12",
                        "Идентификационный номер породившей сделки в Торговой Системе"
                    ]
                ],
                "title": "Адресные заявки (обновляемая)",
                "desc": "Таблица содержит информацию об адресных заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала торговой сессии, для регистрации адресных сделок. Каждая адресная заявка представлена в таблице одной строкой."
            },
            "ONENEGDEAL": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию адресной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных адресных заявок"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность по цене заявки"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Процентный доход, выраженный в валюте расчетов"
                    ],
                    [
                        "QUOTENO",
                        "Встречная заявка",
                        "INTEGER",
                        "12",
                        "Номер встречной безадресной заявки, 0 - если заявки нет"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "FLOAT",
                        "17",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "REFUNDRATE",
                        "Возмещение, %",
                        "FIXED",
                        "9.2",
                        "Ставка фиксированного возмещения, выплачиваемого в случае неисполнения второй части РЕПО, в процентах"
                    ],
                    [
                        "REPOENTRY",
                        "Тип ввода заявки РЕПО",
                        "TRepoEntry",
                        "1",
                        "Тип ввода заявки РЕПО"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "FLOAT",
                        "17",
                        "Начальный дисконт, в процентах"
                    ],
                    [
                        "LOWERDISCOUNT",
                        "Нижний предел дисконта, %",
                        "FLOAT",
                        "17",
                        "Нижнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "UPPERDISCOUNT",
                        "Верхний предел дисконта, %",
                        "FLOAT",
                        "17",
                        "Верхнее предельное значение дисконта, в процентах"
                    ],
                    [
                        "BLOCKSECURITIES",
                        "Блокировать обеспечение",
                        "TYesNo",
                        "1",
                        "Признак блокировки финансового инструмента на специальном счете на время операции РЕПО"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "ORIGINREPOVALUE",
                        "Сумма РЕПО, указанная пользователем",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, значение Суммы РЕПО. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINQUANTITY",
                        "Кол-во лотов, указанное пользователем",
                        "INTEGER",
                        "16",
                        "Первоначальное, указанное при регистрации, количество бумаг (в стандартных лотах). Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ORIGINDISCOUNT",
                        "Дисконт, указанный пользователем",
                        "FLOAT",
                        "17",
                        "Первоначальное, указанное при регистрации, значение дисконта. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто."
                    ],
                    [
                        "ENTRYDATE",
                        "Дата регистрации",
                        "DATE",
                        "8",
                        "Дата регистрации заявки"
                    ],
                    [
                        "ACTIVATIONDATE",
                        "Дата активации",
                        "DATE",
                        "8",
                        "Дата активации заявки - дата, при наступлении которой возможно заключение сделки(ок) на основании данной заявки. До наступления даты активации поданные по инструменту заявки накапливаются в торговой системе и имеют статус T."
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "ORIGINVALUE",
                        "Сумма денежных средств",
                        "FIXED",
                        "16.2",
                        "Первоначальное, указанное при регистрации, количество денежных средств (только при вводе адресной заявки без указания количества лотов)."
                    ],
                    [
                        "NEGDEALENTRY",
                        "Тип ввода адресной заявки",
                        "TNegdealEntry",
                        "1",
                        "Тип ввода адресной заявки: с указанием количество лотов или суммы денежных средств"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "PARENTTRADENO",
                        "№ породившей сделки",
                        "INTEGER",
                        "12",
                        "Идентификационный номер породившей сделки в Торговой Системе"
                    ]
                ],
                "title": "Информация по адресной заявке (обновляемая)",
                "desc": "Таблица состоит из одной строки и содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ONEORDER": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по цене",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным ценам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, подавшего заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Накопленный купонный доход, рассчитанный для указанного в заявке количества ценных бумаг, выраженный в валюте расчетов"
                    ],
                    [
                        "ENTRYTYPE",
                        "Введено по",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения цены заявки - \"по цене/по доходности/по средневзвешенной цене\""
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене заявки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "MARKETMAKER",
                        "Маркет-мейкер",
                        "TYesNo",
                        "1",
                        "Заявка маркет-мейкера"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "REPOFLAG",
                        "Заявка РЕПО",
                        "TRepoFlag",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VALUEENTRYTYPE",
                        "Тип по объему",
                        "TValueEntryType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "ACTIVATIONTYPE",
                        "Тип события активации заявки",
                        "TOrderActivationType",
                        "1",
                        "Указывается при посылке заявки с активацией по наступлению специфицированного события. Доступный тип значения на данный момент \"C\" - заявка в Аукцион закрытия."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "STABORDER",
                        "Поддержание цены",
                        "TYesNo",
                        "1",
                        "Заявка, поданная в целях поддержания цен/Стабилизационная заявка"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "FLOAT",
                        "17",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "VISIBILITYFACTOR",
                        "Видимая часть",
                        "FIXED",
                        "5.2",
                        "Видимая часть в общей сумме заявки в %"
                    ],
                    [
                        "REPO2VALUE",
                        "Стоимость выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Объем сделки выкупа РЕПО, выраженный в валюте расчетов"
                    ],
                    [
                        "VISIBLEREPOVALUE",
                        "Сумма РЕПО видимой части",
                        "FIXED",
                        "16.2",
                        "Видимый остаток суммы РЕПО"
                    ],
                    [
                        "LIQUIDITYTYPE",
                        "Тип ликвидности",
                        "TExtIntType",
                        "1",
                        "Модификатор типа заявки - \"котировка/внутренняя ликвидность\""
                    ],
                    [
                        "PREMATCHEDBALANCE",
                        "Предварительно заблокировано",
                        "INTEGER",
                        "16",
                        "Cуммарный объем лотов в pre-matched сделках"
                    ]
                ],
                "title": "Информация по заявке (обновляемая)",
                "desc": "Таблица содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ORDERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по цене",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным ценам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, подавшего заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Накопленный купонный доход, рассчитанный для указанного в заявке количества ценных бумаг, выраженный в валюте расчетов"
                    ],
                    [
                        "ENTRYTYPE",
                        "Введено по",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения цены заявки - \"по цене/по доходности/по средневзвешенной цене\""
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене заявки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "ACTIVATIONTIME",
                        "Время активации",
                        "TIME",
                        "6",
                        "Время активации заявки"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "MARKETMAKER",
                        "Маркет-мейкер",
                        "TYesNo",
                        "1",
                        "Заявка маркет-мейкера"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "REPOFLAG",
                        "Заявка РЕПО",
                        "TRepoFlag",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPOVALUEBALANCE",
                        "Остаток суммы РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток суммы РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств в неисполненной части заявки, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VALUEENTRYTYPE",
                        "Тип по объему",
                        "TValueEntryType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "ACTIVATIONTYPE",
                        "Тип события активации заявки",
                        "TOrderActivationType",
                        "1",
                        "Указывается при посылке заявки с активацией по наступлению специфицированного события. Доступный тип значения на данный момент \"C\" - заявка в Аукцион закрытия."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "STABORDER",
                        "Поддержание цены",
                        "TYesNo",
                        "1",
                        "Заявка, поданная в целях поддержания цен/Стабилизационная заявка"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "FLOAT",
                        "17",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ],
                    [
                        "VISIBILITYFACTOR",
                        "Видимая часть, %",
                        "FIXED",
                        "5.2",
                        "Видимая часть в общей сумме заявки в %"
                    ],
                    [
                        "REPO2VALUE",
                        "Стоимость выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Объем сделки выкупа РЕПО, выраженный в валюте расчетов"
                    ],
                    [
                        "VISIBLEREPOVALUE",
                        "Сумма  РЕПО видимой части",
                        "FIXED",
                        "16.2",
                        "Видимый остаток суммы РЕПО"
                    ],
                    [
                        "LIQUIDITYTYPE",
                        "Тип ликвидности",
                        "TExtIntType",
                        "1",
                        "Модификатор типа заявки - \"котировка/внутренняя ликвидность\""
                    ],
                    [
                        "PREMATCHEDBALANCE",
                        "Предварительно заблокировано",
                        "INTEGER",
                        "16",
                        "Cуммарный объем лотов в pre-matched сделках"
                    ]
                ],
                "title": "Заявки (обновляемая)",
                "desc": "Таблица содержит информацию о заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "PRICEMOVELIMIT": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Ценовые границы (не обновляемая)",
                "desc": "<table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Входное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DISCOUNT</td> <td>Дисконт</td> <td>FLOAT</td> <td align=right>17</td> <td>Дисконт в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTERM</td> <td>Срок РЕПО</td> <td>INTEGER</td> <td align=right>4</td> <td>Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно.</td> </tr> </table>",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "UPPERLIMIT",
                        "Верхняя граница",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "LOWERLIMIT",
                        "Нижняя граница",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ]
                ]
            },
            "QUOTES": {
                "output": [
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "FLOAT",
                        "17",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ]
                ],
                "title": "Безадресные заявки для РПС (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUOTENO</td> <td>Заявка №</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер заявки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUOTETIME</td> <td>Время</td> <td>TIME</td> <td align=right>6</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TOrderStatus</td> <td align=right>1</td> <td>Статус заявки на регистрацию безадресной сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BUYSELL</td> <td>К/П</td> <td> TBuySell</td> <td align=right>1</td> <td>Направленность заявки - \"купля/продажа\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">USERID</td> <td>Участник</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE</td> <td>Цена</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена за одну ценную бумагу</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUANTITY</td> <td>Лоты</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORATE</td> <td>Ставка РЕПО, %</td> <td>FLOAT</td> <td align=right>17</td> <td>Ставка РЕПО, в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE2</td> <td>Цена выкупа</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена выкупа второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTREF</td> <td>Код внешнего пользователя</td> <td>CHAR</td> <td align=right>12</td> <td>Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PERIOD</td> <td>Период</td> <td> TPeriod</td> <td align=right>1</td> <td>Период торговой сессии, когда была подана заявка</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOVALUE</td> <td>Сумма РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTERM</td> <td>Срок РЕПО</td> <td>INTEGER</td> <td align=right>4</td> <td>Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPO2VALUEBALANCE</td> <td>Остаток стоимости выкупа РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DISCOUNT</td> <td>Начальный дисконт, %</td> <td>FLOAT</td> <td align=right>17</td> <td>Дисконт при заключении сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOENTRY</td> <td>Тип ввода заявки РЕПО</td> <td> TRepoEntry</td> <td align=right>1</td> <td>Тип ввода заявки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORIGINREPOVALUE</td> <td>Сумма РЕПО, указанная пользователем</td> <td>FIXED</td> <td align=right>16.2</td> <td>Первоначальное, указанное при регистрации, значение Суммы РЕПО. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORIGINQUANTITY</td> <td>Кол-во лотов, указанное пользователем</td> <td>INTEGER</td> <td align=right>16</td> <td>Первоначальное, указанное при регистрации, количество бумаг (в стандартных лотах). Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORIGINDISCOUNT</td> <td>Дисконт, указанный пользователем</td> <td>FLOAT</td> <td align=right>17</td> <td>Первоначальное, указанное при регистрации, значение дисконта. Только для заявок модифицированного РЕПО, для других заявок (или если значение не было указано) - пусто.</td> </tr> </table> </ul> <a name=\"t0_25\"></a> <h4>REPORTS - Отчеты на исполнение (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTNO</td> <td>Отчет №</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTDATE</td> <td>Дата</td> <td>DATE</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTTIME</td> <td>Время</td> <td>TIME</td> <td align=right>6</td> <td>Время регистрации отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">USERID</td> <td>Участник</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы-отправителя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета фирмы-отправителя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPFIRMID</td> <td>Партнер</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы-получателя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPTRDACCID</td> <td>Торговый счет партнера</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета фирмы-получателя отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUANTITY</td> <td>Лоты</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALUE</td> <td>Сумма</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем сделки, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TReportStatus</td> <td align=right>1</td> <td>Состояние отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMISSION</td> <td>Комиссия</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем комиссии по сделке, руб.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">WITHDRAWTIME</td> <td>Время снятия</td> <td>TIME</td> <td align=right>6</td> <td>Время снятия отчета в торговой системе</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTTYPE</td> <td>Тип отчета</td> <td> TReportType</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTKIND</td> <td>Вид отчета</td> <td> TReportKind</td> <td align=right>1</td> <td>Вид отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NUMTRADES</td> <td>Количество сделок</td> <td>INTEGER</td> <td align=right>4</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMPVAL</td> <td>Сумма отступного</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма отступного, в валюте сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMPBS</td> <td>Отступной</td> <td> TCompensation</td> <td align=right>1</td> <td>Направленность отступного</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ACCURATE</td> <td>Точная проверка</td> <td> TYesNo</td> <td align=right>1</td> <td>Режим точной проверки</td> </tr> </table> </ul> <a name=\"t0_26\"></a> <h4>REPO_NEGDEALBOOK - Котировки адресных заявок РЕПО *Всем (обновляемая, очищать при обновлении)</h4> <ul> Таблица содержит информацию о заявках с лучшими ставками РЕПО (отдельно на покупку и на продажу) по данному финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ]
                ]
            },
            "REPO_QUOTEBOOK": {
                "output": [
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "QUOTENO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Номер безадресной заявки"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена котировки"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "FLOAT",
                        "17",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "DISCOUNT",
                        "Дисконт",
                        "FLOAT",
                        "17",
                        "Дисконт в процентах"
                    ]
                ],
                "title": "Котировки безадресных заявок РЕПО (обновляемая, очищать при обновлении)",
                "desc": "Таблица содержит информацию о заявках с лучшими ставками РЕПО (отдельно на покупку и на продажу) по данному финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "MINREPOTERM",
                        "Минимальный срок РЕПО",
                        "INTEGER",
                        "4",
                        "Минимальный срок РЕПО в календарных днях или пусто"
                    ],
                    [
                        "MAXREPOTERM",
                        "Максимальный срок РЕПО",
                        "INTEGER",
                        "4",
                        "Максимальный срок РЕПО в календарных днях или пусто"
                    ],
                    [
                        "MINREPORATE",
                        "Минимальная ставка РЕПО",
                        "FLOAT",
                        "17",
                        "Минимальная ставка РЕПО, в процентах, или пусто"
                    ],
                    [
                        "MAXREPORATE",
                        "Максимальная ставка РЕПО",
                        "FLOAT",
                        "17",
                        "Максимальная ставка РЕПО, в процентах, или пусто"
                    ]
                ]
            },
            "RM_PRICERANGE": {
                "output": [
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "NUM",
                        "Диапазон",
                        "INTEGER",
                        "1",
                        "Номер диапазона"
                    ],
                    [
                        "LIMITBEGIN",
                        "Начало диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND",
                        "Конец диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "RTL_RUB",
                        "Нижняя граница, руб.",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "RTH_RUB",
                        "Верхняя граница, руб.",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "LIMITBEGIN_RUB",
                        "Начало диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND_RUB",
                        "Конец диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_L",
                        "Ставка риска падения цены, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_H",
                        "Ставка риска роста цены, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "RCRUB",
                        "Расчетная цена, руб.",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "CHANGETIME",
                        "Время изменения ставок риска",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ]
                ],
                "title": "Параметры рыночных рисков (обновляемая)",
                "desc": "Общие параметры рыночных рисков"
            },
            "SECACCINT": {
                "output": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "CURRCODE",
                        "Валюта",
                        "CHAR",
                        "4",
                        "Код валюты"
                    ],
                    [
                        "STARTDATE",
                        "Начальная дата",
                        "DATE",
                        "8",
                        "Начальная дата интервала"
                    ],
                    [
                        "DAYNO",
                        "Кол-во дней",
                        "INTEGER",
                        "3",
                        "Смещение относительно даты начала интервала, в днях"
                    ],
                    [
                        "ACCINT",
                        "Объем НКД",
                        "FLOAT",
                        "17",
                        "Процентный доход"
                    ],
                    [
                        "FACEVALUE",
                        "Номинал",
                        "FLOAT",
                        "17",
                        "Номинальная стоимость одной ценной бумаги, в валюте инструмента"
                    ]
                ],
                "title": "Процентный доход (не обновляемая)",
                "desc": "По данному запросу Торговая система предоставляет информацию о значениях НКД за запрошенный интервал времени для заданного финансового инструмента. Максимально допустимое количество значений НКД, получаемых по запросу для одного финансового инструмента равно 180 дням, т.е. нельзя получить за один запрос больше чем 180 значений НКД для одной ценной бумаги. Если значение конечной даты интервала (ENDDATE) выходит за эти границы или значение не указано, то будет присылаться максимально допустимое количество значений НКД.",
                "input": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента, если не указан, то запрашивается информация по всем финансовым инструментам"
                    ],
                    [
                        "CURRCODE",
                        "Валюта",
                        "CHAR",
                        "4",
                        "Код валюты"
                    ],
                    [
                        "STARTDATE",
                        "Начальная дата",
                        "DATE",
                        "8",
                        "Начальная дата интервала, если значение не указано, то в качестве начальной даты используется текущая дата торгов"
                    ],
                    [
                        "ENDDATE",
                        "Конечная дата",
                        "DATE",
                        "8",
                        "Конечная дата интервала"
                    ],
                    [
                        "FACEUNITFLAG",
                        "НКД в валюте номинала",
                        "TYesNo",
                        "1",
                        "Процентный доход в валюте номинала"
                    ]
                ]
            },
            "SECTRANSFERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки на перевод в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки на перевод в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки на перевод"
                    ],
                    [
                        "BUYSELL",
                        "З/С",
                        "TSecTransferBuySell",
                        "1",
                        "Направленность перевода: \"покупка\" - зачисление на счет,  \"продажа\" - списание со счета."
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, подавшего заявку на перевод"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой подана заявка на перевод"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, которой адресована заявка на перевод"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг, выраженное в лотах"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных переводов"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем перевода, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "WITHDRAWTIME",
                        "Время снятия",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была зарегистрирована заявка"
                    ]
                ],
                "title": "Заявки на перевод (обновляемая)",
                "desc": "Таблица содержит текущую информацию о заявках на перевод ценных бумаг или денег, поданных Членом Секции в Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "SECTYPE": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Код инструмента",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SECNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента"
                    ],
                    [
                        "REMARKS",
                        "Примечание",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "SHORTNAME",
                        "Инструмент",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TSecStatus",
                        "1",
                        "Индикатор \"торговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADINGSTATUS",
                        "Состояние",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту"
                    ],
                    [
                        "MARKETCODE",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка на котором торгуется финансовый инструмент"
                    ],
                    [
                        "INSTRID",
                        "Группа инструментов",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "LOTSIZE",
                        "Размер лота",
                        "INTEGER",
                        "8",
                        "Количество ценных бумаг в одном стандартном лоте"
                    ],
                    [
                        "MINSTEP",
                        "Мин. шаг цены заявки",
                        "FLOAT",
                        "17",
                        "Минимально возможная разница между ценами, указанными в заявках на покупку/продажу ценных бумаг"
                    ],
                    [
                        "FACEVALUE",
                        "Номинал",
                        "FLOAT",
                        "17",
                        "Номинальная стоимость одной ценной бумаги на текущую дату, в валюте инструмента"
                    ],
                    [
                        "FACEUNIT",
                        "Валюта номинала",
                        "CHAR",
                        "4",
                        "Код валюты, в которой выражен номинал ценной бумаги"
                    ],
                    [
                        "PREVDATE",
                        "Дата последних торгов",
                        "DATE",
                        "8",
                        "Дата предыдущего торгового дня"
                    ],
                    [
                        "PREVPRICE",
                        "Последняя предыдущего дня",
                        "FLOAT",
                        "17",
                        "Цена последней сделки предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части цены ценной бумаги или производных значений от цены"
                    ],
                    [
                        "YIELD",
                        "Доходность по последней",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "ACCRUEDINT",
                        "НКД",
                        "FLOAT",
                        "17",
                        "Накопленный купонный доход на дату расчетов в расчете на одну бумагу, выраженный в валюте расчетов"
                    ],
                    [
                        "PRIMARYDIST",
                        "Размещение",
                        "TYesNo",
                        "1",
                        "Индикатор информирующий, что по данному инструменту проводится аукцион"
                    ],
                    [
                        "MATDATE",
                        "Дата погашения",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "COUPONVALUE",
                        "Величина купона",
                        "FIXED",
                        "13.2",
                        "Величина купона, выраженная в валюте расчетов"
                    ],
                    [
                        "COUPONPERIOD",
                        "Длительность купона",
                        "INTEGER",
                        "4",
                        "Длительность купона, выраженная в днях"
                    ],
                    [
                        "NEXTCOUPON",
                        "Дата окончания купона",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "ISSUESIZE",
                        "Объем выпуска",
                        "INTEGER",
                        "16",
                        "Количество ценных бумаг в выпуске"
                    ],
                    [
                        "PREVWAPRICE",
                        "Оценка пред. дня",
                        "FLOAT",
                        "17",
                        "Значение оценки предыдущего торгового дня"
                    ],
                    [
                        "YIELDATPREVWAPRICE",
                        "Доходность по оценке пред. дня",
                        "FIXED",
                        "9.2",
                        "Доходность по оценке предыдущего торгового дня"
                    ],
                    [
                        "REPO2PRICE",
                        "Цена второй части РЕПО",
                        "FLOAT",
                        "17",
                        "Поле не используется. Устаревшее."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BUYBACKPRICE",
                        "Цена базовая для расчета доходности",
                        "FLOAT",
                        "17",
                        "Если указана, то расчет доходности производится по этой цене. При заполнении BUYBACKPRICE обязательно заполняется поле BUYBACKDATE"
                    ],
                    [
                        "BUYBACKDATE",
                        "Дата, к которой рассчитывается доходность",
                        "DATE",
                        "8",
                        "Если указана, то расчет доходности производится с использованием этой даты"
                    ],
                    [
                        "AGENTID",
                        "Агент по размещению",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы-агента по размещению"
                    ],
                    [
                        "QUOTEBASIS",
                        "Тип цены",
                        "TQuoteBasis",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "ISIN",
                        "ISIN",
                        "CHAR",
                        "12",
                        "Международный идентификационный код ценной бумаги"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента на английском языке"
                    ],
                    [
                        "REGNUMBER",
                        "Регистрационный номер",
                        "CHAR",
                        "30",
                        "Номер государственной регистрации"
                    ],
                    [
                        "PREVLEGALCLOSEPRICE",
                        "Цена закрытия предыдущего дня",
                        "FLOAT",
                        "17",
                        "Официальная цена закрытия предыдущего дня, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия"
                    ],
                    [
                        "PREVADMITTEDQUOTE",
                        "Признаваемая котировка предыдущего дня",
                        "FLOAT",
                        "17",
                        "Признаваемая котировка предыдущего дня, цена за одну ценную бумагу"
                    ],
                    [
                        "SECTYPE",
                        "Тип ценной бумаги",
                        "CHAR",
                        "1",
                        "Тип ценной бумаги"
                    ],
                    [
                        "ACTIVATIONDATE",
                        "Дата активации",
                        "DATE",
                        "8",
                        "Дата активации заявки - дата, при наступлении которой возможно заключение сделки(ок) на основании данной заявки. До наступления даты активации поданные по инструменту заявки накапливаются в торговой системе и имеют статус T."
                    ],
                    [
                        "PREVLOTSIZE",
                        "Предыдущий размер лота",
                        "INTEGER",
                        "8",
                        "Предыдущее значение размера лота"
                    ],
                    [
                        "LOTSIZECHANGEDATE",
                        "Дата последнего изменения размера лота",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "ORIGINTRADINGSTATUS",
                        "Состояние сессии",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту. Во время перерыва показывает действительное состояние торговой сесии (никогда не принимает значение \"Перерыв\")."
                    ],
                    [
                        "ISSUESIZEPLACED",
                        "Объем в обращении",
                        "INTEGER",
                        "16",
                        "Количество размещенных ценных бумаг, находящихся в обращении"
                    ],
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "LISTLEVEL",
                        "Уровень листинга",
                        "INTEGER",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "COMMENTS",
                        "Комментарии",
                        "CHAR",
                        "128",
                        "&nbsp;"
                    ],
                    [
                        "DIVIDENDVALUE",
                        "Величина дивидендов",
                        "FIXED",
                        "16.2",
                        "Величина дивидендов, выраженная в валюте расчетов"
                    ],
                    [
                        "DIVIDENDDATE",
                        "Дата закрытия реестра",
                        "DATE",
                        "8",
                        "Дата фиксации списка лиц, имеющих право на получение дивидендов"
                    ],
                    [
                        "SUBORDBOND",
                        "Субординированность",
                        "TYesNo",
                        "1",
                        "Признак субординированности (обязательства удовлетворяются после удовлетворения требований всех иных кредиторов)"
                    ],
                    [
                        "LOTDIVIDER",
                        "Коэффициент дробления",
                        "INTEGER",
                        "8",
                        "Коэффициент дробления ценной бумаги в одном стандартном лоте. Указывает на торговлю 1/LotDivider частями от LotSize. Например, LotSize=1 и LotDivider=100 в комбинации с USD/RUB означает торговлю частями по 1 центу."
                    ],
                    [
                        "GCPOOLID",
                        "Идентификатор пула",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "HIGHRISK",
                        "Повышенный инвестиционный риск",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "QINVESTOR",
                        "Бумага для квал. инвесторов",
                        "TQInvestor",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "COUPONSTARTDATE",
                        "Дата начала купонного периода",
                        "DATE",
                        "8",
                        "Дата начала купонного периода"
                    ],
                    [
                        "COMPLEXPRODUCT",
                        "Сложный финансовый продукт",
                        "INTEGER",
                        "10",
                        "Тип сложного финансового продукта"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ],
                    [
                        "OPEN",
                        "Первая",
                        "FLOAT",
                        "17",
                        "Цена первой сделки"
                    ],
                    [
                        "HIGH",
                        "Максимум",
                        "FLOAT",
                        "17",
                        "Максимальная цена сделки"
                    ],
                    [
                        "LOW",
                        "Минимум",
                        "FLOAT",
                        "17",
                        "Минимальная цена сделки"
                    ],
                    [
                        "LAST",
                        "Последняя",
                        "FLOAT",
                        "17",
                        "Цена последней сделки"
                    ],
                    [
                        "CHANGE",
                        "К последней пред. дня",
                        "FLOAT",
                        "17",
                        "Изменение цены последней сделки по отношению к цене последней сделки предыдущего торгового"
                    ],
                    [
                        "QTY",
                        "Лотов в последней",
                        "INTEGER",
                        "16",
                        "Объем последней сделки, в лотах"
                    ],
                    [
                        "TIME",
                        "Время последней",
                        "TIME",
                        "6",
                        "Время заключения последней сделки"
                    ],
                    [
                        "VOLTODAY",
                        "Количество за сегодня",
                        "FLOAT",
                        "17",
                        "Объем совершенных сделок, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "VALTODAY",
                        "Объем за сегодня",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в валюте расчетов"
                    ],
                    [
                        "VALUE",
                        "Объем в последней",
                        "FIXED",
                        "16.2",
                        "Объем последней сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "WAPRICE",
                        "Оценка",
                        "FLOAT",
                        "17",
                        "Средневзвешенная цена"
                    ],
                    [
                        "HIGHBID",
                        "Лучший спрос",
                        "FLOAT",
                        "17",
                        "Наибольшая цена спроса в течение торговой сессии"
                    ],
                    [
                        "LOWOFFER",
                        "Лучшее предложение",
                        "FLOAT",
                        "17",
                        "Наименьшая цена предложения в течение торговой сессии"
                    ],
                    [
                        "NUMTRADES",
                        "Сделок за сегодня",
                        "INTEGER",
                        "9",
                        "Количество сделок за торговый день"
                    ],
                    [
                        "YIELDATWAPRICE",
                        "Доходность по оценке",
                        "FIXED",
                        "9.2",
                        "Доходность по средневзвешенной цене"
                    ],
                    [
                        "PRICEMINUSPREVWAPRICE",
                        "К оценке пред. дня",
                        "FLOAT",
                        "17",
                        "Цена последней сделки к оценке предыдущего дня"
                    ],
                    [
                        "CLOSEPRICE",
                        "Цена послеторгового периода",
                        "FLOAT",
                        "17",
                        "Цена послеторгового периода"
                    ],
                    [
                        "CLOSEYIELD",
                        "Доходность по цене послеторгового периода",
                        "FIXED",
                        "9.2",
                        "Доходность по цене послеторгового периода"
                    ],
                    [
                        "LASTBID",
                        "Спрос сессии",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на покупку на момент завершения нормального периода торгов"
                    ],
                    [
                        "LASTOFFER",
                        "Предложение сессии",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на продажу на момент завершения нормального периода торгов"
                    ],
                    [
                        "LASTSETTLECODE",
                        "Код расчетов в последней",
                        "CHAR",
                        "12",
                        "Код расчетов по последней сделке"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "MARKETPRICE",
                        "Рыночная цена предыдущего дня",
                        "FLOAT",
                        "17",
                        "Рыночная цена ценной бумаги по результатам торгов предыдущего дня, за одну ценную бумагу. Для режимов РЕПО - расчетная цена РЕПО предыдущего дня."
                    ],
                    [
                        "MARKETPRICETODAY",
                        "Рыночная цена",
                        "FLOAT",
                        "17",
                        "Рыночная цена по результатам торгов сегодняшнего дня, за одну ценную бумагу"
                    ],
                    [
                        "DURATION",
                        "Дюрация",
                        "FIXED",
                        "7.2",
                        "&nbsp;"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по умолчанию для данного инструмента"
                    ],
                    [
                        "LOPENPRICE",
                        "Цена открытия",
                        "FLOAT",
                        "17",
                        "Не используется"
                    ],
                    [
                        "LCURRENTPRICE",
                        "Текущая цена",
                        "FLOAT",
                        "17",
                        "Официальная текущая цена, рассчитываемая как средневзвешенная цена сделок заключенных за последние 10 минут"
                    ],
                    [
                        "LCLOSEPRICE",
                        "Цена закрытия",
                        "FLOAT",
                        "17",
                        "Официальная цена закрытия, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия"
                    ],
                    [
                        "MARKETPRICE2",
                        "Рыночная цена 2",
                        "FLOAT",
                        "17",
                        "Рыночная цена 2, рассчитываемая в соответствии с методикой ФСФР"
                    ],
                    [
                        "ADMITTEDQUOTE",
                        "Признаваемая котировка",
                        "FLOAT",
                        "17",
                        "Признаваемая котировка, рассчитываемая в соответствии с методикой ФСФР"
                    ],
                    [
                        "OPENPERIODPRICE",
                        "Цена предторгового периода",
                        "FLOAT",
                        "17",
                        "Цена предторгового периода или аукциона открытия"
                    ],
                    [
                        "COUNTERPRICE",
                        "Цена контрагента",
                        "FLOAT",
                        "17",
                        "Цена контрагента за одну ценную бумагу. Если для бумаги указана цена контрагента, то заявки с признаком \"по цене конрагента\" удовлетворяются по этой цене"
                    ],
                    [
                        "MIN_CURR_LAST",
                        "Минимальная текущая цена",
                        "FLOAT",
                        "17",
                        "Минимальная из двух цен : Официальной текущей цены и цены последней сделки, вошедшей в расчёт официальной текущей цены."
                    ],
                    [
                        "MIN_CURR_LAST_TIME",
                        "Время изм. мин. тек. цены",
                        "TIME",
                        "6",
                        "Время изменения минимальной текущей цены"
                    ],
                    [
                        "CLOSING_AUCTION_PRICE",
                        "Цена АЗ",
                        "FLOAT",
                        "17",
                        "Цена аукциона закрытия. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона."
                    ],
                    [
                        "CLOSING_AUCTION_VOLUME",
                        "Количество АЗ",
                        "INTEGER",
                        "16",
                        "Количество в сделках аукциона закрытия.  Ожидаемое (состоявшееся) количество лотов в сделках по указанной цене послеторгового аукциона."
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявок на покупку (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку в аукционе Крупных Пакетов"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявок на продажу (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу в аукционе Крупных Пакетов"
                    ],
                    [
                        "SETTLEDATE1",
                        "Дата расчетов 1",
                        "DATE",
                        "8",
                        "Дата расчетов по сделке или первой части сделки РЕПО/своп"
                    ],
                    [
                        "NFAPRICE",
                        "Цена НФА",
                        "FLOAT",
                        "17",
                        "Цена Ценового центра НФА"
                    ],
                    [
                        "SETTLEDATE2",
                        "Дата расчетов 2",
                        "DATE",
                        "8",
                        "Дата расчетов второй части сделки РЕПО/своп"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор текущей торговой сессии"
                    ],
                    [
                        "EVENINGSESSION",
                        "Доступность в дополнительной сессии",
                        "TYesNo",
                        "1",
                        "Флаг допуска бумаги для торгов в дополнительной сессии"
                    ],
                    [
                        "PRICEMINUSPREVLEGALCLOSEPRICE",
                        "К закрытию пред. дня",
                        "FLOAT",
                        "17",
                        "Цена последней сделки к официальной цене закрытия предыдущего дня"
                    ]
                ],
                "title": "Тип финансового инструмента (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECTYPE</td> <td>Тип ценной бумаги</td> <td>CHAR</td> <td align=right>1</td> <td>Тип ценной бумаги</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя</td> <td>CHAR</td> <td align=right>4</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATNAME</td> <td>Имя на английском</td> <td>CHAR</td> <td align=right>4</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>128</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_32\"></a> <h4>SECURITIES - Финансовые инструменты (обновляемая)</h4> <ul> Таблица содержит текущую биржевую информацию о финансовых инструментах, относящихся к различным режимам торгов. Каждая строка таблицы соответствует уникальной паре режим торгов - финансовый инструмент.",
                "input": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ]
                ]
            },
            "SEC_SETTLECODE": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов"
                    ],
                    [
                        "ACCRUEDINT",
                        "НКД",
                        "FLOAT",
                        "17",
                        "Накопленный процентный доход на дату SettleDate для кода расчетов, выраженный в валюте расчетов"
                    ],
                    [
                        "ACCRUEDINT2",
                        "НКД 2 части РЕПО",
                        "FLOAT",
                        "17",
                        "Накопленный процентный доход на дату SettleDate2 для кода расчетов, выраженный в валюте расчетов"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "REPORATE",
                        "Ставка РЕПО, %",
                        "FLOAT",
                        "17",
                        "Фиксированная ставка РЕПО, в процентах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов адресной сделки или первой части сделки РЕПО"
                    ],
                    [
                        "SETTLEDATE2",
                        "Дата расчетов РЕПО",
                        "DATE",
                        "8",
                        "Дата расчетов второй части сделки РЕПО"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "TRANSFERSONLY",
                        "Только переводы",
                        "TYesNo",
                        "1",
                        "Разрешены только переводы"
                    ]
                ],
                "title": "Накопленный доход и ставки РЕПО на дату расчетов (обновляемая)",
                "desc": "По данному запросу, Торговая система предоставляет информацию по допустимым кодам расчетов для заданного инструмента, соответствующим датам расчетов и значениям накопленного дохода",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "SEC_SETTLECODE_STATS": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ]
                ],
                "title": "Лучшие котировки внебиржевых заявок *Всем (обновляемая)",
                "desc": "Таблица содержит информацию о адресных заявках с лучшими ценами (отдельно на покупку и на продажу) по финансовому инструменту. Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ]
                ]
            },
            "SEC_STATS": {
                "output": [
                    [
                        "SESSION",
                        "Номер старта",
                        "INTEGER",
                        "10",
                        "Уникальный номер старта Торговой системы"
                    ],
                    [
                        "TEVERSION",
                        "Версия",
                        "CHAR",
                        "10",
                        "Номер версии торговой/клиринговой системы"
                    ],
                    [
                        "SYSTEMID",
                        "Тип",
                        "TSystemID",
                        "1",
                        "Тип торговой/клиринговой системы"
                    ],
                    [
                        "TESTSYSTEM",
                        "Тестовая система",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Итоги торговых сессий (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADINGSESSION</td> <td>Торговая сессия</td> <td>CHAR</td> <td align=right>1</td> <td>Идентификатор торговой сессии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TIME</td> <td>Время последней</td> <td>TIME</td> <td align=right>6</td> <td>Время заключения последней сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICEMINUSPREVWAPRICE</td> <td>К оценке пред. дня</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена последней сделки к оценке предыдущего дня</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VOLTODAY</td> <td>Количество за сегодня</td> <td>FLOAT</td> <td align=right>17</td> <td>Объем совершенных сделок, выраженный в единицах ценных бумаг</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LOWOFFER</td> <td>Лучшее предложение</td> <td>FLOAT</td> <td align=right>17</td> <td>Наименьшая цена предложения в течение торговой сессии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">HIGHBID</td> <td>Лучший спрос</td> <td>FLOAT</td> <td align=right>17</td> <td>Наибольшая цена спроса в течение торговой сессии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">HIGH</td> <td>Максимум</td> <td>FLOAT</td> <td align=right>17</td> <td>Максимальная цена сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LOW</td> <td>Минимум</td> <td>FLOAT</td> <td align=right>17</td> <td>Минимальная цена сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALTODAY</td> <td>Объем за сегодня</td> <td>INTEGER</td> <td align=right>16</td> <td>Объем совершенных сделок, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">WAPRICE</td> <td>Оценка</td> <td>FLOAT</td> <td align=right>17</td> <td>Средневзвешенная цена</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OPEN</td> <td>Первая</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена первой сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LAST</td> <td>Последняя</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена последней сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PREVPRICE</td> <td>Последняя предыдущего дня</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена последней сделки предыдущего торгового дня</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LASTOFFER</td> <td>Предложение сессии</td> <td>FLOAT</td> <td align=right>17</td> <td>Лучшая котировка на продажу на момент завершения нормального периода торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NUMTRADES</td> <td>Сделок за сегодня</td> <td>INTEGER</td> <td align=right>9</td> <td>Количество сделок за торговый день</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LASTBID</td> <td>Спрос сессии</td> <td>FLOAT</td> <td align=right>17</td> <td>Лучшая котировка на покупку на момент завершения нормального периода торгов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ADMITTEDQUOTE</td> <td>Признаваемая котировка</td> <td>FLOAT</td> <td align=right>17</td> <td>Признаваемая котировка, рассчитываемая в соответствии с методикой ФСФР</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">MARKETPRICETODAY</td> <td>Рыночная цена</td> <td>FLOAT</td> <td align=right>17</td> <td>Рыночная цена по результатам торгов сегодняшнего дня, за одну ценную бумагу</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">MARKETPRICE2</td> <td>Рыночная цена 2</td> <td>FLOAT</td> <td align=right>17</td> <td>Рыночная цена 2, рассчитываемая в соответствии с методикой ФСФР</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LCURRENTPRICE</td> <td>Текущая цена</td> <td>FLOAT</td> <td align=right>17</td> <td>Официальная текущая цена, рассчитываемая как средневзвешенная цена сделок заключенных за последние 10 минут</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLOSING_AUCTION_PRICE</td> <td>Цена АЗ</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена аукциона закрытия. В течение аукциона отображает ожидаемую цену аукциона с учетом всех зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося аукциона.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LCLOSEPRICE</td> <td>Цена закрытия</td> <td>FLOAT</td> <td align=right>17</td> <td>Официальная цена закрытия, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PREVLEGALCLOSEPRICE</td> <td>Цена закрытия предыдущего дня</td> <td>FLOAT</td> <td align=right>17</td> <td>Официальная цена закрытия предыдущего дня, рассчитываемая в соответствии с правилами торгов как средневзвешенная цена сделок за последние 10 минут основной сессии, включая сделки послеторгового периода или аукциона закрытия</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OPENPERIODPRICE</td> <td>Цена предторгового периода</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена предторгового периода или аукциона открытия</td> </tr> </table> </ul> <a name=\"t0_36\"></a> <h4>SETTLECODES - Коды расчетов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE</td> <td>Дата расчетов</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов адресной сделки или первой части сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE2</td> <td>Дата расчетов 2</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов 2, для кодов расчетов типа 'R', соответствует дате исполнения второй части РЕПО</td> </tr> </table> </ul> <a name=\"t0_37\"></a> <h4>STATS - Параметры торговой системы (не обновляемая)</h4> <ul> Таблица состоит из одной строки и содержит информацию о параметрах торговой системы"
            },
            "STOPLIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ]
                ],
                "title": "Стоп-листы фирм (обновляемая)",
                "desc": "Таблица содержит информацию о клиентах, находящихся под санкциями"
            },
            "TESYSTIME": {
                "output": [
                    [
                        "TIME",
                        "Текущее время",
                        "TIME",
                        "6",
                        "Текущее время торгового/клирингового сервера"
                    ],
                    [
                        "DATE",
                        "Дата",
                        "DATE",
                        "8",
                        "Текущая дата торгового/клирингового сервера"
                    ],
                    [
                        "TOMORROWDATE",
                        "Дата следующих торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Текущее время торгового/клирингового сервера, микросекунды"
                    ]
                ],
                "title": "Системное время торгового сервера (обновляемая, очищать при обновлении)",
                "desc": "Таблица состоит из одной строки и содержит информацию о текущем времени торгового сервера. Используется для синхронизации времени на клиентском рабочем месте с временем торгового сервера."
            },
            "TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Номер заявки, на основании которой заключена сделка"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки - \"купля/продажа\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Идентификатор трейдера, совершившего сделку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы, от имени которой была совершена сделка"
                    ],
                    [
                        "CPFIRMID",
                        "Партнер",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы партнера"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого заключена данная сделка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Цена",
                        "FLOAT",
                        "17",
                        "Цена за одну ценную бумагу"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "ACCRUEDINT",
                        "Объем НКД",
                        "FIXED",
                        "16.2",
                        "Накопленный купонный доход, рассчитанный в соответствии с количеством ценных бумаг данной сделки, в валюте расчетов"
                    ],
                    [
                        "YIELD",
                        "Доходность",
                        "FIXED",
                        "9.2",
                        "Доходность, рассчитанная по цене сделки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "PRICE2",
                        "Цена выкупа",
                        "FLOAT",
                        "17",
                        "Цена выкупа второй части РЕПО"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "TRADETYPE",
                        "Тип",
                        "TTradeType",
                        "1",
                        "Тип сделки"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "COMMISSION",
                        "Комиссия суммарная",
                        "FIXED",
                        "16.2",
                        "Объем комиссии по сделке, руб."
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "FLOAT",
                        "17",
                        "Ставка РЕПО, в процентах"
                    ],
                    [
                        "ACCRUED2",
                        "Объем НКД при выкупе",
                        "FIXED",
                        "16.2",
                        "Процентный доход по сделке на дату выкупа, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOVALUE",
                        "Сумма / Сумма РЕПО",
                        "FIXED",
                        "16.2",
                        "Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату"
                    ],
                    [
                        "REPO2VALUEBALANCE",
                        "Остаток стоимости выкупа РЕПО",
                        "FIXED",
                        "16.2",
                        "Остаток объема сделки выкупа РЕПО в неисполненной части заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "REPOTERM",
                        "Срок",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "STARTDISCOUNT",
                        "Начальный дисконт, %",
                        "FLOAT",
                        "17",
                        "Дисконт в процентах"
                    ],
                    [
                        "LOWERDISCOUNT",
                        "Нижний предел дисконта, %",
                        "FLOAT",
                        "17",
                        "Дисконт в процентах"
                    ],
                    [
                        "UPPERDISCOUNT",
                        "Верхний предел дисконта, %",
                        "FLOAT",
                        "17",
                        "Дисконт в процентах"
                    ],
                    [
                        "BLOCKSECURITIES",
                        "Блокировать обеспечение",
                        "TYesNo",
                        "1",
                        "Признак блокировки финансового инструмента на специальном счете на время операции РЕПО"
                    ],
                    [
                        "CLEARINGCENTERCOMM",
                        "Комиссия за клиринг",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения за клиринговые услуги, руб."
                    ],
                    [
                        "EXCHANGECOMM",
                        "Комиссия за торги",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения биржи, руб."
                    ],
                    [
                        "TRADINGSYSTEMCOMM",
                        "Комиссия за тех. доступ",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения Технического центра, руб."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор расчетного счета/кода в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во адресных заявках по инструментам СВОП"
                    ],
                    [
                        "PARENTTRADENO",
                        "Витринная сделка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер витринной сделки в Торговой Системе для сделок РЕПО"
                    ],
                    [
                        "HIDDENQTYORDER",
                        "Сделка по айсберг-заявке",
                        "TYesNo",
                        "1",
                        "Принимает значение 'Y'/'N'. Поле содержит 'Y' если сделка была заключена на основании айсберг-заявки."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRADEDATE",
                        "Дата торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "LSECCODE",
                        "Актив корзины",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "CLEARINGBANKACCID",
                        "Клиринговый расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор клирингового расчетного счета в НКЦ"
                    ],
                    [
                        "MAKERFLAG",
                        "Активная/Пассивная",
                        "TMakerTaker",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "CPORDERNO",
                        "Встречная заявка адресной сделки",
                        "INTEGER",
                        "12",
                        "Идентификационный номер встречной заявки в Торговой Системе (только для сделок в адресном режиме)"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Сделка урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что сделка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTradeStatus",
                        "1",
                        "Статус сделки"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ],
                    [
                        "FACEAMOUNT",
                        "Объем по номиналу",
                        "FIXED",
                        "16.2",
                        "Объем сделки по номиналу, выраженный в валюте номинала"
                    ],
                    [
                        "CLEARINGTRDACCID",
                        "Клиринговый счет",
                        "CHAR",
                        "12",
                        "Номер клирингового счета"
                    ],
                    [
                        "TRADINGSESSION",
                        "Торговая сессия",
                        "CHAR",
                        "1",
                        "Идентификатор торговой сессии, в которой была заключена сделка"
                    ],
                    [
                        "FLOATINGRATE",
                        "Плавающая ставка",
                        "TFloatingRate",
                        "1",
                        "Признак плавающей ставки"
                    ],
                    [
                        "BENCHMARK",
                        "Бенчмарк",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "CANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены сделки"
                    ]
                ],
                "title": "Сделки (обновляемая)",
                "desc": "Таблица содержит информацию о сделках на покупку/продажу, заключенных Членом Секции (Членами Секции) с начала торговой сессии. Каждая сделка представлена в таблице одной строкой."
            },
            "TRADETIME": {
                "output": [
                    [
                        "TIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время наступления события"
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы финансовых инструментов, для которой определено событие"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима финансовых инструментов, для которого определено событие"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "TYPE",
                        "Событие",
                        "CHAR",
                        "2",
                        "Тип события. Все типы событий перечислены в таблице TRDTIMETYPES"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTimeStatus",
                        "1",
                        "Признак - наступило событие или еще нет"
                    ]
                ],
                "title": "Расписание торгов (обновляемая)",
                "desc": "Таблица содержит информацию о временных событиях, соответствующих изменению состояния торгов"
            },
            "TRADING_SESSION": {
                "output": [
                    [
                        "TYPE",
                        "Группа событий",
                        "CHAR",
                        "1",
                        "Группа событий"
                    ],
                    [
                        "NAME",
                        "Наименование группы",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий"
                    ],
                    [
                        "LATNAME",
                        "Английское наименование",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий на английском языке"
                    ]
                ],
                "title": "Торговые сессии (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ID</td> <td>Торговая сессия</td> <td>CHAR</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя торговой сессии</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SHORTNAME</td> <td>Краткое наименование</td> <td>CHAR</td> <td align=right>10</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_43\"></a> <h4>TRANTYPES - Типы переводов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRANTYPE</td> <td>Код операции</td> <td>CHAR</td> <td align=right>4</td> <td>Информация об операции</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>255</td> <td>Описание типа перевода</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td> <td>Англ. Описание</td> <td>CHAR</td> <td align=right>255</td> <td>Описание типа перевода на английском языке</td> </tr> </table> </ul> <a name=\"t0_44\"></a> <h4>TRDACC - Торговые счета (обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип депозитарного счета</td> <td> TDepAccType</td> <td align=right>1</td> <td>Тип депозитарного счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>30</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Код дополнительной позиции по денежным средствам</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TTrdAccStatus</td> <td align=right>1</td> <td>Индикатор \"торговые операции разрешены/запрещены\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEPACCID</td> <td>Счет депо</td> <td>CHAR</td> <td align=right>12</td> <td>Номер счета депо в Депозитарии</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td> <td>Тип торгового счета</td> <td>CHAR</td> <td align=right>1</td> <td>Тип торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMUSE</td> <td>Тип раздела</td> <td>CHAR</td> <td align=right>1</td> <td>Значение 'U' - раздел обеспечения; значения, отличные от 'U' - для торговых разделов.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">MAINTRDACCID</td> <td>Основной торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKIDT0</td> <td>Расчетная организация по Т0</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKIDTPLUS</td> <td>Расчетная организация по Т+</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DEPUNITID</td> <td>Раздел счета Депо</td> <td>CHAR</td> <td align=right>17</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GCPLINKTRDACCID</td> <td>Связанный торговый счет Т+ для выдачи КСУ</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTUID</td> <td>Единый идентификатор раздела</td> <td>CHAR</td> <td align=right>12</td> <td>Единый уникальный идентификатор раздела, используемый в НРД</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTSECREQUEST</td> <td>Разрешение на подбор ценных бумаг на раздел</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> </table> </ul> <a name=\"t0_45\"></a> <h4>TRDACCTYPES - Список типов торгово-клиринговых счетов (не обновляемая)</h4> <ul> Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td> <td>Тип торгового счета</td> <td>CHAR</td> <td align=right>1</td> <td>Тип торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NAME</td> <td>Имя</td> <td>CHAR</td> <td align=right>30</td> <td>Наименование типа</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATNAME</td> <td>Англ. наименование</td> <td>CHAR</td> <td align=right>30</td> <td>Наименование типа на английском языке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OWN</td> <td>Собственный счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLIENT</td> <td>Клиентский счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRUST</td> <td>Доверительное управление (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ISSUING</td> <td>Эмиссионный счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TREASURY</td> <td>Казначейский счет (Да/Нет)</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>128</td> <td>Описание типа</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td> <td>Англ. Описание</td> <td>CHAR</td> <td align=right>128</td> <td>Описание типа на английском языке</td> </tr> </table> </ul> <a name=\"t0_46\"></a> <h4>TRDTIMEGROUPS - Группы событий (не обновляемая)</h4> <ul> Группы событий используемых в расписании"
            },
            "TRDTIMETYPES": {
                "output": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TActiveStatus",
                        "1",
                        "Текущее состояние записи об андеррайтере"
                    ]
                ],
                "title": "Типы событий расписания торгов (не обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип события</td> <td>CHAR</td> <td align=right>2</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DESCRIPTION</td> <td>Описание</td> <td>CHAR</td> <td align=right>50</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">GROUPTYPE</td> <td>Группа</td> <td>CHAR</td> <td align=right>1</td> <td>Тип группы событий</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LAT_DESCRIPTION</td> <td>Английский</td> <td>CHAR</td> <td align=right>50</td> <td>Описание на английском языке</td> </tr> </table> </ul> <a name=\"t0_48\"></a> <h4>UNDERWRITERS - Андеррайтеры (обновляемая)</h4> <ul> Таблица содержит информацию о фирмах, участниках торгов, являющихся андеррайтером при размещении ценной бумаги.",
                "input": [
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "USERGROUPS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для группы"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ]
                ],
                "title": "Группы пользователей (обновляемая)",
                "desc": "Таблица содержит информацию о группах пользователей.",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ]
                ]
            },
            "USERS": {
                "output": [
                    [
                        "USERID",
                        "Код участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "USERNAME",
                        "Участник",
                        "CHAR",
                        "30",
                        "&nbsp;"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADING",
                        "Торговые/клиринговые операции",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\" управляющим фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "CODMODESUBSCR",
                        "COD-подписка",
                        "TCodMode",
                        "1",
                        "Тип подписки на COD-режим. COD-режим - Cancel on Disconnect - режим снятия заявок при потере соединения с ТС или при отключении от ТС. Доступные режимы: \"Не используется\", \"Всегда\" и \"По требованию\""
                    ],
                    [
                        "CODMODE",
                        "COD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Disconnect)."
                    ],
                    [
                        "MASTERUSER1",
                        "Мастер ID 1",
                        "CHAR",
                        "12",
                        "Первый Мастер User ID для SMA-доступа"
                    ],
                    [
                        "MASTERUSER2",
                        "Мастер ID 2",
                        "CHAR",
                        "12",
                        "Второй Мастер User ID для SMA-доступа"
                    ],
                    [
                        "CODMODE_DC",
                        "CODCD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Drop-Copy  Disconnect)."
                    ],
                    [
                        "MASTERUSERFLAG",
                        "Мастер",
                        "TYesNo",
                        "1",
                        "Идентификатор является контролирующим Мастер Идентификатором (SMA-доступ)"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для пользователя"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ],
                    [
                        "USERALIAS",
                        "Псевдоним участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "PWDCNG_ON_LOGON",
                        "Смена пароля при входе",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "IPGATEWAY",
                        "Сервер доступа",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "IPCLIENT",
                        "Рабочая станция",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "LOGGEDON",
                        "Активен",
                        "TBoolInt",
                        "1",
                        "Индикатор информирующий, что пользователь в настоящий момент подключен системе"
                    ],
                    [
                        "EXTIPCLIENT",
                        "Внешний адрес",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ]
                ],
                "title": "Пользователи (обновляемая)",
                "desc": "Таблица содержит информацию о пользователях, в том числе технологических, выделенных для фирмы-участника торгов и/или клиринга. Каждый пользователь представлен в таблице одной строкой."
            },
            "USER_CLIENT": {
                "output": [
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Привязка пользователей к кодам клиентов (обновляемая)",
                "desc": "Привязка пользователей к кодам клиентов"
            },
            "USER_TRDACC": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ]
                ],
                "title": "Трейдер-счет (не обновляемая)",
                "desc": "Привязка идентификаторов пользователей к торговым счетам"
            },
            "USTRADES": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Сделки для исполнения (обновляемая)",
                "desc": "Входных полей нет<br> <table cellspacing=1 cellpadding=1 border=0 width=90%> <tr bgcolor=\"#c0c0c0\"> <td width=15%>Выходное поле</td> <td width=20%>Описание</td> <td width=7%>Тип</td> <td width=5% align=right>Размер</td> <td>Примечание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADENO</td> <td>Сделка №</td> <td>INTEGER</td> <td align=right>12</td> <td>Идентификационный номер сделки в Торговой Системе</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRADEDATE</td> <td>Дата сделки</td> <td>DATE</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLEDATE</td> <td>Дата исполнения</td> <td>DATE</td> <td align=right>8</td> <td>Дата расчетов сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECBOARD</td> <td>Режим</td> <td>CHAR</td> <td align=right>4</td> <td>Идентификатор режима торгов для финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SECCODE</td> <td>Инструмент</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор финансового инструмента</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BUYSELL</td> <td>К/П</td> <td> TBuySell</td> <td align=right>1</td> <td>Направленность заявки - \"купля/продажа\"</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE</td> <td>Цена</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена за одну ценную бумагу</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">QUANTITY</td> <td>Лоты</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">VALUE</td> <td>Объем</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем сделки, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLECODE</td> <td>Код расчетов</td> <td>CHAR</td> <td align=right>12</td> <td>Код расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FIRMID</td> <td>Фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TRDACCID</td> <td>Торговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPFIRMID</td> <td>Партнер</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPTRDACCID</td> <td>Торговый счет партнера</td> <td>CHAR</td> <td align=right>12</td> <td>Номер торгового счета партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTNO</td> <td>Отчет</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPREPORTNO</td> <td>Отчет партнера</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">STATUS</td> <td>Статус</td> <td> TUSTradeStatus</td> <td align=right>1</td> <td>Состояние сделки для исполнения</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ACCRUEDINT</td> <td>Объем НКД</td> <td>FIXED</td> <td align=right>16.2</td> <td>Процентный доход, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BROKERREF</td> <td>Примечание</td> <td>CHAR</td> <td align=right>20</td> <td>Дополнительная справочная информация (заполняется трейдером), как правило - номер поручения</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTRADENO</td> <td>Сделка РЕПО</td> <td>INTEGER</td> <td align=right>12</td> <td>Идентификационный номер сделки первой части РЕПО для режимов торгов РЕПО без ЦК. Для режимов РЕПО с ЦК для первой части сделки заносится номер второй части. Для второй части сделки - номер первой.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE1</td> <td>Цена на дату заключения</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена первой части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORATE</td> <td>Ставка, %</td> <td>FLOAT</td> <td align=right>17</td> <td>Ставка РЕПО, в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRICE2</td> <td>Цена на дату исполнения</td> <td>FLOAT</td> <td align=right>17</td> <td>Цена выкупа второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMMISSION</td> <td>Комиссия</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем комиссии по сделке, руб.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLETIME</td> <td>Время исполнения</td> <td>TIME</td> <td align=right>6</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BALANCE</td> <td>Лотов к исполнению</td> <td>INTEGER</td> <td align=right>16</td> <td>Объем неисполненной части заявки, выраженный в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">AMOUNT</td> <td>Сумма к исполнению</td> <td>FIXED</td> <td align=right>16.2</td> <td>Обязательство или требование (в зависимости от направления сделки) по деньгам (для сделок второй части РЕПО - значение обязательства РЕПО на текущую дату)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOVALUE</td> <td>Сумма / Сумма РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма РЕПО - сумма привлеченных/предоставленных по сделке РЕПО денежных средств, по состоянию на текущую дату</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTERM</td> <td>Срок</td> <td>INTEGER</td> <td align=right>4</td> <td>Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPO2VALUEBALANCE</td> <td>Остаток стоимости выкупа РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Текущее значение стоимости выкупа по сделке РЕПО, рассчитанная на дату исполнения (по условию сделки) второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">RETURNVALUE</td> <td>Сумма возврата РЕПО</td> <td>FIXED</td> <td align=right>16.2</td> <td>Текущее значение суммы возврата по сделке РЕПО, рассчитанная на дату исполнения (по условию сделки) второй части РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DISCOUNT</td> <td>Дисконт</td> <td>FLOAT</td> <td align=right>17</td> <td>Для сделок первой части РЕПО - начальный дисконт. Для сделок второй части РЕПО - текущий дисконт.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">LOWERDISCOUNT</td> <td>Нижний предел дисконта %</td> <td>FLOAT</td> <td align=right>17</td> <td>Нижний предел дисконта %</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">UPPERDISCOUNT</td> <td>Верхний предел дисконта %</td> <td>FLOAT</td> <td align=right>17</td> <td>Дисконт в процентах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BLOCKSECURITIES</td> <td>Блокировать обеспечение</td> <td> TYesNo</td> <td align=right>1</td> <td>Признак блокировки финансового инструмента на специальном счете на время операции РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">URGENCYFLAG</td> <td>Исполнить</td> <td> TYesNo</td> <td align=right>1</td> <td>Индикатор информирующий, что сделка должна быть исполнена сегодня</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">TYPE</td> <td>Тип</td> <td> TUSTradeType</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">OPERATIONTYPE</td> <td>Операция</td> <td> TOperationType</td> <td align=right>1</td> <td>Тип операции: Зачисление/Списание</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDDISCOUNT</td> <td>Дисконт после взноса %</td> <td>FLOAT</td> <td align=right>17</td> <td>Размер дисконта в процентах после исполнения компенсационного взноса</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDQUANTITY</td> <td>Лотов после взноса</td> <td>INTEGER</td> <td align=right>16</td> <td>Количество ценных бумаг после исполнения компенсационного взноса, выраженное в лотах</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDREPOVALUE</td> <td>Сумма РЕПО после взноса</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма привлеченных/предоставленных по сделке РЕПО денежных средств после исполнения компенсационного взноса</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDREPO2VALUE</td> <td>Стоимость выкупа после взноса</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем сделки выкупа РЕПО после исполнения компенсационного взноса, выраженный в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXPECTEDRETURNVALUE</td> <td>Сумма возврата после взноса</td> <td>FIXED</td> <td align=right>16.2</td> <td>Значение суммы возврата по сделке РЕПО после исполнения компенсационного взноса, выраженное в валюте расчетов</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLIENTCODE</td> <td>Код клиента</td> <td>CHAR</td> <td align=right>12</td> <td>Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">NEXTDAYSETTLE</td> <td>Исполнить завтра</td> <td> TYesNo</td> <td align=right>1</td> <td>Индикатор информирующий, что сделка должна быть исполнена в следующий расчетный день</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">ORDERNO</td> <td>Заявка</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер заявки, на основании которой была заключена данная сделка</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPOTRADETRADEDATE</td> <td>Дата заключения</td> <td>DATE</td> <td align=right>8</td> <td>Для компенсационных взносов - дата заключения исходной сделки РЕПО, пусто для остальных случаев</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EXTREF</td> <td>Код внешнего пользователя</td> <td>CHAR</td> <td align=right>12</td> <td>Поле-примечание, используется для обратной связи с внешними системами. Например, идентификатор пользователя внешней системы, поставившего заявку.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SETTLED</td> <td>Состояние расчетов</td> <td> TSettled</td> <td align=right>1</td> <td>Состояние расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTYPE</td> <td>Тип клиринга</td> <td> TClearingType</td> <td align=right>1</td> <td>Тип процедуры расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTIME</td> <td>Время расчетов</td> <td>TIME</td> <td align=right>6</td> <td>Время завершения процедуры расчетов по сделке</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">REPORTCOMMISSION</td> <td>Комиссия за отчет</td> <td>FIXED</td> <td align=right>16.2</td> <td>Размер комиссионного вознаграждения за исполнение сделки срочным отчетом, в руб.</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COUPONPAYMENT</td> <td>Купонная выплата</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем купонной выплаты, прошедшей со дня последних торгов по бумагам, входящим в обеспечение сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COUPONPAYMENTDATE</td> <td>Дата купонной выплаты</td> <td>DATE</td> <td align=right>8</td> <td>Дата прошедшей купонной выплаты</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRINCIPALPAYMENT</td> <td>Выплата по основному долгу</td> <td>FIXED</td> <td align=right>16.2</td> <td>Объем выплаты по основному долгу, прошедшей со дня последних торгов по бумагам, входящим в обеспечение сделки РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRINCIPALPAYMENTDATE</td> <td>Дата выплаты по основному долгу</td> <td>DATE</td> <td align=right>8</td> <td>Дата прошедшей выплаты по основному долгу (амортизации)</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CONFIRMED</td> <td>Статус подтверждения</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CPCONFIRMED</td> <td>Статус подтверждения контрагента</td> <td> TYesNo</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CONFIRMREPORT</td> <td>Номер поручения</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер поручения на подтверждение внебиржевой сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CONFIRMTIME</td> <td>Время подтверждения</td> <td>TIME</td> <td align=right>6</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKACCID</td> <td>Расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор расчетного счета/кода в клиринговой организации</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PRECISEBALANCE</td> <td>Бумаг к исполнению</td> <td>INTEGER</td> <td align=right>16</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BANKID</td> <td>Расчетная организация</td> <td>CHAR</td> <td align=right>12</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CURRENCYID</td> <td>Валюта расчетов</td> <td>CHAR</td> <td align=right>4</td> <td>Валюта расчетов по инструменту</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">COMPVAL</td> <td>Сумма отступного</td> <td>FIXED</td> <td align=right>16.2</td> <td>Сумма отступного, в валюте сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">PARENTTRADENO</td> <td>Витринная сделка</td> <td>INTEGER</td> <td align=right>12</td> <td>Идентификационный номер витринной сделки в Торговой Системе для сделок РЕПО</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td> <td>Клиринговая фирма</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор фирмы - Участника Клиринга</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGBANKACCID</td> <td>Клиринговый расчетный код</td> <td>CHAR</td> <td align=right>12</td> <td>Идентификатор клирингового расчетного счета в НКЦ</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">CLEARINGTRDACCID</td> <td>Клиринговый счет</td> <td>CHAR</td> <td align=right>12</td> <td>Номер клирингового счета</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLESTATUS</td> <td>Досрочное исполнение</td> <td> TEarlySettle</td> <td align=right>1</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLEREPORTNO</td> <td>Отчет на досрочное исполнение</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета на досрочное исполнение</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">EARLYSETTLECPREPORTNO</td> <td>Отчет на досрочное исполнение партнера</td> <td>INTEGER</td> <td align=right>12</td> <td>Номер отчета на досрочное исполнение от партнера</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">DUEDATE</td> <td>Надлежащая дата расчетов</td> <td>DATE</td> <td align=right>8</td> <td>Надлежащая дата расчетов сделки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">FLOATINGRATE</td> <td>Плавающая ставка</td> <td> TFloatingRate</td> <td align=right>1</td> <td>Признак плавающей ставки</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">BENCHMARK</td> <td>Бенчмарк</td> <td>CHAR</td> <td align=right>8</td> <td>&nbsp;</td> </tr> <tr bgcolor=\"#f0f0f0\"> <td bgcolor=\"#e0e0e0\">SYSTEMREF</td> <td>Системная ссылка</td> <td>CHAR</td> <td align=right>12</td> <td>Дополнительная информация, передаваемая торговой системой</td> </tr> </table> </ul> <a name=\"t0_54\"></a> <h4>U_BOARD_BLACK_LIST - Чёрный список режимов торгов (обновляемая)</h4> <ul> Cписок недоступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_BOARD_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Белый список режимов торгов (обновляемая)",
                "desc": "Список доступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_HOLD_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ],
                    [
                        "VALPOSITION",
                        "Начальный объем",
                        "FIXED",
                        "16.2",
                        "Начальный объем, выраженный в валюте расчетов."
                    ]
                ],
                "title": "Ограничения позиции по бумагам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в ценных бумагах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_ORDER_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICEBOUNDUP",
                        "Отклонение цены вверх",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вверх (в процентах от текущей цены)"
                    ],
                    [
                        "PRICEBOUNDDOWN",
                        "Отклонение цены вниз",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вниз (в процентах от текущей цены)"
                    ],
                    [
                        "MAXQTY",
                        "Максимальное количество в заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в заявке"
                    ],
                    [
                        "MAXORDERVAL",
                        "Максимальный объем заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXMKTQTY",
                        "Максимальное количество в рыночной заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в рыночной заявке"
                    ],
                    [
                        "MAXMKTORDERVAL",
                        "Максимальный объем рыночной заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем рыночной заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXORDVALTODAY",
                        "Максимальная сумма заявок",
                        "FIXED",
                        "16.2",
                        "Максимальная сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "CURORDVALTODAY",
                        "Текущая сумма заявок",
                        "FIXED",
                        "16.2",
                        "Текущая сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения по заявкам (обновляемая)",
                "desc": "Ограничения пользователя по заявкам",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_POSN_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ],
                    [
                        "GPOSVALLIMIT",
                        "Максимальное значение брутто",
                        "FIXED",
                        "16.2",
                        "Максимальное значение позиции брутто в деньгах"
                    ],
                    [
                        "GPOSVAL",
                        "Текущее значение брутто",
                        "FIXED",
                        "16.2",
                        "Текущее значение позиции брутто в деньгах"
                    ]
                ],
                "title": "Ограничения позиции по деньгам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в деньгах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список недоступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список доступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (обновляемая)",
                "desc": "Список недоступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (обновляемая)",
                "desc": "Список доступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_TRDACC_BOARD_RESTR": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения счет - режим (обновляемая)",
                "desc": "Ограничения торгового счета режимами торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            }
        },
        "Currency": {
            "ALL_TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки инициирующей заключение сделки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ]
                ],
                "title": "Все сделки (обновляемая)",
                "desc": "Таблица содержит общую информацию (без указания сторон по сделке) по всем сделкам купли/продажи финансовых         инструментов, совершенным в Торговой Системе с начала торговой сессии"
            },
            "AUCTSTATS": {
                "output": [
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDTIME",
                        "Запланированное время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона (из расписания торгов)"
                    ],
                    [
                        "STARTTIME",
                        "Время начала аукциона",
                        "TIME",
                        "6",
                        "Время начала аукциона"
                    ],
                    [
                        "ENDTIME",
                        "Время окончания аукциона",
                        "TIME",
                        "6",
                        "Время окончания аукциона"
                    ],
                    [
                        "AUCTPRICE",
                        "Итоговая цена аукциона",
                        "FLOAT",
                        "17",
                        "Итоговая цена аукциона. В течение аукциона отображает ожидаемую цену аукциона с учетом всех                     зарегистрированных на текущий момент заявок. После завершения аукциона отображает цену состоявшегося                     аукциона."
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем совершенных сделок аукциона, выраженный в валюте расчетов. В течение аукциона показывает                     ожидаемый объем."
                    ],
                    [
                        "VOLUME",
                        "Количество",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, в единицах ценных бумаг. В течение аукциона показывает ожидаемый объем."
                    ],
                    [
                        "NUMTRADES",
                        "Сделок",
                        "INTEGER",
                        "9",
                        "Количество заключенных сделок"
                    ],
                    [
                        "IMBALANCE",
                        "Дисбаланс",
                        "INTEGER",
                        "16",
                        "Суммарный объем заявок, которые остались бы неисполненными при завершении аукциона по ожидаемой                     цене"
                    ],
                    [
                        "MARKETVOLB",
                        "Рыночных на покупку",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на покупку по ожидаемой цене, в единицах ценных бумаг"
                    ],
                    [
                        "MARKETVOLS",
                        "Рыночных на продажу",
                        "INTEGER",
                        "16",
                        "Суммарный объем рыночных заявок на продажу, в единицах ценных бумаг"
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявок на покупку (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку на аукционе КП"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявок на продажу (АКП)",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу на аукционе КП"
                    ],
                    [
                        "DPORDERINDICATOR",
                        "Наличие спроса/предложения",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку или продажу на аукционе крупными лотами до данному финасовому                     инструменту"
                    ]
                ],
                "title": "Результаты аукционов (обновляемая)",
                "desc": "Результаты аукционов"
            },
            "BANK": {
                "output": [
                    [
                        "URGENCY",
                        "Важность",
                        "TUrgency",
                        "1",
                        "Срочность или важность сообщения"
                    ],
                    [
                        "FROMUSER",
                        "От кого",
                        "CHAR",
                        "12",
                        "Идентификатор пользователя, отправившего сообщение"
                    ],
                    [
                        "MSGTIME",
                        "Время",
                        "CHAR",
                        "8",
                        "Время, когда было отправлено сообщение"
                    ],
                    [
                        "MSGTEXT",
                        "Текст",
                        "CHAR",
                        "256",
                        "Текст сообщения"
                    ]
                ],
                "title": "Расчетные организации (не обновляемая)",
                "desc": "Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">BANKID</td>                 <td>Расчетная организация</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SHORTNAME</td>                 <td>Наименование</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Краткое наименование расчетной организации</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">BANKNAME</td>                 <td>Полное наименование</td>                 <td>CHAR</td>                 <td align=right>120</td>                 <td>Полное наименование расчетной организации</td>             </tr>         </table>     </ul>     <a name=\"t0_3\"></a>     <h4>BANKACC - Расчетные коды (обновляемая)</h4>     <ul>         Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">BANKACCID</td>                 <td>Расчетный код</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Расчетный код в клиринговой организации</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">FIRMID</td>                 <td>Фирма</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор фирмы</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DESCRIPTION</td>                 <td>Описание</td>                 <td>CHAR</td>                 <td align=right>30</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DEFAULTER</td>                 <td>Дополнительная сессия</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">EARLYSETTLE</td>                 <td>Ранние расчеты</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRADINGCLOSED</td>                 <td>Торги закончены</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">STATUS</td>                 <td>Статус</td>                 <td>                     TStatus</td>                 <td align=right>1</td>                 <td>Индикатор \"торговые/клиринговые операции разрешены/запрещены\"</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CLIENTCODE</td>                 <td>Код клиента</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Код клиента, присвоенный брокером</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td>                 <td>Клиринговая фирма</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор фирмы - Участника Клиринга</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CLEARINGBANKACCID</td>                 <td>Клиринговый расчетный код</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор клирингового расчетного счета в НКЦ</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DETAILS</td>                 <td>Реквизит 1</td>                 <td>CHAR</td>                 <td align=right>20</td>                 <td>Данные о клиенте (ИНН, номер паспорта или другой документ)</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SUBDETAILS</td>                 <td>Реквизит 2</td>                 <td>CHAR</td>                 <td align=right>20</td>                 <td>Данные о клиенте клиента (ИНН, номер паспорта или другой документ)</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">UNIFIEDPOOL</td>                 <td>Единый пул</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">EARLYSETTLETIME</td>                 <td>Время ранних расчетов</td>                 <td>TIME</td>                 <td align=right>6</td>                 <td>Время ранних расчетов</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRADINGCLOSEDTIME</td>                 <td>Время прекращения торгов</td>                 <td>TIME</td>                 <td align=right>6</td>                 <td>Время прекращения торгов</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">COMMBANKACCID</td>                 <td>Расчетный код для списания оборотной комиссии</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор расчетного счета/кода в клиринговой организации для списания оборотной комиссии</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">MORNINGSESSION</td>                 <td>Доступность в утренней сессии</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>Флаг допуска РК для торгов в утренней сессии</td>             </tr>         </table>     </ul>     <a name=\"t0_4\"></a>     <h4>BCMESSAGES - Сообщения (обновляемая)</h4>     <ul>         Таблица содержит информацию о сообщениях, полученных от других участников торгов с момента начала торговой         сессии"
            },
            "BOARDS": {
                "output": [
                    [
                        "BOARDID",
                        "Код режима",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "BOARDNAME",
                        "Режим",
                        "CHAR",
                        "30",
                        "Наименование режима"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка, к которому относится данный режим"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование режима торгов на английском языке"
                    ]
                ],
                "title": "Режимы торгов (обновляемая)",
                "desc": "Таблица содержит информацию о режимах торгов. Под режимом понимается набор правил проведения торгов,         определяющих допустимые типы заявок, регламент торгов, виды расчетов и пр. Каждый режим представлен в таблице         одной строкой."
            },
            "CLIENTCODES": {
                "output": [
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "CLIENTTYPE",
                        "Тип",
                        "CHAR",
                        "2",
                        "Форма идентификации клиента"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "QINVESTOR",
                        "Квалифицированный инвестор",
                        "TYesNo",
                        "1",
                        "Квалифицированный инвестор"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние кода клиента"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "BLOCKCLIENTTE",
                        "Блокировка торгов",
                        "TYesNo",
                        "1",
                        "Флаг блокировки доступа к торгам"
                    ],
                    [
                        "PFIACCESS",
                        "Доступ к ПФИ",
                        "TYesNo",
                        "1",
                        "Допуск к инструментам ПФИ"
                    ]
                ],
                "title": "Клиенты брокера (обновляемая)",
                "desc": "Таблица \"Клиенты брокера\" содержит информацию о кодах клиентов, зарегистрированных в торговой системе ММВБ для         данного брокера"
            },
            "CURRENCY": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "MMID",
                        "ID записи",
                        "CHAR",
                        "12",
                        "Идентификатор записи маркет-мейкинга в ТС"
                    ],
                    [
                        "PARENTMMID",
                        "ID родительской записи",
                        "CHAR",
                        "12",
                        "Идентификатор родительской записи маркет-мейкинга в ТС"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SCHEMANAME",
                        "Схема",
                        "CHAR",
                        "20",
                        "Наименование схемы маркет-мейкинга"
                    ],
                    [
                        "AGREEMENT",
                        "№ договора",
                        "CHAR",
                        "12",
                        "Идентификатор (номер) договора с маркет-мейкером"
                    ],
                    [
                        "AGREEMENTDATE",
                        "Дата договора",
                        "DATE",
                        "8",
                        "Дата подписания договора с маркет-мейкером"
                    ],
                    [
                        "MINSPREADVOLUMEBUY",
                        "МДО 1",
                        "INTEGER",
                        "16",
                        "Минимальный допустимый объем заявки маркет-мейкера в лотах"
                    ],
                    [
                        "MINSPREADVOLUMESELL",
                        "МДО 2",
                        "INTEGER",
                        "16",
                        "Дополнительный минимальный допустимый объем заявки маркет-мейкера в лотах"
                    ],
                    [
                        "MAXTRADESVOLUME",
                        "ДО",
                        "INTEGER",
                        "16",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на                     одностороннее или на освобождение от котирования, в лотах"
                    ],
                    [
                        "MAXTRADESVALUE",
                        "ДО, руб.",
                        "FIXED",
                        "16.2",
                        "Установленный объем сделок, при достижении которого изменяется тип котирования с двухстороннего на                     одностороннее или на освобождение от котирования, руб."
                    ],
                    [
                        "MAXSPREADPERC",
                        "Макс. спрэд 1, %",
                        "FLOAT",
                        "8",
                        "Допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPERC1",
                        "Макс. спрэд 2, %",
                        "FLOAT",
                        "8",
                        "Второй допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPERC2",
                        "Макс. спрэд 3, %",
                        "FLOAT",
                        "8",
                        "Третий допустимый коридор колебания цены в процентах"
                    ],
                    [
                        "MAXSPREADPRICE",
                        "Макс. спрэд",
                        "FLOAT",
                        "17",
                        "Допустимый коридор колебания цены в руб."
                    ],
                    [
                        "MINKEEPPERCENT",
                        "Мин. % исполнения",
                        "FIXED",
                        "9.2",
                        "Минимальный процент исполнения"
                    ],
                    [
                        "CURRENTSPREADPERC",
                        "Спрэд, %",
                        "FLOAT",
                        "8",
                        "Величина текущего спрэда маркет-мейкера в процентах"
                    ],
                    [
                        "CURRENTSPREADPRICE",
                        "Спрэд",
                        "FLOAT",
                        "17",
                        "Величина текущего спрэда маркет-мейкера в руб."
                    ],
                    [
                        "CURRENTMINBUYPRICE",
                        "Лучшая цена покупки",
                        "FLOAT",
                        "17",
                        "Лучшая цена активной лимитированной заявки на покупку"
                    ],
                    [
                        "CURRENTMAXSELLPRICE",
                        "Лучшая цена продажи",
                        "FLOAT",
                        "17",
                        "Лучшая цена активной лимитированной заявки на продажу"
                    ],
                    [
                        "CURRENTALLOWEDBUYPRICE",
                        "Минимум доп.",
                        "FLOAT",
                        "17",
                        "Минимальная допустимая цена активной лимитной заявки на покупку"
                    ],
                    [
                        "CURRENTALLOWEDSELLPRICE",
                        "Максимум доп.",
                        "FLOAT",
                        "17",
                        "Максимальная допустимая цена активной лимитной заявки на продажу"
                    ],
                    [
                        "TOTALBUYVOLUME",
                        "Купля",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на покупку, выраженный в лотах"
                    ],
                    [
                        "TOTALSELLVOLUME",
                        "Продажа",
                        "INTEGER",
                        "16",
                        "Объем активных лимитированных заявок на продажу, выраженный в лотах"
                    ],
                    [
                        "TOTALBREACHTIME",
                        "Время перерыва",
                        "TIME",
                        "6",
                        "Общее время нарушения маркет-мейкером своих обязательств по поддержке котировок"
                    ],
                    [
                        "TOTALKEEPTIME",
                        "Время поддерж.",
                        "TIME",
                        "6",
                        "Общее время выполнения обязательств по МДО и спрэду"
                    ],
                    [
                        "FACTTRADESVOLUME",
                        "Объем",
                        "INTEGER",
                        "16",
                        "Текущий объем заключенных сделок, в лотах"
                    ],
                    [
                        "FACTTRADESVALUE",
                        "Объем, руб.",
                        "FIXED",
                        "16.2",
                        "Текущий объем заключенных сделок, в руб."
                    ],
                    [
                        "FACTKEEPPERCENT",
                        "% исполнения",
                        "FIXED",
                        "9.2",
                        "&nbsp;"
                    ],
                    [
                        "LEFTKEEPTIME",
                        "Оставшееся время до исполнения",
                        "TIME",
                        "6",
                        "Оставшееся время до исполнения обязательств"
                    ],
                    [
                        "UPDATETIME",
                        "Время обновления",
                        "TIME",
                        "6",
                        "Время обновления"
                    ],
                    [
                        "PROCESSED",
                        "Обязат. исполн.",
                        "TYesNo",
                        "1",
                        "Обязательства исполнены"
                    ],
                    [
                        "KEEPSPREADVARIANT",
                        "Тип спрэда",
                        "CHAR",
                        "4",
                        "Тип поддерживаемого спрэда"
                    ]
                ],
                "title": "Справочник валют (не обновляемая)",
                "desc": "Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CURRCODE</td>                 <td>Валюта расчетов</td>                 <td>CHAR</td>                 <td align=right>4</td>                 <td>Код валюты расчетов инструмента</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CURRENCYNAME</td>                 <td>Наименование</td>                 <td>CHAR</td>                 <td align=right>30</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CROSSRATE</td>                 <td>Курс</td>                 <td>FLOAT</td>                 <td align=right>17</td>                 <td>Курс в руб. за единицу валюты с плавающей точкой</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">ASSET</td>                 <td>Актив</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>&nbsp;</td>             </tr>         </table>     </ul>     <a name=\"t0_8\"></a>     <h4>EXT_MMSTATS - Обязательства маркет-мейкера (обновляемая)</h4>     <ul>         В таблице представлена информация по выполнению маркет-мейкером его обязательств"
            },
            "EXT_ORDERBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Цена котировки"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ]
                ],
                "title": "Котировки по инструменту (обновляемая, очищать при обновлении)",
                "desc": "Расширенный вариант таблицы котировок. Таблица содержит информацию о заявках с лучшими ценами и временем         активации (отдельно на покупку и на продажу) по финансовому инструменту.         Каждая строка таблицы соответствует уникальной паре значений времени активации и цены для финансового         инструмента и отражает суммарное количество лотов, выставленных на покупку или продажу по этой цене с данным         временем активации.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "DEPTH",
                        "Глубина котировок",
                        "INTEGER",
                        "2",
                        "Запрашиваемое количество лучших котировок на покупку/продажу по инструменту. Для получения всех                     котировок значение не указывается."
                    ]
                ]
            },
            "FIRMS": {
                "output": [
                    [
                        "FIRMID",
                        "Код фирмы",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "FIRMNAME",
                        "Фирма",
                        "CHAR",
                        "30",
                        "Краткое наименование фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "EXCHANGE",
                        "Биржа",
                        "CHAR",
                        "4",
                        "Идентификатор региональной биржи"
                    ],
                    [
                        "INN",
                        "ИНН",
                        "CHAR",
                        "12",
                        "Индивидуальный номер налогоплательщика"
                    ],
                    [
                        "INLIQUIDATION",
                        "Ликвидационный неттинг",
                        "TYesNo",
                        "1",
                        "В отношении фирмы инициирован ликвидационный неттинг"
                    ],
                    [
                        "CLEARINGACCESS",
                        "Доступ к клирингу",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "TRADINGACCESS",
                        "Доступ к торгам",
                        "TFirmAccess",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "MORNINGSESSION",
                        "Доступность в утренней сессии",
                        "TYesNo",
                        "1",
                        "Флаг допуска фирмы для торгов в утренней сессии"
                    ]
                ],
                "title": "Фирмы (обновляемая)",
                "desc": "Данная таблица содержит информацию о фирмах-участниках торгов.         Каждая фирма представлена одной строкой таблицы."
            },
            "INDEXES": {
                "output": [
                    [
                        "INDEXBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для ценных бумаг, участвующих в расчете индекса"
                    ],
                    [
                        "INDEXCODE",
                        "Код индекса",
                        "CHAR",
                        "12",
                        "Идентификатор биржевого индекса"
                    ],
                    [
                        "NAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса"
                    ],
                    [
                        "SHORTNAME",
                        "Индекс",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "CURRENTVALUE",
                        "Текущий",
                        "FLOAT",
                        "17",
                        "Текущее значение индекса"
                    ],
                    [
                        "LASTVALUE",
                        "Закрытие",
                        "FLOAT",
                        "17",
                        "Последнее значение индекса предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части цены ценной бумаги или производных значений от цены"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование индекса на английском языке"
                    ],
                    [
                        "TIME",
                        "Время вычисления",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "OPENVALUE",
                        "Открытие",
                        "FLOAT",
                        "17",
                        "Значение индекса на открытие текущего торгового дня"
                    ],
                    [
                        "VALTODAY",
                        "Объем торгов",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок по бумагам, входящим в индекс, выраженный в руб."
                    ],
                    [
                        "MIN",
                        "Минимум",
                        "FLOAT",
                        "17",
                        "Минимальное значение индекса"
                    ],
                    [
                        "MAX",
                        "Максимум",
                        "FLOAT",
                        "17",
                        "Максимальное значение индекса"
                    ]
                ],
                "title": "Индексы (обновляемая)",
                "desc": "Таблица содержит интегральные показатели валютного рынка, например, значение бивалютной корзины"
            },
            "INSTRS": {
                "output": [
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "INSTRNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование группы инструментов"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "INSTRTYPE",
                        "Тип инструмента",
                        "TInstrType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "QUOTEBASIS",
                        "Тип курса",
                        "TQuoteBasis",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "INSTRFWD",
                        "\"Длинный\" инструмент",
                        "TYesNo",
                        "1",
                        "Признак того, что данный инструмент является форвардом или \"длинным СВОПом\""
                    ]
                ],
                "title": "Группы финансовых инструментов (обновляемая)",
                "desc": "Таблица содержит информацию о группах однотипных ценных бумаг (например: Акции (1 уровень), Акции (2 уровень),         Внесписочные акции и т.д.)         Каждая группа ценных бумаг представлена в таблице одной строкой."
            },
            "MARKETS": {
                "output": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "MARKETNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование рынка на английском языке"
                    ]
                ],
                "title": "Рынки (обновляемая)",
                "desc": "Таблица содержит информацию о рынках. Под рынком понимается группа режимов торгов, объединенных по         административным признакам (ГЦБ, НГЦБ, РПС)."
            },
            "NEGDEALBOOK": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс котировки"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ]
                ],
                "title": "Котировки внесистемных заявок *Всем (обновляемая, очищать при обновлении)",
                "desc": "Таблица содержит информацию о внесистемных заявках с лучшими ценами (отдельно на покупку и на продажу) по         финансовому инструменту.         Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ]
                ]
            },
            "NEGDEALS": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию внесистемной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило:                     <код клиента>/                         <номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных внесистемных заявок"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами.                     Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "CPUSERALIAS",
                        "Псевдоним адресата",
                        "CHAR",
                        "12",
                        "Псевдоним пользователя, которому адресована заявка"
                    ]
                ],
                "title": "Внесистемные заявки (обновляемая)",
                "desc": "Таблица содержит информацию о внесистемных заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с         начала торговой сессии, для регистрации внесистемных сделок.         Каждая внесистемная заявка представлена в таблице одной строкой."
            },
            "ONENEGDEAL": {
                "output": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "DEALTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в Торговой Системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Статус заявки на регистрацию внесистемной сделки"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило:                     <код клиента>/                         <номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, который ввел заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой была поставлена заявка"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма, которой адресована заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана данная заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных внесистемных заявок"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами.                     Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была подана заявка"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ],
                    [
                        "CPUSERALIAS",
                        "Псевдоним адресата",
                        "CHAR",
                        "12",
                        "Псевдоним пользователя, которому адресована заявка"
                    ]
                ],
                "title": "Информация по внесистемной заявке (обновляемая)",
                "desc": "Таблица состоит из одной строки и содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "DEALNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ONEORDER": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по курсу",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным курсам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью                     удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило:                     <код клиента>/                         <номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, подавший заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ENTRYTYPE",
                        "Тип ввода",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения курса заявки - \"по курсу/по средневзвешенному курсу\""
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами.                     Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VISIBLEBALANCE",
                        "Видимое количество",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части айсберг-заявки, отображаемый в котировках, выраженный в лотах"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент                     постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST                     market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "FLOAT",
                        "17",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ]
                ],
                "title": "Информация по заявке (обновляемая)",
                "desc": "Таблица содержит информацию о заявке с номером, указанным в запросе",
                "input": [
                    [
                        "ORDERNO",
                        "Заявка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ]
                ]
            },
            "ORDERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки"
                    ],
                    [
                        "MKTLIMIT",
                        "Тип",
                        "TMktLimit",
                        "1",
                        "Тип заявки - \"лимитированная/рыночная\""
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "SPLITFLAG",
                        "Тип по курсу",
                        "TSplitFlag",
                        "1",
                        "Модификатор типа заявки - \"разрешить/запретить сделки по разным курсам\""
                    ],
                    [
                        "IMMCANCEL",
                        "Тип по остатку",
                        "TImmCancel",
                        "1",
                        "Модификатор типа заявки - \"поставить в очередь/снять остаток при невозможности полностью                     удовлетворить заявку\""
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило:                     <код клиента>/                         <номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, подавший заявку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой подана заявка"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого подана заявка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "HIDDEN",
                        "Скрыто лотов",
                        "INTEGER",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "BALANCE",
                        "Остаток лотов",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части заявки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем заявки (без учета комиссионного сбора Биржи и % дохода), выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "LINKEDORDER",
                        "Номер измененной заявки",
                        "INTEGER",
                        "12",
                        "Номер заявки, которая была заменена данной заявкой"
                    ],
                    [
                        "ENTRYTYPE",
                        "Тип ввода",
                        "TPriceEntryType",
                        "1",
                        "Индикатор типа ввода значения курса заявки - \"по курсу/по средневзвешенному курсу\""
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торгов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами.                     Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "UPDATETIME",
                        "Время изменения",
                        "TIME",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе"
                    ],
                    [
                        "UPDATE_MICROSECONDS",
                        "Микросекунды времени изменения",
                        "INTEGER",
                        "6",
                        "Время последнего изменения (мэтчинга, снятия) заявки в торговой системе, микросекунды"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации заявки в торговой системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "UPDUSERID",
                        "Участник, изменивший заявку",
                        "CHAR",
                        "12",
                        "Идентификатор участника торгов, изменившего заявку последним"
                    ],
                    [
                        "VISIBLEBALANCE",
                        "Видимое количество",
                        "INTEGER",
                        "16",
                        "Объем неисполненной части айсберг-заявки, отображаемый в котировках, выраженный в лотах"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "INTORDERNO",
                        "Внутренний номер",
                        "INTEGER",
                        "12",
                        "Внутренний идентификационный номер заявки в Торговой Системе, присваиваемый заявке в момент                     постановки в очередь. Используется для идентификации собственной заявки в анонимном потоке FAST                     market data."
                    ],
                    [
                        "ASP",
                        "АСП",
                        "CHAR",
                        "12",
                        "Аналог собственноручной подписи"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Поручение урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что заявка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "INITIALPRICE",
                        "Начальная цена",
                        "FLOAT",
                        "17",
                        "Цена, указанная участником торгов при подаче заявки"
                    ],
                    [
                        "ORDCANCELREASON",
                        "Причина отмены",
                        "TOrderCancelReason",
                        "2",
                        "Причина отмены заявки"
                    ]
                ],
                "title": "Заявки (обновляемая)",
                "desc": "Таблица содержит информацию о заявках, поданных Членом Секции (Членами Секции) в Торговую Систему с начала         торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "PRICEMOVELIMIT": {
                "output": [
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "NUM",
                        "Диапазон",
                        "INTEGER",
                        "1",
                        "Номер диапазона"
                    ],
                    [
                        "LIMITBEGIN",
                        "Начало диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND",
                        "Конец диапазона, шт.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "RTL_RUB",
                        "Нижняя граница курса",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "RTH_RUB",
                        "Верхняя граница курса",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "LIMITBEGIN_RUB",
                        "Начало диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "LIMITEND_RUB",
                        "Конец диапазона, руб.",
                        "FIXED",
                        "16.2",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_L",
                        "Ставка риска падения курса, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "DISCOUNT_H",
                        "Ставка риска роста курса, %",
                        "FIXED",
                        "6.3",
                        "&nbsp;"
                    ],
                    [
                        "RCRUB",
                        "Центральный курс",
                        "FLOAT",
                        "16",
                        "&nbsp;"
                    ],
                    [
                        "CHANGETIME",
                        "Время изменения ставок риска",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ]
                ],
                "title": "Ценовые границы (не обновляемая)",
                "desc": "<table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Входное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SECBOARD</td>                 <td>Режим</td>                 <td>CHAR</td>                 <td align=right>4</td>                 <td>Идентификатор режима торгов для финансового инструмента</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SECCODE</td>                 <td>Инструмент</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор финансового инструмента</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SETTLECODE</td>                 <td>Код расчетов</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Код расчетов по сделке</td>             </tr>         </table>",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "UPPERLIMIT",
                        "Верхняя граница",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "LOWERLIMIT",
                        "Нижняя граница",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ]
                ]
            },
            "SECTRANSFERS": {
                "output": [
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер заявки на перевод в Торговой Системе"
                    ],
                    [
                        "ORDERTIME",
                        "Время заявки",
                        "TIME",
                        "6",
                        "Время регистрации заявки на перевод в торговой системе"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TOrderStatus",
                        "1",
                        "Текущий статус заявки на перевод"
                    ],
                    [
                        "BUYSELL",
                        "З/С",
                        "TSecTransferBuySell",
                        "1",
                        "Направленность перевода:                     \"покупка\" - зачисление на счет,                     \"продажа\" - списание со счета."
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило:                     <код клиента>/                         <номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, подавший заявку на перевод"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой подана заявка на перевод"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма, которой адресована заявка на перевод"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем, выраженный в лотах"
                    ],
                    [
                        "MATCHREF",
                        "Ссылка",
                        "CHAR",
                        "10",
                        "Текст-связка для однозначного соответствия двух встречных переводов"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем перевода, выраженный в валюте расчетов"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами.                     Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "WITHDRAWTIME",
                        "Время снятия",
                        "TIME",
                        "6",
                        "&nbsp;"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ]
                ],
                "title": "Заявки на перевод (обновляемая)",
                "desc": "Таблица содержит текущую информацию о заявках на перевод ценных бумаг или денег, поданных Членом Секции в         Торговую Систему с начала торговой сессии. Каждая заявка представлена в таблице одной строкой."
            },
            "SECURITIES": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Код инструмента",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SECNAME",
                        "Наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента"
                    ],
                    [
                        "REMARKS",
                        "Примечание",
                        "CHAR",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "SHORTNAME",
                        "Инструмент",
                        "CHAR",
                        "10",
                        "&nbsp;"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TSecStatus",
                        "1",
                        "Индикатор \"торговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADINGSTATUS",
                        "Состояние",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту"
                    ],
                    [
                        "MARKETCODE",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка на котором торгуется финансовый инструмент"
                    ],
                    [
                        "INSTRID",
                        "Группа инструментов",
                        "CHAR",
                        "4",
                        "Идентификатор группы инструментов"
                    ],
                    [
                        "LOTSIZE",
                        "Размер лота",
                        "INTEGER",
                        "8",
                        "Количество валюты в одном стандартном лоте"
                    ],
                    [
                        "MINSTEP",
                        "Мин. шаг курса заявок",
                        "FLOAT",
                        "17",
                        "Минимально возможная разница между курсами, указанными в заявках на покупку/продажу ценных бумаг                     (кроме заявок \"со средневзвешенной ценой\")"
                    ],
                    [
                        "FACEVALUE",
                        "Номинал",
                        "FLOAT",
                        "17",
                        "Установленное количество инструмента, для которого указывается курс в котировках"
                    ],
                    [
                        "FACEUNIT",
                        "Валюта инструмента",
                        "CHAR",
                        "4",
                        "Валюта, в которой выражен номинал инструмента"
                    ],
                    [
                        "PREVPRICE",
                        "Последняя предыдущего дня",
                        "FLOAT",
                        "17",
                        "Курс последней сделки предыдущего торгового дня"
                    ],
                    [
                        "DECIMALS",
                        "Кол-во десят. знаков",
                        "INTEGER",
                        "2",
                        "Количество десятичных знаков дробной части цены ценной бумаги или производных значений от цены"
                    ],
                    [
                        "PREVWAPRICE",
                        "Оценка пред. дня",
                        "FLOAT",
                        "17",
                        "Значение оценки предыдущего торгового дня"
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "LATNAME",
                        "Англ. наименование",
                        "CHAR",
                        "30",
                        "Наименование финансового инструмента на английском языке"
                    ],
                    [
                        "PREVLOTSIZE",
                        "Предыдущий размер лота",
                        "INTEGER",
                        "8",
                        "Предыдущее значение размера лота"
                    ],
                    [
                        "LOTSIZECHANGEDATE",
                        "Дата последнего изменения размера лота",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "ORIGINTRADINGSTATUS",
                        "Состояние сессии",
                        "TTradingStatus",
                        "1",
                        "Индикатор состояния торговой сессии по инструменту. Во время перерыва показывает действительное                     состояние торговой сесии (никогда не принимает значение \"Перерыв\")."
                    ],
                    [
                        "ASSET",
                        "Актив",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "LOTDIVIDER",
                        "Коэффициент дробления",
                        "INTEGER",
                        "8",
                        "Коэффициент дробления ценной бумаги в одном стандартном лоте. Указывает на торговлю 1/LotDivider                     частями от LotSize. Например, LotSize=1 и LotDivider=100 в комбинации с USD/RUB означает торговлю                     частями по 1 центу."
                    ],
                    [
                        "BID",
                        "Спрос",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ],
                    [
                        "OPEN",
                        "Первая",
                        "FLOAT",
                        "17",
                        "Курс первой сделки"
                    ],
                    [
                        "HIGH",
                        "Максимум",
                        "FLOAT",
                        "17",
                        "Максимальный курс сделки"
                    ],
                    [
                        "LOW",
                        "Минимум",
                        "FLOAT",
                        "17",
                        "Минимальный курс сделки"
                    ],
                    [
                        "LAST",
                        "Последняя",
                        "FLOAT",
                        "17",
                        "Курс последней сделки"
                    ],
                    [
                        "CHANGE",
                        "К закрытию",
                        "FLOAT",
                        "17",
                        "Изменение курса последней сделки по отношению к курсу последней сделки предыдущего торгового дня"
                    ],
                    [
                        "QTY",
                        "Лотов в последней",
                        "INTEGER",
                        "16",
                        "Объем последней сделки, в лотах"
                    ],
                    [
                        "TIME",
                        "Время последней",
                        "TIME",
                        "6",
                        "Время заключения последней сделки"
                    ],
                    [
                        "VOLTODAY",
                        "Объем в валюте инструмента",
                        "FLOAT",
                        "17",
                        "Объем совершенных сделок, выраженный в валюте финансового инструмента"
                    ],
                    [
                        "VALTODAY",
                        "Объем за сегодня",
                        "INTEGER",
                        "16",
                        "Объем совершенных сделок, выраженный в валюте расчетов"
                    ],
                    [
                        "VALUE",
                        "Объем в последней",
                        "FIXED",
                        "16.2",
                        "Объем последней сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "WAPRICE",
                        "Оценка",
                        "FLOAT",
                        "17",
                        "Средневзвешенный курс"
                    ],
                    [
                        "HIGHBID",
                        "Лучший спрос",
                        "FLOAT",
                        "17",
                        "Наибольший курс спроса в течение торговой сессии"
                    ],
                    [
                        "LOWOFFER",
                        "Лучшее предложение",
                        "FLOAT",
                        "17",
                        "Наименьший курс предложения в течение торговой сессии"
                    ],
                    [
                        "NUMTRADES",
                        "Сделок за сегодня",
                        "INTEGER",
                        "9",
                        "Количество сделок за торговый день"
                    ],
                    [
                        "PRICEMINUSPREVWAPRICE",
                        "К оценке пред. дня",
                        "FLOAT",
                        "17",
                        "Курс последней сделки к оценке предыдущего дня"
                    ],
                    [
                        "CLOSEPRICE",
                        "Срвзв. курс 11:30",
                        "FLOAT",
                        "17",
                        "Курс периода закрытия"
                    ],
                    [
                        "NUMNEGDEALS",
                        "Внесистемных сделок",
                        "INTEGER",
                        "9",
                        "Количество внесистемных сделок за торговый день"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "MARKETPRICE",
                        "Вчерашний фиксинг",
                        "FLOAT",
                        "17",
                        "Фиксинг МБ (рассчитанный вчера)"
                    ],
                    [
                        "MARKETPRICETODAY",
                        "Текущий фиксинг",
                        "FLOAT",
                        "17",
                        "Значение курса, полученное по методике оценки ликвидности в стакане и сделок за секундный интервал"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по умолчанию для данного инструмента"
                    ],
                    [
                        "LOPENPRICE",
                        "Оценка с 10:00 до 11:30",
                        "FLOAT",
                        "17",
                        "Средневзвешенная цена сделок, заключенных в период с 10:00 до 11:30"
                    ],
                    [
                        "MARKETPRICE2",
                        "Фиксинг МБ",
                        "FLOAT",
                        "17",
                        "Среднее значение FX fixing Curr, рассчитанное с 12:25:01 по 12:30:00"
                    ],
                    [
                        "ADMITTEDQUOTE",
                        "Международный фиксинг",
                        "FLOAT",
                        "17",
                        "Арифметическое среднее FX fixing ME и FX fixing EBS"
                    ],
                    [
                        "DPVALINDICATORBUY",
                        "Заявки на покупку WAP",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на покупку в режиме средневзвешенных сделок"
                    ],
                    [
                        "DPVALINDICATORSELL",
                        "Заявки на продажу WAP",
                        "TDPValIndicator",
                        "1",
                        "Индикатор наличия заявок на продажу в режиме средневзвешенных сделок"
                    ],
                    [
                        "SETTLEDATE1",
                        "Дата расчетов 1",
                        "DATE",
                        "8",
                        "Дата расчетов по сделке или первой части сделки РЕПО/своп"
                    ],
                    [
                        "SETTLEDATE2",
                        "Дата расчетов 2",
                        "DATE",
                        "8",
                        "Дата расчетов второй части сделки РЕПО/своп"
                    ]
                ],
                "title": "Финансовые инструменты (обновляемая)",
                "desc": "Таблица содержит текущую биржевую информацию о финансовых инструментах, относящихся к различным режимам торгов.         Каждая строка таблицы соответствует уникальной паре режим торгов - финансовый инструмент.",
                "input": [
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов"
                    ]
                ]
            },
            "SEC_SETTLECODE": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "REPOTERM",
                        "Срок РЕПО",
                        "INTEGER",
                        "4",
                        "Срок РЕПО - промежуток времени, выраженный в календарных днях, между датами исполнения первой и                     второй частей сделки РЕПО. Срок РЕПО исчисляется со дня, следующего за днем исполнения первой части                     сделки РЕПО, до дня исполнения второй части сделки РЕПО включительно."
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "TRANSFERSONLY",
                        "Только переводы",
                        "TYesNo",
                        "1",
                        "Разрешены только переводы"
                    ]
                ],
                "title": "Коды расчетов для инструмента (обновляемая)",
                "desc": "По данному запросу, Торговая система предоставляет информацию по допустимым кодам расчетов для заданного         инструмента и соответствующим датам расчетов",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "SEC_SETTLECODE_STATS": {
                "output": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "BID",
                        "Спрос",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на покупку"
                    ],
                    [
                        "OFFER",
                        "Предложение",
                        "FLOAT",
                        "17",
                        "Лучшая котировка на продажу"
                    ],
                    [
                        "BIDDEPTH",
                        "Лотов на покупку по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на покупку по лучшей котировке, выраженный в единицах ценных бумаг"
                    ],
                    [
                        "OFFERDEPTH",
                        "Лотов на продажу по лучшей",
                        "INTEGER",
                        "16",
                        "Объем заявок на продажу по лучшей котировке, выраженный в лотах"
                    ],
                    [
                        "BIDDEPTHT",
                        "Совокупный спрос",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на покупку в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "OFFERDEPTHT",
                        "Совокупное предложение",
                        "INTEGER",
                        "16",
                        "Объем всех заявок на продажу в очереди Торговой Системы, выраженный в лотах"
                    ],
                    [
                        "NUMBIDS",
                        "Заявок на покупку",
                        "INTEGER",
                        "6",
                        "Количество заявок на покупку в очереди Торговой системы"
                    ],
                    [
                        "NUMOFFERS",
                        "Заявок на продажу",
                        "INTEGER",
                        "6",
                        "Количество заявок на продажу в очереди Торговой системы"
                    ]
                ],
                "title": "Лучшие котировки внебиржевых заявок *Всем (обновляемая)",
                "desc": "Таблица содержит информацию о внесистемных заявках с лучшими ценами (отдельно на покупку и на продажу) по         финансовому инструменту.         Запрос осуществляется в двух вариантах, либо с указанием BoardID, либо с указанием SecBoard+SecCode.",
                "input": [
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ]
            },
            "SETTLECODES": {
                "output": [
                    [
                        "SESSION",
                        "Номер старта",
                        "INTEGER",
                        "10",
                        "Уникальный номер старта Торговой системы"
                    ],
                    [
                        "TEVERSION",
                        "Версия",
                        "CHAR",
                        "10",
                        "Номер версии торговой/клиринговой системы"
                    ],
                    [
                        "SYSTEMID",
                        "Тип",
                        "TSystemID",
                        "1",
                        "Тип торговой/клиринговой системы"
                    ],
                    [
                        "TESTSYSTEM",
                        "Тестовая система",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ]
                ],
                "title": "Коды расчетов (не обновляемая)",
                "desc": "Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SETTLECODE</td>                 <td>Код расчетов</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Код расчетов по сделке</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DESCRIPTION</td>                 <td>Описание</td>                 <td>CHAR</td>                 <td align=right>30</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">SETTLEDATE</td>                 <td>Дата расчетов</td>                 <td>DATE</td>                 <td align=right>8</td>                 <td>Дата расчетов сделки</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">FIXINGDATE</td>                 <td>Дата фиксинга</td>                 <td>DATE</td>                 <td align=right>8</td>                 <td>Дата фиксинга</td>             </tr>         </table>     </ul>     <a name=\"t0_26\"></a>     <h4>STATS - Параметры торговой системы (не обновляемая)</h4>     <ul>         Таблица состоит из одной строки и содержит информацию о параметрах торговой системы"
            },
            "STOPLIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "DETAILS",
                        "Реквизит 1",
                        "CHAR",
                        "20",
                        "Данные о клиенте (ИНН, номер паспорта или другой документ)"
                    ],
                    [
                        "SUBDETAILS",
                        "Реквизит 2",
                        "CHAR",
                        "20",
                        "Данные о клиенте клиента (ИНН, номер паспорта или другой документ)"
                    ]
                ],
                "title": "Стоп-листы фирм (обновляемая)",
                "desc": "Таблица содержит информацию о клиентах, находящихся под санкциями"
            },
            "TESYSTIME": {
                "output": [
                    [
                        "TIME",
                        "Текущее время",
                        "TIME",
                        "6",
                        "Текущее время торгового/клирингового сервера"
                    ],
                    [
                        "DATE",
                        "Дата",
                        "DATE",
                        "8",
                        "Текущая дата торгового/клирингового сервера"
                    ],
                    [
                        "TOMORROWDATE",
                        "Дата следующих торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Текущее время торгового/клирингового сервера, микросекунды"
                    ]
                ],
                "title": "Системное время торгового сервера (обновляемая, очищать при обновлении)",
                "desc": "Таблица состоит из одной строки и содержит информацию о текущем времени торгового сервера. Используется для         синхронизации времени на клиентском рабочем месте с временем торгового сервера."
            },
            "TRADES": {
                "output": [
                    [
                        "TRADENO",
                        "Сделка №",
                        "INTEGER",
                        "12",
                        "Идентификационный номер сделки в Торговой Системе"
                    ],
                    [
                        "ORDERNO",
                        "Заявка №",
                        "INTEGER",
                        "12",
                        "Номер заявки, на основании которой заключена сделка"
                    ],
                    [
                        "TRADETIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время регистрации сделки в Торговой Системе"
                    ],
                    [
                        "BUYSELL",
                        "К/П",
                        "TBuySell",
                        "1",
                        "Направленность заявки:                     B - Купля                     S - Продажа                     Для СВОП-заявок:                     B - Продажа/Купля                     S - Купля/Продажа"
                    ],
                    [
                        "BROKERREF",
                        "Примечание",
                        "CHAR",
                        "20",
                        "Дополнительная справочная информация (заполняется трейдером) - как правило:                     <код клиента>/                         <номер поручения>"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "Трейдер, совершивший сделку"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Фирма, от имени которой была совершена сделка"
                    ],
                    [
                        "CPFIRMID",
                        "Контрагент",
                        "CHAR",
                        "12",
                        "Фирма - котрагент сделки"
                    ],
                    [
                        "ACCOUNT",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Торговый счет, в счет которого заключена данная сделка"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICE",
                        "Курс",
                        "FLOAT",
                        "17",
                        "Курс валютного инструмента"
                    ],
                    [
                        "QUANTITY",
                        "Лоты",
                        "INTEGER",
                        "16",
                        "Объем сделки, выраженный в лотах"
                    ],
                    [
                        "VALUE",
                        "Объем",
                        "FIXED",
                        "16.2",
                        "Объем сделки, выраженный в валюте расчетов"
                    ],
                    [
                        "SETTLEDATE",
                        "Дата расчетов",
                        "DATE",
                        "8",
                        "Дата расчетов сделки"
                    ],
                    [
                        "PERIOD",
                        "Период",
                        "TPeriod",
                        "1",
                        "Период торговой сессии, когда была заключена сделка"
                    ],
                    [
                        "SETTLECODE",
                        "Код расчетов",
                        "CHAR",
                        "12",
                        "Код расчетов по сделке"
                    ],
                    [
                        "TRADETYPE",
                        "Тип",
                        "TTradeType",
                        "1",
                        "Тип сделки"
                    ],
                    [
                        "EXTREF",
                        "Код внешнего пользователя",
                        "CHAR",
                        "12",
                        "Поле-примечание, используется для обратной связи с внешними системами.                     Например, идентификатор пользователя внешней системы, поставившего заявку."
                    ],
                    [
                        "COMMISSION",
                        "Комиссия суммарная",
                        "FIXED",
                        "16.2",
                        "Объем комиссии по сделке, руб."
                    ],
                    [
                        "REPORATE",
                        "Ставка, %",
                        "FLOAT",
                        "17",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGCENTERCOMM",
                        "Комиссия за клиринг",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения за клиринговые услуги, руб."
                    ],
                    [
                        "EXCHANGECOMM",
                        "Комиссия за торги",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения биржи, руб."
                    ],
                    [
                        "TRADINGSYSTEMCOMM",
                        "Комиссия за тех. доступ",
                        "FIXED",
                        "16.2",
                        "Объем комиссионного вознаграждения Технического центра, руб."
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Краткий код клиента, указанный при подаче Участником торгов заявки на заключение сделки"
                    ],
                    [
                        "MICROSECONDS",
                        "Микросекунды",
                        "INTEGER",
                        "6",
                        "Время регистрации сделки в Торговой Системе, микросекунды"
                    ],
                    [
                        "BANKACCID",
                        "Расчетный код",
                        "CHAR",
                        "12",
                        "Расчетный код в клиринговой организации"
                    ],
                    [
                        "BASEPRICE",
                        "Базовый курс",
                        "FLOAT",
                        "17",
                        "Базовый курс может быть указан во внесистемных заявках по инструментам СВОП"
                    ],
                    [
                        "PARENTTRADENO",
                        "Витринная сделка",
                        "INTEGER",
                        "12",
                        "Идентификационный номер витринной сделки в Торговой Системе для сделок СВОП"
                    ],
                    [
                        "HIDDENQTYORDER",
                        "Сделка по айсберг-заявке",
                        "TYesNo",
                        "1",
                        "Принимает значение 'Y'/'N'. Поле содержит 'Y' если сделка была заключена на основании                     айсберг-заявки."
                    ],
                    [
                        "CURRENCYID",
                        "Валюта расчетов",
                        "CHAR",
                        "4",
                        "Валюта расчетов по инструменту"
                    ],
                    [
                        "SYSTEMREF",
                        "Системная ссылка",
                        "CHAR",
                        "12",
                        "Дополнительная информация, передаваемая торговой системой"
                    ],
                    [
                        "BANKID",
                        "Расчетная организация",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRADEDATE",
                        "Дата торгов",
                        "DATE",
                        "8",
                        "&nbsp;"
                    ],
                    [
                        "CLEARINGFIRMID",
                        "Клиринговая фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы - Участника Клиринга"
                    ],
                    [
                        "CLEARINGBANKACCID",
                        "Клиринговый расчетный код",
                        "CHAR",
                        "12",
                        "Идентификатор клирингового расчетного счета в НКЦ"
                    ],
                    [
                        "MAKERFLAG",
                        "Активная/Пассивная",
                        "TMakerTaker",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "CPORDERNO",
                        "Встречная заявка внесистемной сделки",
                        "INTEGER",
                        "12",
                        "Идентификационный номер встречной заявки в Торговой Системе (только для сделок в внесистемном                     режиме)"
                    ],
                    [
                        "TRANINFO",
                        "Информация о переводе",
                        "CHAR",
                        "210",
                        "&nbsp;"
                    ],
                    [
                        "SETTLELIABILITYFLAG",
                        "Сделка урегулирования",
                        "TTradeSettleLiabilityFlag",
                        "1",
                        "Отметка о том, что сделка является поручением урегулирования обязательств между УК и УТ"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTradeStatus",
                        "1",
                        "Статус сделки"
                    ],
                    [
                        "TRANTYPE",
                        "Код операции",
                        "CHAR",
                        "4",
                        "Информация об операции"
                    ],
                    [
                        "FIXINGDATE",
                        "Дата фиксинга",
                        "DATE",
                        "8",
                        "Дата фиксинга"
                    ],
                    [
                        "CLEARINGTRDACCID",
                        "Клиринговый счет",
                        "CHAR",
                        "12",
                        "Номер клирингового счета"
                    ]
                ],
                "title": "Сделки (обновляемая)",
                "desc": "Таблица содержит информацию о сделках на покупку/продажу, заключенных Членом Секции (Членами Секции) с начала         торговой сессии. Каждая сделка представлена в таблице одной строкой."
            },
            "TRADETIME": {
                "output": [
                    [
                        "TIME",
                        "Время",
                        "TIME",
                        "6",
                        "Время наступления события"
                    ],
                    [
                        "MARKETID",
                        "Рынок",
                        "CHAR",
                        "4",
                        "Идентификатор рынка"
                    ],
                    [
                        "INSTRID",
                        "Группа",
                        "CHAR",
                        "4",
                        "Идентификатор группы финансовых инструментов, для которой определено событие"
                    ],
                    [
                        "BOARDID",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима финансовых инструментов, для которого определено событие"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "TYPE",
                        "Событие",
                        "CHAR",
                        "2",
                        "Тип события.                     Все типы событий перечислены в таблице TRDTIMETYPES"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TTimeStatus",
                        "1",
                        "Признак - наступило событие или еще нет"
                    ]
                ],
                "title": "Расписание торгов (обновляемая)",
                "desc": "Таблица содержит информацию о временных событиях, соответствующих изменению состояния торгов"
            },
            "TRANTYPES": {
                "output": [
                    [
                        "TYPE",
                        "Группа событий",
                        "CHAR",
                        "1",
                        "Группа событий"
                    ],
                    [
                        "NAME",
                        "Наименование группы",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий"
                    ],
                    [
                        "LATNAME",
                        "Английское наименование",
                        "CHAR",
                        "32",
                        "Наименование группы торговых событий на английском языке"
                    ]
                ],
                "title": "Типы переводов (не обновляемая)",
                "desc": "Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRANTYPE</td>                 <td>Код операции</td>                 <td>CHAR</td>                 <td align=right>4</td>                 <td>Информация об операции</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DESCRIPTION</td>                 <td>Описание</td>                 <td>CHAR</td>                 <td align=right>255</td>                 <td>Описание типа перевода</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td>                 <td>Англ. Описание</td>                 <td>CHAR</td>                 <td align=right>255</td>                 <td>Описание типа перевода на английском языке</td>             </tr>         </table>     </ul>     <a name=\"t0_32\"></a>     <h4>TRDACC - Торговые счета (обновляемая)</h4>     <ul>         Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRDACCID</td>                 <td>Торговый счет</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Номер торгового счета</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TYPE</td>                 <td>Тип депозитарного счета</td>                 <td>                     TDepAccType</td>                 <td align=right>1</td>                 <td>Тип депозитарного счета</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">FIRMID</td>                 <td>Фирма</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор фирмы</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DESCRIPTION</td>                 <td>Описание</td>                 <td>CHAR</td>                 <td align=right>30</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">BANKACCID</td>                 <td>Расчетный код</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Код дополнительной позиции по денежным средствам</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">STATUS</td>                 <td>Статус</td>                 <td>                     TTrdAccStatus</td>                 <td align=right>1</td>                 <td>Индикатор \"торговые операции разрешены/запрещены\"</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td>                 <td>Тип торгового счета</td>                 <td>CHAR</td>                 <td align=right>1</td>                 <td>Тип торгового счета</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CLEARINGTRDACCID</td>                 <td>Клиринговый счет</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Номер клирингового счета</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CLEARINGFIRMID</td>                 <td>Клиринговая фирма</td>                 <td>CHAR</td>                 <td align=right>12</td>                 <td>Идентификатор фирмы - Участника Клиринга</td>             </tr>         </table>     </ul>     <a name=\"t0_33\"></a>     <h4>TRDACCTYPES - Список типов торгово-клиринговых счетов (не обновляемая)</h4>     <ul>         Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRDACCTYPE</td>                 <td>Тип торгового счета</td>                 <td>CHAR</td>                 <td align=right>1</td>                 <td>Тип торгового счета</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">NAME</td>                 <td>Имя</td>                 <td>CHAR</td>                 <td align=right>30</td>                 <td>Наименование типа</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">LATNAME</td>                 <td>Англ. наименование</td>                 <td>CHAR</td>                 <td align=right>30</td>                 <td>Наименование типа на английском языке</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">OWN</td>                 <td>Собственный счет (Да/Нет)</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">CLIENT</td>                 <td>Клиентский счет (Да/Нет)</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TRUST</td>                 <td>Доверительное управление (Да/Нет)</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">ISSUING</td>                 <td>Эмиссионный счет (Да/Нет)</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TREASURY</td>                 <td>Казначейский счет (Да/Нет)</td>                 <td>                     TYesNo</td>                 <td align=right>1</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DESCRIPTION</td>                 <td>Описание</td>                 <td>CHAR</td>                 <td align=right>128</td>                 <td>Описание типа</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">LATDESCRIPTION</td>                 <td>Англ. Описание</td>                 <td>CHAR</td>                 <td align=right>128</td>                 <td>Описание типа на английском языке</td>             </tr>         </table>     </ul>     <a name=\"t0_34\"></a>     <h4>TRDTIMEGROUPS - Группы событий (не обновляемая)</h4>     <ul>         Группы событий используемых в расписании"
            },
            "TRDTIMETYPES": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для группы"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ]
                ],
                "title": "Типы событий расписания торгов (не обновляемая)",
                "desc": "Входных полей нет<br>         <table cellspacing=1 cellpadding=1 border=0 width=90%>             <tr bgcolor=\"#c0c0c0\">                 <td width=15%>Выходное поле</td>                 <td width=20%>Описание</td>                 <td width=7%>Тип</td>                 <td width=5% align=right>Размер</td>                 <td>Примечание</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">TYPE</td>                 <td>Тип события</td>                 <td>CHAR</td>                 <td align=right>2</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">DESCRIPTION</td>                 <td>Описание</td>                 <td>CHAR</td>                 <td align=right>50</td>                 <td>&nbsp;</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">GROUPTYPE</td>                 <td>Группа</td>                 <td>CHAR</td>                 <td align=right>1</td>                 <td>Тип группы событий</td>             </tr>             <tr bgcolor=\"#f0f0f0\">                 <td bgcolor=\"#e0e0e0\">LAT_DESCRIPTION</td>                 <td>Английский</td>                 <td>CHAR</td>                 <td align=right>50</td>                 <td>Описание на английском языке</td>             </tr>         </table>     </ul>     <a name=\"t0_36\"></a>     <h4>USERGROUPS - Группы пользователей (обновляемая)</h4>     <ul>         Таблица содержит информацию о группах пользователей.",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ]
                ]
            },
            "USERS": {
                "output": [
                    [
                        "USERID",
                        "Код участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "USERNAME",
                        "Участник",
                        "CHAR",
                        "30",
                        "&nbsp;"
                    ],
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "STATUS",
                        "Статус",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\""
                    ],
                    [
                        "TRADING",
                        "Торговые/клиринговые операции",
                        "TStatus",
                        "1",
                        "Индикатор \"торговые/клиринговые операции разрешены/запрещены\" управляющим фирмы"
                    ],
                    [
                        "USERGROUP",
                        "Группа",
                        "CHAR",
                        "12",
                        "Идентификатор группы, которой принадлежит пользователь"
                    ],
                    [
                        "CODMODESUBSCR",
                        "COD-подписка",
                        "TCodMode",
                        "1",
                        "Тип подписки на COD-режим. COD-режим - Cancel on Disconnect - режим снятия заявок при потере                     соединения с ТС или при отключении от ТС. Доступные режимы: \"Не используется\", \"Всегда\" и \"По                     требованию\""
                    ],
                    [
                        "CODMODE",
                        "COD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Disconnect)."
                    ],
                    [
                        "MASTERUSER1",
                        "Мастер ID 1",
                        "CHAR",
                        "12",
                        "Первый Мастер User ID для SMA-доступа"
                    ],
                    [
                        "MASTERUSER2",
                        "Мастер ID 2",
                        "CHAR",
                        "12",
                        "Второй Мастер User ID для SMA-доступа"
                    ],
                    [
                        "CODMODE_DC",
                        "CODCD-режим",
                        "TOnOff",
                        "1",
                        "Индикатор работы в COD-режиме (Cancel on Drop-Copy Disconnect)."
                    ],
                    [
                        "MASTERUSERFLAG",
                        "Мастер",
                        "TYesNo",
                        "1",
                        "Идентификатор является контролирующим Мастер Идентификатором (SMA-доступ)"
                    ],
                    [
                        "RESTRICTIONON",
                        "Ограничения",
                        "TYesNo",
                        "1",
                        "Флаг проверки ограничений, установленных для пользователя"
                    ],
                    [
                        "SECUNIQACCESSTYPE",
                        "Доступ по кодам инструментов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по кодам инструментов"
                    ],
                    [
                        "BOARDACCESSTYPE",
                        "Доступ по режимам торгов",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по режимам торгов"
                    ],
                    [
                        "SECACCESSTYPE",
                        "Доступ по инструментам",
                        "TUAccessListType",
                        "1",
                        "Тип списка доступа по инструментам на режимах торгов"
                    ],
                    [
                        "TRATELIMIT",
                        "Частота транзакций",
                        "INTEGER",
                        "6",
                        "Ограничение на количество транзакций в специфицированном временном интервале"
                    ],
                    [
                        "USERALIAS",
                        "Псевдоним участника",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "PWDCNG_ON_LOGON",
                        "Смена пароля при входе",
                        "TYesNo",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "IPGATEWAY",
                        "Сервер доступа",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "IPCLIENT",
                        "Рабочая станция",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ],
                    [
                        "LOGGEDON",
                        "Активен",
                        "TBoolInt",
                        "1",
                        "Индикатор информирующий, что пользователь в настоящий момент подключен системе"
                    ],
                    [
                        "EXTIPCLIENT",
                        "Внешний адрес",
                        "CHAR",
                        "20",
                        "&nbsp;"
                    ]
                ],
                "title": "Пользователи (обновляемая)",
                "desc": "Таблица содержит информацию о пользователях, в том числе технологических, выделенных для фирмы-участника торгов         и/или клиринга. Каждый пользователь представлен в таблице одной строкой."
            },
            "USER_CLIENT": {
                "output": [
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "CLIENTCODE",
                        "Код клиента",
                        "CHAR",
                        "12",
                        "Код клиента, присвоенный брокером"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Привязка пользователей к кодам клиентов (обновляемая)",
                "desc": "Привязка пользователей к кодам клиентов"
            },
            "USER_TRDACC": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "USERID",
                        "Участник",
                        "CHAR",
                        "12",
                        "&nbsp;"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ]
                ],
                "title": "Трейдер-счет (не обновляемая)",
                "desc": "Привязка идентификаторов пользователей к торговым счетам"
            },
            "U_BOARD_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Чёрный список режимов торгов (обновляемая)",
                "desc": "Cписок недоступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_BOARD_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ]
                ],
                "title": "Белый список режимов торгов (обновляемая)",
                "desc": "Список доступных режимов торгов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_HOLD_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "INTEGER",
                        "16",
                        "Ограничение плановой позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "INTEGER",
                        "16",
                        "Текущая плановая позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Ограничение плановой нетто-позиции по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на покупку (длинная позиция)"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "INTEGER",
                        "16",
                        "Текущая плановая нетто-позиция по финансовому инструменту на продажу (короткая позиция)"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения позиции по бумагам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в ценных         бумагах) внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_ORDER_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ],
                    [
                        "PRICEBOUNDUP",
                        "Отклонение цены вверх",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вверх (в процентах от текущей цены)"
                    ],
                    [
                        "PRICEBOUNDDOWN",
                        "Отклонение цены вниз",
                        "FIXED",
                        "9.2",
                        "Величина допустимого отклонения цены в заявке вниз (в процентах от текущей цены)"
                    ],
                    [
                        "MAXQTY",
                        "Максимальное количество в заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в заявке"
                    ],
                    [
                        "MAXORDERVAL",
                        "Максимальный объем заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXMKTQTY",
                        "Максимальное количество в рыночной заявке",
                        "INTEGER",
                        "16",
                        "Максимальное количество ценных бумаг в рыночной заявке"
                    ],
                    [
                        "MAXMKTORDERVAL",
                        "Максимальный объем рыночной заявки",
                        "FIXED",
                        "16.2",
                        "Максимальный объем рыночной заявки, выраженный в валюте расчетов"
                    ],
                    [
                        "MAXORDVALTODAY",
                        "Максимальная сумма заявок",
                        "FIXED",
                        "16.2",
                        "Максимальная сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "CURORDVALTODAY",
                        "Текущая сумма заявок",
                        "FIXED",
                        "16.2",
                        "Текущая сумма заявок за торговый день, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения по заявкам (обновляемая)",
                "desc": "Ограничения пользователя по заявкам",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_POSN_LIMITS": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "TRDACCID",
                        "Торговый счет",
                        "CHAR",
                        "12",
                        "Номер торгового счета"
                    ],
                    [
                        "PLANNEDLIMITBUY",
                        "Ограничение на покупку",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDLIMITSELL",
                        "Ограничение на продажу",
                        "FIXED",
                        "16.2",
                        "Максимальная позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDBUY",
                        "Плановая на покупку",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDSELL",
                        "Плановая на продажу",
                        "FIXED",
                        "16.2",
                        "Текущая плановая позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOLIMITBUY",
                        "Ограничение на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на покупку"
                    ],
                    [
                        "PLANNEDNETTOLIMITSELL",
                        "Ограничение на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Максимальная нетто-позиция в деньгах (руб.) в заявках на продажу"
                    ],
                    [
                        "PLANNEDNETTOBUY",
                        "Плановая на покупку (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на покупку, выраженная в валюте расчетов"
                    ],
                    [
                        "PLANNEDNETTOSELL",
                        "Плановая на продажу (нетто)",
                        "FIXED",
                        "16.2",
                        "Текущая плановая нетто-позиция в заявках на продажу, выраженная в валюте расчетов"
                    ],
                    [
                        "USERLIMITSTATUS",
                        "Статус",
                        "TUserLimitStatus",
                        "1",
                        "Состояние пользовательского ограничения"
                    ]
                ],
                "title": "Ограничения позиции по деньгам (обновляемая)",
                "desc": "Список пользовательских ограничений на максимальную и/или нетто-позицию на покупку и на продажу (в деньгах)         внутри дня",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список недоступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SECUNIQ_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (по кодам ЦБ) (обновляемая)",
                "desc": "Список доступных инструментов (по кодам ценных бумаг)",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_BLACK_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Чёрный список инструментов (обновляемая)",
                "desc": "Список недоступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            },
            "U_SEC_WHITE_LIST": {
                "output": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ],
                    [
                        "SECBOARD",
                        "Режим",
                        "CHAR",
                        "4",
                        "Идентификатор режима торгов для финансового инструмента"
                    ],
                    [
                        "SECCODE",
                        "Инструмент",
                        "CHAR",
                        "12",
                        "Идентификатор финансового инструмента"
                    ]
                ],
                "title": "Белый список инструментов (обновляемая)",
                "desc": "Список доступных инструментов",
                "input": [
                    [
                        "FIRMID",
                        "Фирма",
                        "CHAR",
                        "12",
                        "Идентификатор фирмы"
                    ],
                    [
                        "SMALIMITSOWNERTYPE",
                        "Тип владельца SMA лимитов",
                        "TSMALimitsOwnerType",
                        "1",
                        "&nbsp;"
                    ],
                    [
                        "USERID",
                        "Участник / Группа",
                        "CHAR",
                        "12",
                        "Код участника или код группы"
                    ]
                ]
            }
        }
    }
}